{"url": "https://en.wikipedia.org/wiki/A_Bad_Moms_Christmas", "text": "2017 American Christmas comedy film\n\nA Bad Moms Christmas is a 2017 American Christmas comedy film written and directed by Jon Lucas and Scott Moore. It is a sequel to the 2016 film Bad Moms. The plot follows the three moms from the first film (Mila Kunis, Kristen Bell, and Kathryn Hahn) dealing with their own mothers (Christine Baranski, Cheryl Hines, and Susan Sarandon) visiting during the Christmas holiday.\n\nThe film was released in the United States on November 1, 2017, and grossed over $130 million. It received mixed reviews, with criticism aimed at the thin story and raunchiness.[3] In April 2019, it was announced that a sequel was in development.\n\nPlot [ edit ]\n\nAmy (Mila Kunis) is now in a happy relationship with Jessie (Jay Hernandez) and is looking forward to having a simple Christmas. Her plans are derailed when her overly critical mother, Ruth (Christine Baranski), texts her to say that she is coming for Christmas.\n\nMeanwhile, Kiki (Kristen Bell) is still overworked with her four kids but now her husband Kent is much more helpful. Kiki is surprised when her mother Sandy (Cheryl Hines) shows up three days earlier than expected and is planning to spend the next three weeks with Kiki. Sandy's love for Kiki is overwhelming, and smothering Kiki.\n\nWhen Carla (Kathryn Hahn) gets home, her mother, Isis (Susan Sarandon), has arrived, telling her she intends to spend time with her for the first time in years. Surprised by this turn of events, Carla is excited to spend time with her. Eventually, Amy, Kiki and Carla go to the mall where they express their misery over the holidays. But while commiserating about the pressures of the holidays they make a pact to \"take Christmas back\". Ruth tries to create a spectacle out of Christmas, rather than keeping it simple like Amy wanted. In an effort to tamp down those plans Amy takes the family to Sky Zone to meet up with Kiki and Carla and their families. Ruth, Sandy and Isis all meet and chat while their daughters have fun with their kids.\n\nAt work, Carla meets an erotic dancer named Ty (Justin Hartley), who says he is competing in a Sexy Santa competition and he asks Carla to be his date, which she enthusiastically accepts. Kiki continues to have issues with her mother's overbearing ways and decides to bring Sandy to Dr. Karl (Wanda Sykes) to discuss these issues. This leads to a breakdown in communication leading to Kiki scolding Sandy and causing her to leave the session.\n\nAmy and Kiki join Carla as they attend the Sexy Santa show. All the ladies in the room are impressed with Ty's dancing. To everyone's surprise, Isis gets up on the bar and starts dancing with Ty. Carla runs up to get Ty back, leading to a fight. When Carla brings Isis home, Isis tells her she needs money for a new investment, but Carla knows she's just going to gamble it all away and then disappear from Carla's life like it's been for years. Nonetheless, Carla relents and loans Isis the money.\n\nOn Christmas Eve, Sandy tells Kiki that she put up a cash offer for the house next door so that she can live right next to Kiki. Finally, Kiki lashes out and tells Sandy she cannot live next door and that she wants some space. Sandy leaves the room crying.\n\nAmy gets angry with Ruth when she discovers Ruth has invited a bunch of strangers over to her home to throw an elaborate Christmas party, exactly what Amy did not want. Amy loses her temper and demands everyone leave her home and tells Ruth to leave and get out of her life forever. Her kids, Jane and Dylan, witness this outburst and become upset with Amy. Meanwhile, Carla finds a note from Isis indicating she has just taken off with the money she lent her. Kiki is all alone as well.\n\nRuth goes to church for Midnight Mass and is, surprisingly, joined by Sandy and Isis. All the ladies criticize each other for their efforts as mothers, with each of them realizing their flaws. Amy's father, Hank, goes to her to talk about Ruth and the horrible fight they had, but acknowledging that while Ruth can be difficult to deal with, Ruth has always been incredibly insecure, always worried whether or not she was doing a good job as a mother, but she always had the right intentions and loved Amy unconditionally. Amy goes to the church where Ruth is in order to try and repair her relationship with her mother. The two apologize to each other, with both confessing how much they genuinely love each other. Ruth tells Amy that she is a wonderful mother. The two embrace tightly. As the clock strikes midnight, Amy realizes that she needs her mother to help her fix Christmas. The two rush home to start decorating the house properly.\n\nOn Christmas morning, Jane and Dylan go downstairs to see that Ruth has returned, the relationship has been repaired and the house looking wonderful with decorations and gifts. Kiki makes up with Sandy, who tells her she put the neighboring house on the market and admits that she's just always felt lonely on Christmas since Kiki's father died. Carla is then visited by Isis, who is serious about turning her life around and has a new job at Sky Zone.\n\nAll the families get together and Ruth, Sandy and Isis announce that they have become friends and are now planning to take a trip to Las Vegas.\n\nCast [ edit ]\n\nProduction [ edit ]\n\nIn December 2016, it was announced that A Bad Moms Christmas would be released on November 3, 2017, and that it would be Christmas-themed, with Bell, Hahn, and Kunis returning to reprise their roles.[4][5] The release date was subsequently moved up two days to November 1, 2017.[6] In April 2017, Justin Hartley joined the cast of the film,[7] and in May 2017, Susan Sarandon, Christine Baranski, and Cheryl Hines joined as the mothers' mothers, alongside Wanda Sykes and Jay Hernandez reprising their roles from the first film.[8]\n\nPrincipal photography on the film began in Atlanta, Georgia on May 1, 2017.[9][10]\n\nRelease [ edit ]\n\nA Bad Moms Christmas was released on Wednesday, November 1, 2017. It was originally scheduled for November 3, 2017, but was brought forward two days to avoid direct competition with Thor: Ragnarok.[11]\n\nIn Australia, the film was released under the title Bad Moms 2.\n\nHome media [ edit ]\n\nThe film was released by Universal Pictures Home Entertainment on DVD and Blu-ray on February 6, 2018, in the United States and Canada.\n\nReception [ edit ]\n\nBox office [ edit ]\n\nA Bad Moms Christmas grossed $72.1 million in the United States and Canada, and $58.5 million in other territories, for a worldwide total of $130.6 million, against a production budget of $28 million.[2]\n\nIn North America, the film was projected to gross around $25 million from 3,615 theaters in its first five days (including $17 million over the weekend).[12] It took in $2.7 million on its first day,[13] and $17 million over the weekend, for a five-day total of $21.6 million, finishing second at the box office behind Thor: Ragnarok.[14]\n\nCritical response [ edit ]\n\nOn review aggregator Rotten Tomatoes, the film holds an approval rating of 31% based on 127 reviews with an average rating of 4.56/10. The website's critical consensus reads, \"Featuring twice the moms but roughly half the laughs, A Bad Moms Christmas is a slapdash holiday sequel that falls short of the original with a disappointing dearth of good cheer.\"[15] On Metacritic, which assigns a normalized rating to reviews, the film has a weighted average score of 42 out of 100, based on 30 critics, indicating \"mixed or average reviews\".[16] Audiences polled by CinemaScore gave the film an average grade of \"B\" on an A+ to F scale, down from the \"A\" earned by the first film, while PostTrak reported filmgoers gave it a \"very low\" 68% overall positive score.[13]\n\nOwen Gleiberman of Variety gave the film a mixed review, writing, \"A Bad Moms Christmas should appeal to the same—dare I say it?—demo that Bad Moms did, even though it's not nearly as wild a comedy. It has one halfway original idea, which is that when you're a mom yourself, the ability of your own mom to drive you nuts is heightened to the third power, because you're competing on levels that are almost primal.\"[17] Pete Hammond of Deadline Hollywood gave the film a positive review, calling it a \"good time movie\" and writing: \"...it goes way over the top, but I have to confess I laughed—a lot—and that's obviously the point even if this is not critic's fodder or meant to be. Subtle this is not, but A Bad Moms Christmas is the perfect tonic to lift your spirits and forget your troubles in these dark times.\"[18]\n\nSequel [ edit ]\n\nIn April 2019 during CinemaCon, it was announced that a sequel - Bad Moms' Moms - is in development. Sarandon, Baranski, and Hines will reprise their roles.[19]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/1/1f/BadMomsChristmas.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/1/1f/BadMomsChristmas.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/A_Bad_Moms_Christmas", "title": "A Bad Moms Christmas", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/1/1f/BadMomsChristmas.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}