{"url": "https://popculture.com/reality-tv/2017/11/20/jordan-fisher-eye-injury-dancing-with-the-stars-lindsay-arnold/", "text": "Dancing With the Stars is almost at the finish line for Season 25, and singer and actor Jordan Fisher has been a major contender for the Mirrorball Trophy all season long. However, both he and partner Lindsay Arnold are dealing with injuries that could keep the pair from taking home the top spot.\n\nIn a new clip shared by E! News, cameras captured the moment Arnold's finger sliced into her partner's eye during rehearsal, leaving Fisher with a painful-looking scratch on his cornea.\n\nAlong with his eye injury, Arnold is also dealing with a knee injury that she sustained during rehearsals for last week's show.\n\n\"Between Lindsay's knee and my eye, we're both not in the place that we would like to be for the finale week, but you know, you do what you can,\" Fisher says in the clip.\n\nTo help keep his scratch from becoming irritated, Fisher's eye doctor gave him a contact to wear, but that isn't doing much to help with the pain.\n\nAfter last week's show, during which Arnold wore a knee brace, the pair admitted it was the hardest one yet.\n\n\"We really had to rely on each other throughout this,\" Arnold told E! News. \"For me as a pro, usually I'm the one who can be the shoulder to lean on. I needed Jordan today as much as he needed me. I feel like that's how we were able to get through this incredibly insane day.\"\n\nFisher added, \"We're both kind of battered and bruised right now and both very exhausted, but I couldn't be more grateful to be able to share this experience with Lindsay.\"\n\nThe Dancing with the Stars finale airs Monday at 8 p.m. ET and Tuesday at 9 p.m. ET on ABC.\n\nPhoto Credit: ABC", "images": ["https://media.popculture.com/2017/05/default-1.png"], "top_img": "https://media.popculture.com/2017/05/default-1.png", "keywords": [], "authors": [], "canonical_link": "https://popculture.com/reality-tv/2017/11/20/jordan-fisher-eye-injury-dancing-with-the-stars-lindsay-arnold/", "title": "Could Jordan Fisher's Eye Injury Keep Him From Winning DWTS?", "meta_data": {"description": "Dancing With the Stars is almost at the finish line for Season 25, and singer and actor Jordan Fisher has been a major contender for the Mirrorball Trophy all season long. However, both he and partner Lindsay Arnold are dealing with injuries that could keep the pair from taking home the top [...]", "keywords": "Dancing With the Stars,Reality TV (genre),TV show,ABC,Celebrity News,Celebrities", "news_keywords": "Dancing With the Stars,Reality TV (genre),TV show,ABC,Celebrity News,Celebrities", "twitter": {"card": "summary", "site": "@PopCulture", "creator": "@PopCulture", "title": "Could Jordan Fisher's Eye Injury Keep Him From Winning DWTS?", "description": "Dancing With the Stars is almost at the finish line for Season 25, and singer and actor Jordan [...]", "image": "https://media.popculture.com/2017/05/default-1.png"}, "og": {"title": "Could Jordan Fisher's Eye Injury Keep Him From Winning DWTS?", "type": "article", "url": "https://popculture.com/reality-tv/2017/11/20/jordan-fisher-eye-injury-dancing-with-the-stars-lindsay-arnold/", "image": {"identifier": "https://media.popculture.com/2017/05/default-1.png", "width": 640, "height": 320}, "site_name": "Reality TV", "description": "Dancing With the Stars is almost at the finish line for Season 25, and singer and actor Jordan [...]"}, "fb": {"app_id": 398373180287205, "pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1511107200.0, "source": "https://popculture.com", "summary": ""}