{"url": "https://news.sky.com/story/royal-wedding-details-of-harry-and-meghans-cake-revealed-11297760", "text": "Prince Harry and Meghan Markle's wedding cake will be made by the owner of a hipster bakery in Hackney.\n\nKensington Palace said Ms Markle and Prince Harry chose American Claire Ptak to create their wedding cake, which will be lemon and elderflower.\n\nThey asked Ms Ptak to incorporate the \"bright flavours of spring\" for their 19 May wedding.\n\nMs Markle previously interviewed Ms Ptak for her lifestyle website thetig.com, which she shut down when her relationship with Prince Harry was confirmed.\n\nMs Ptak was brought up in California and previously worked for Alice Waters at Chez Panisse in Berkeley, California.\n\nAdvertisement\n\nShe moved to Britain and opened her own business, running a market stall in Broadway Market, east London, before opening her own organic bakery in 2010.\n\nThe lemon and elderflower cake will be covered in buttercream and decorated with fresh flowers.\n\n:: Queen approves wedding of 'Prince Henry and Rachel Markle'\n\nKensington Palace said Harry and Ms Markle were \"very much looking forward to sharing this cake with their wedding guests\".\n\nImage: Prince Harry and Meghan Markle in Birmingham this year\n\nMs Ptak said: \"I can't tell you how delighted I am to be chosen to make Prince Harry and Ms Markle's wedding cake. Knowing that they really share the same values as I do about food provenance, sustainability, seasonality and most importantly flavour, makes this the most exciting event to be a part of.\"\n\nMini cupcakes at Ms Ptak's bakery start at £1.50, and her wedding cakes are priced on request.\n\nOn her website, Ms Ptak states: \"For weddings, we recommend either our vanilla, chocolate, carrot, lemon or coconut cream cake finished with super deluxe satiny Swiss meringue buttercream icing covering the top and sides of a tiered cake.\n\n\"The cake can then be decorated with a crown of icing pearls on top and along the base and fresh flowers. We work with a local florist to match the flowers to your event.\"\n\nImage: Prince Harry and Meghan Markle taste traditional Welsh cakes during a visit to Cardiff Castle\n\n:: Pubs to stay open late for Prince Harry and Meghan Markle's wedding weekend\n\nThe baker also runs a podcast project where she interviews women she admires, and past episode guests include Alice Levine and Thomasina Miers.\n\nPrince William and Catherine's cake for the 2011 wedding was made by Fiona Cairns, and was a more traditional fruit cake, with the couple understood to have kept one of the eight tiers for the christening of their first child.\n\nMs Cairns told Hello magazine that Catherine, the Duchess of Cambridge, had a lot of input into the cake, with the lace design from her wedding dress added, as well as her choice of flowers and leaves.\n\nImage: Fiona Cairns with Prince William and Kate's wedding cake in 2011\n\nPrince Harry and Ms Markle have not released a guest list or details of her wedding dress designer, but have said they will be inviting 2,640 members of the public to Windsor Castle for the Royal wedding.\n\nThe guest list will include 1,200 young people and others who have served their communities and shown strong leadership.\n\nMel B also hinted that all five members of the Spice Girls have been invited.", "images": ["https://news.sky.com/resources/sky-news-logo.png?v=1?bypass-service-worker", "https://news.sky.com/resources/sky-spectrum-logo.png", "https://e3.365dm.com/18/03/1600x900/skynews-violet-bakery-royal-wedding-cake_4260252.jpg?20180320102549", "https://e3.365dm.com/18/03/768x432/skynews-meghan-markle-harry_4260280.jpg?20180320105705", "https://sb.scorecardresearch.com/p?c1=2&c2=6035677&cv=2.0&cj=1", "https://e3.365dm.com/18/03/768x432/skynews-wedding-royal-wedding_4260308.jpg?20180320112508", "https://e3.365dm.com/18/03/768x432/skynews-violet-bakery-royal-wedding-cake_4260252.jpg?20180320102549", "https://e3.365dm.com/18/03/768x432/skynews-prince-harry-meghan-markle_4249966.jpg?20180308113408"], "top_img": "https://e3.365dm.com/18/03/1600x900/skynews-violet-bakery-royal-wedding-cake_4260252.jpg?20180320102549", "keywords": [], "authors": [], "canonical_link": "https://news.sky.com/story/royal-wedding-details-of-harry-and-meghans-cake-revealed-11297760", "title": "Royal wedding: Details of Harry and Meghan's cake revealed", "meta_data": {"apple-itunes-app": "app-id=316391924", "description": "Pastry chef Claire Ptak, who runs Violet Cakes in Hackney, east London, will make the couple's lemon and elderflower wedding cake.", "robots": "NOODP,INDEX,FOLLOW", "viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "format-detection": "telephone=no", "HandheldFriendly": "True", "twitter": {"card": "summary_large_image", "site": "@skynews", "title": "Royal wedding: Details of Harry and Meghan's cake revealed", "description": "Pastry chef Claire Ptak, who runs Violet Cakes in Hackney, east London, will make the couple's lemon and elderflower wedding cake.", "image": {"identifier": "https://e3.365dm.com/18/03/768x432/skynews-violet-bakery-royal-wedding-cake_4260252.jpg?20180320102549", "alt": "Claire Ptak, owner of Violet Bakery in Hackney, east London"}, "app": {"country": "GB", "id": {"iphone": 316391924, "ipad": 316391924, "googleplay": "com.bskyb.skynews.android"}}}, "fb": {"app_id": 744976955573926}, "og": {"site_name": "Sky News", "locale": "en_GB", "title": "Royal wedding: Details of Harry and Meghan's cake revealed", "description": "Pastry chef Claire Ptak, who runs Violet Cakes in Hackney, east London, will make the couple's lemon and elderflower wedding cake.", "url": "https://news.sky.com/story/royal-wedding-details-of-harry-and-meghans-cake-revealed-11297760", "type": "article", "image": "https://e3.365dm.com/18/03/1600x900/skynews-violet-bakery-royal-wedding-cake_4260252.jpg?20180320102549"}}, "movies": [], "publish_date": null, "source": "https://news.sky.com", "summary": ""}