{"url": "https://www.bustle.com/p/the-dragon-frappuccino-at-starbucks-is-the-unicorn-frappuccinos-unofficial-successor-its-just-as-magically-delicious-53415", "text": "Last week, Starbucks introduced the limited-time-only Unicorn Frappuccino, and the interwebs went bonkers. The creation was served only through April 23, but coffee drinkers weren't quite ready to let go. Enter the unofficial Starbucks \"Dragon Frappuccino.\" If you were bummed to see the Unicorn Frapp make its exit (I mean, who wasn't?), you might just love this twist on beverages inspired by mythological creatures.\n\nThe Dragon Frappuccino isn't an official menu item, according to a Starbucks spokesperson. Rather, it appears to be a brilliant idea on the part of some creative baristas. Its existence is possible due to the virtually endless customization you can employ when ordering your favorite Sbux drinks. \"In addition to the beverage options listed on our menu boards, there are more than 170,000 ways baristas can customize beverages at Starbucks, including selecting from a variety of milks, syrups, coffee/espresso options, and toppings,\" a Starbucks spokesperson tells Bustle. \"This high level of personalization allows our customers to tailor their drink to match their personal taste preferences.\" The Dragon Frappuccino seems to have been born from this \"anything goes\" philosophy, and people are loving it.\n\nThe Unicorn Frappuccino originally came with a stipulation on its availability: You could get it from April 19 through April 23, or as long as supplies lasted. Indeed, it ended up being so popular (because, I mean, look at it) that the \"as long as supplies last\" part proved to be a key factor. Some locations did in fact run out of the ingredients before the April 23 deadline. So someone, somewhere got inventive and came up with what we now call the Dragon Frapp. As one Instagram user put it when attempting to order the Unicorn Frappuccino, \"They were out of the ingredients and offered me something not only cooler and better tasting, but easier to make: The Dragon Frappuccino.\"\n\nWhile I honestly don't know for sure what's in the Dragon Frappuccino, one customer said on Instagram that it was a green tea Frapp with some vanilla bean powder and \"berry cup swirl.\" The consensus seems to be that the Dragon Frapp is a little less sweet than the Unicorn Frapp.\n\nHowever, if you want to order one, you'll have to get creative. Says a Starbucks spokesperson to Bustle, \"If customers want to order a beverage that is not listed on our menu boards, we recommend they know the recipe so that their barista can handcraft the beverage perfectly for them.\" So in other words, don't go to a Starbucks, try to order a \"Dragon Frappuccino,\" and expect your barista to know what you mean. Instead, your best bet is to tell the barista that you want a Green Tea Frappuccino with vanilla bean powder blended up into it and a berry swirl in the cup. Once you've got that perfectly customized drink in your hand, you can call it whatever the heck you want — just have pity on your poor barista and don't order an item by a random name that they'll likely have no idea about.\n\nWhile the Dragon Frappuccino may be less labor-intensive than its unicorn counterpart, it's possible that the swirly purple ingredient is left over from Starbucks unicorn days — meaning there might be a limited supply. (However, this hasn't been confirmed by anyone, so just take it as speculation on my part.) In other words, enjoy the Dragon Frappuccino while you can, folks, because it might peace out eventually.\n\nIt might not be quite as popular as the Unicorn Frapp, but you've got to admit that the Dragon Frapp is still a creative take on the coffee giant's trademark drink. One can only imagine what they'll think of next. (Mermaid Frapp? Fairy Frapp? Loch Ness Monster Frapp? Just throwing those out there...)", "images": ["https://imgix.bustle.com/uploads/getty/2020/4/13/e2f6460c-7b4a-4770-ad7f-abac97c2a062-getty-1215286702.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/2017/4/25/89988724.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/14/0dbcf1b8-7d32-416c-8555-cdf7266e8401-getty-1194791218.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/14/5b08cb8e-8df8-4235-99e9-5c86ec20261e-getty-1216497746.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/17/6cafd5c9-c4fc-4c4c-8315-e0c9ece1c0ab-unnamed-1.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/2017/4/25/89988724.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/2017/4/25/89988724.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/the-dragon-frappuccino-at-starbucks-is-the-unicorn-frappuccinos-unofficial-successor-its-just-as-magically-delicious-53415", "title": "The \"Dragon Frappuccino\" At Starbucks Is The Unicorn Frappuccino's Unofficial Successor & It's Just As Magically Delicious", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/the-dragon-frappuccino-at-starbucks-is-the-unicorn-frappuccinos-unofficial-successor-its-just-as-magically-delicious-53415", "type": "article", "title": "Meet The Unicorn Frappuccino's Unofficial Successor", "description": "Last week, Starbucks introduced the limited-time-only Unicorn Frappuccino, and the interwebs went bonkers. The creation was served only through April 23, but coffee drinkers weren't quite ready to let go. Enter the unofficial Starbucks \"Dragon…", "image": {"identifier": "https://imgix.bustle.com/2017/4/25/89988724.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Last week, Starbucks introduced the limited-time-only Unicorn Frappuccino, and the interwebs went bonkers. The creation was served only through April 23, but coffee drinkers weren't quite ready to let go. Enter the unofficial Starbucks \"Dragon…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}