{"url": "heavy.com/entertainment/2017/08/chris-pratt-anna-faris-separating-divorce-children-cheating-rumors-photos/", "text": "Actors Chris Pratt and Anna Faris are separating.\n\nThe former broke the news on Facebook on Sunday night, with a message that read: “Anna and I are sad to announce we are legally separating. We tried hard for a long time and we’re really disappointed. Our son has two parents who love him very much.”\n\nRead the full post below.\n\nPratt and Faris have been married since 2008, and have one child together, Jack.\n\nHere’s what you need to know about their relationship:\n\n1. They Met While Playing Love Interests in the 2007 Film ‘Take Me Home Tonight’\n\nTake Me Home Tonight – The Proposal 2011-02-24T00:30:08.000Z\n\nWhile Pratt and Faris grew up only 20 minutes away from each other, they didn’t meet until they were cast as love interests in the 2011 comedy Take Me Home Tonight (production began in 2007). Faris was married to actor Ben Indra at the time, but it was obvious that sparks were flying between her and the Parks & Recreation alum.\n\n“In retrospect,” Pratt told Elle magazine, “They both had one foot out the door for a long time. We were friends first, but she left her husband at the end of the movie, and we started dating when we were back in L.A. So we were friends, and I was there for her… We never crossed the line. But we were, I think, developing feelings for each other at the time, you know? The day that she told me she was leaving her husband, I knew that I was going to marry her.”\n\nChris Pratt and Anna Faris’ Cutest MomentsCould Chris Pratt and Anna Faris be any cuter? Subscribe to Harper's Bazaar: http://bit.ly/SUBSCRIBEtoBAZAAR https://www.facebook.com/HarpersBazaar https://twitter.com/harpersbazaarus https://www.instagram.com/harpersbazaarus/ https://www.pinterest.com/harpersbazaar/?auto_follow=1 America's first fashion magazine, Harper's Bazaar has showcased the visions of legendary editors, photographers and stylists since 1867. 2017-05-11T20:00:03.000Z\n\nFaris divorced Indra in 2008, and she and Pratt were married the following year in Bali, Indonesia. The Scary Movie actress told People magazine that it was a small ceremony and that her new husband was “A great guy. I feel really lucky.”\n\nPratt and Faris have continued to act alongside one another, co-starring in What’s Your Number? (2011) and Movie 43 (2013). In the latter, they play characters who are romantically involved.\n\n2. Pratt Claimed Their Relationship Made Him Believe in ‘Divine Intervention & Destiny’\n\nAnna Faris on Husband Chris PrattHer handsome husband has been making a splash on the big screen! Anna talked to Ellen about their relationship. 2014-09-26T06:01:50.000Z\n\nBoth Pratt and Faris have been vocal and supportive of each other in the media, and when the former held an AMA Reddit in 2015, he went as far as to say that Faris made him believe in divine intervention. “Anna and I are meant to be together,” he wrote, “Our relationship has made me believe in divine intervention and destiny, just as much as my crazy career and the way I fell into this life.”\n\nPratt went on to highlight the similarities their careers have, listing “We both got our start in horror spoofs. We both did an animated movie for Phil Lord and Chris Miller. We both made our careers guileless nitwits for laughs We both have parents that have suffered with MS. The similarities go on and on. Anna is a great wife. Very patient and understanding.”\n\nAt Home with Anna Faris & Chris Pratt | E! People's Choice AwardsAnna and Chris ask Allison Janney for a little help at home. SUBSCRIBE: http://eonli.ne/RedCarpetSubscribe About People’s Choice Awards: The E! People’s Choice Awards celebrates all forms of entertainment, chosen entirely by the fans. Connect with People’s Choice Awards: Visit the People’s Choice Awards on E! ONLINE: http://eonli.ne/peopleschoiceawards Follow People’s Choice Awards on TWITTER: http://twitter.com/peopleschoice Follow People’s Choice Awards on FACEBOOK: http://facebook.com/peopleschoice Check out People’s Choice Awards on INSTAGRAM: http://instagram.com/peopleschoice About E! Red Carpet and Award Shows: E! is the ultimate destination for Red Carpet coverage. And for the first time ever we’re taking you from the E! People’s Choice Awards directly into the show as E! is the new home of the People’s Choice Awards. From the Academy Awards to the Emmys, we give you an insider's view of the arrivals, exclusive interviews and of course, cover every stitch of the fabulous fashion. Only \"Live From the Red Carpet\" hosts Ryan Seacrest and Giuliana Rancic, along with E!’s entire awards team of fashion and entertainment experts, have the most comprehensive LIVE coverage of the biggest premieres and events. Connect with E! Red Carpet and Award Shows: Visit the E! News WEBSITE: http://eonli.ne/enews Follow E! Live from the Red Carpet on TWITTER: http://eonli.ne/RedCarpetTwitter Follow E! News on TWITTER: http://eonli.ne/ENewsTW Like E! News on FACEBOOK: http://eonli.ne/ENewsFB Check out E! News on INSTAGRAM: http://eonli.ne/ENewsIG At Home with Anna Faris & Chris Pratt | E! People's Choice Awards https://youtu.be/wToyFR0tKhI https://www.youtube.com/ERedCarpetandAwardShows 2015-01-08T21:27:41.000Z\n\nThey have also been known to poke fun at their public image. Faris jokingly interviewed Jennifer Lawrence, who filmed a sex scene with Pratt for the film Passengers (2016), while the couple played exaggerated versions of themselves for a People’s Choice Award skit.\n\nAs a result, Pratt and Faris have frequently been cited as one of the most beloved couples in Hollywood.\n\n3. Their Son, Jack Pratt, Was Born Premature in 2012\n\nThe couple welcomed their first and only child, Jack Pratt, in August 2012. According to People magazine, Jack was born nine weeks premature, and subsequently spent time in an intensive care unit. “We were scared for a long time,” said Pratt, “We prayed a lot.”\n\nFaris recounted the experience to Redbook magazine in 2015: “My water broke in the middle of the night at seven months. We rushed to the hospital, and they were able to halt active labor with magnesium. I was at the hospital and the goal was to be in bed for four weeks… but on the seventh day, I went into labor again.”\n\n“I was in denial,” Faris added, “For hours I was like, ‘I’m just having indigestion.’ Chris and I were so scared, but when Jack came out, even though he was so tiny, he looked so good to us.”\n\nAfter Jack’s health improved, Pratt told People magazine was it gave him a new outlook on life. “It restored my faith in God, not that it needed to be restored, but it really redefined it. ”\n\nPratt went on to say “The baby was so beautiful to us, and I look back at the photos of him and it must have been jarring for other people to come in and see him, but to us he was so beautiful and perfect.”\n\n4. Faris Admitted That Pratt’s Cheating Rumors Made Her Feel ‘Insecure’ in 2016\n\nAnna Faris Is Unqualified #74: Isla Fisher part oneThis week on Unqualified, Anna and Sim hang out with actress Isla Fisher (Nocturnal Animals, Wedding Crashers, Confessions of a Shopaholic). They talk about tabloid rumors, peaking at the 2007 MTV Video Music Awards, and what it’s like being a mom in Hollywood, before testing out how Isla would proceed in some crazy scenarios. Karen Sarducci… —- SUBCRIBE – https://goo.gl/HHHUYp Not-great-relationship advice from completely unqualified Hollywood types. I am a solid 3.4 student with a major in English from the University of Washington. I've also been asked what my SAT score was and it was 1060 2017-04-08T12:30:02.000Z\n\nDuring an episode of her podcast Unqualified, Faris spoke on the tabloid rumors that Pratt was having an extramarital affair with Lawrence. “We grapple with the idea of being a public couple,” she told her special guest Isla Fisher, “For the first time, maybe a year ago or 10 months ago, we were in the public a little bit. There were some tabloid rumors about strain in our relationship. I just remember feeling so hurt in a way that bothered me because I didn’t want to think of myself as somebody that could be affected by tabloid s**t.”\n\nFaris went on to say “I take pride in how great my relationship is with Chris. But having said that, of course, in this crazy world where hr’s off doing movies and I’m in L.A. raising our child, of course I’m going to feel vulnerable, like any normal human would. It made me feel incredibly insecure.”\n\nThese rumors were never proven to be true, and according to OK Magazine, Lawrence was devastated by any issues she caused in her co-star’s marriage. A source close to the actress said “Jen has found the claims very upsetting, because she’d never go near a married man.”\n\n5. While They Are Separated, They Remain Legally Married\n\nWhile Pratt stated in his Facebook post that he and Faris will be legally separated, he made no mention of divorce. According to Attorneys.com, a legal separation means that you are still legally married to your spouse even though you are living apart. This means that if Pratt and Faris intended to divorce at some point, they would still have to go through the legal steps necessary to terminate their marriage.\n\nFaris posted the same announcement on her official Twitter account, in the form of a text screenshot. Both actors have made it a point to keep the details of their separation private for the sake of their son.\n\nIn an interview with E! Online in 2016, Faris spoke on the importance that raising Jack has on both of their lives: “We want Jack to have as normal of a childhood or at least a similar childhood as we had.” She also proved that media exposure hasn’t diminished her son’s sense of wonderment. “The other day I was picking him up from his pre-school and there was some paparazzi—that doesn’t happen very often, when Chris is around and in town it’s different—but Jack waved at them and said, ‘Cheese!'”", "images": ["https://2.gravatar.com/avatar/bf922f581d064252c8ce95fd95bd5c4c?s=71&d=https%3A%2F%2F2.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D71&r=PG", "https://sb.scorecardresearch.com/p?c1=2&c2=20567959cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://heavyeditorial.files.wordpress.com/2017/08/gettyimages-672334432_opt.jpg?quality=65&strip=all&w=150&h=100&crop=1", "https://heavyeditorial.files.wordpress.com/2017/08/gettyimages-670489508.jpg?quality=65&strip=all&w=150&h=100&crop=1", "https://heavyeditorial.files.wordpress.com/2017/08/gettyimages-629895228.jpg?quality=65&strip=all&w=780", "https://certify.alexametrics.com/atrk.gif?account=lfktn1QolK10vg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://heavyeditorial.files.wordpress.com/2017/08/gettyimages-629895228.jpg?quality=65&strip=all&w=780", "keywords": [], "authors": ["Danilo Castro"], "canonical_link": "https://heavy.com/entertainment/2017/08/chris-pratt-anna-faris-separating-divorce-children-cheating-rumors-photos/", "title": "Chris Pratt & Anna Faris Separation: 5 Fast Facts You Need to Know", "meta_data": {"google-site-verification": "nfPVut3DNEWv3BaV0stQ8yOV3TeBg_TWFdQzQYaG8Qs", "robots": "noodp, noydir", "HandheldFriendly": "True", "MobileOptimized": 360, "viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "msapplication-TileColor": "#121212", "theme-color": "#121212", "description": "Chris Pratt and Anna Faris are legally separating. Learn about their eight year marriage here.", "news_keywords": "Chris Pratt, Anna Faris, separation, Chris Pratt divorce", "keywords": "chris pratt, anna faris, separation, chris pratt divorce", "msvalidate.01": "D36F6DC077CF4906C4E074037A94917B", "generator": "WordPress.com", "author": "Danilo Castro", "twitter": {"url": "https://heavy.com/entertainment/2017/08/chris-pratt-anna-faris-separating-divorce-children-cheating-rumors-photos", "card": "summary", "site": "@heavysan", "creator": "@heavysan"}, "fb": {"admins": 1041016861, "app_id": 1103740676351644}, "article": {"publisher": "https://www.facebook.com/heavycom", "published_time": "2017-08-07T04:31:19+00:00", "modified_time": "2017-08-07T05:23:06+00:00", "author": "https://heavy.com/author/danilocastro213/", "section": "Entertainment", "tag": "Chris Pratt"}, "og": {"image": {"identifier": "https://heavyeditorial.files.wordpress.com/2017/08/gettyimages-629895228.jpg?quality=65&strip=all", "width": 780, "height": 440}, "site_name": "Heavy.com", "type": "article", "locale": "en_US", "url": "https://heavy.com/entertainment/2017/08/chris-pratt-anna-faris-separating-divorce-children-cheating-rumors-photos/", "title": "Chris Pratt & Anna Faris Separation: 5 Fast Facts You Need to Know", "description": "Chris Pratt and Anna Faris are legally separating. Learn about their eight year marriage here."}, "application-name": "Heavy.com", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Breaking News, Sports, Entertainment, TV, Tech, Gaming & Health.", "msapplication-task": "name=Subscribe;action-uri=https://heavy.com/feed/;icon-uri=https://secure.gravatar.com/blavatar/6e68a7d5b8fce58735ab84f887ee5981?s=16", "ir-site-verification-token": 268982007}, "movies": [], "publish_date": 1502080279.0, "source": "http://heavy.com", "summary": ""}