{"url": "https://metro.co.uk/2017/05/29/kim-kardashian-claims-kendall-jenner-was-never-part-of-taylor-swifts-squad-after-kanye-feud-6668707/", "text": "Kim Kardashian claims she didn’t make it awkward – they were never really friends (Picture: Bravo/WWHL)\n\nKim Kardashian didn’t really think about her little sister Kendall Jenner when sharing that controversial video of Kanye West’s chat with Taylor Swift over Famous.\n\nThe mother-of-two wasn’t bothered about making it awkward for her model sister, who was often considered part of Taylor’s ‘squad’. Well, up until that moment at least.\n\nSome of Kendall’s BFFs including Gigi and Bella Hadid are some of Taylor’s pals, and the Estee Lauder beauty has even joined the Bad Blood star on stage for her shows.\n\nShe hasn’t heard from Taylor again and we’re not surprised (Picture: Bravo/WWHL)\n\nKim doesn’t seem to be that bothered though (Picture: Bravo/WWHL)\n\nDuring an appearance on Watch What Happens Live, Kim was asked if she had made life awkward for Kendall and her pal Taylor after she posted the conversation on her Snapchat. (Much to the delight of the world).\n\nAdvertisement\n\nAdvertisement\n\n‘I don’t know if Kendall was a part of her squad, I don’t think she was,’ said Kim.\n\n‘I don’t think it was awkward.’\n\nWhen asked if Kim had ever heard from Taylor again, she simply shook her head and then shrugged her shoulders.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nPeople may say Kim doesn’t have any talent, but she managed to pull a Julian Assange on Taylor last year.\n\nThe reality star released the video of Kanye West on the phone to Taylor where he recited the lyrics to his song Famous and she told him ‘ I mean go with whatever line you think is better. It’s obviously very tongue in cheek either way.’\n\nKendall Jenner, Taylor Swift and Gigi Hadid perform The 1989 World Tour onstage during the British Summertime (Picture: by Dave Hogan/TAS/Getty Images for TAS)\n\nTaylor hit back by claiming that she never heard the use of the word ‘that bitch’ when Kanye recited the lyrics, which technically wasn’t heard on the recordings Kim posted to Snapchat.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nBack in February last year when the song was released, Taylor released a statement condemning Kanye which he responded to by tweeting that Swift had approved the line well before it was released.\n\nAdvertisement\n\nAdvertisement\n\nShe then offered (what many assumed to be) a not so veiled dig at the rapper during her Grammy awards acceptance speech.\n\nAnd as the first woman to win Album of the Year at the Grammys twice, I want to say to the young woman out there, there are going to be people along the way who try to undercut your success or take credit for your accomplishments or your fame. But if you just focus on the work and you don’t let those people sidetrack you, someday when you get where you’re going, you will look around and you will know it was you and the people who love you who put you there, and that will be the greatest feeling in the world.\n\nShe didn’t mention the use of ‘bitch’ in her speech but did refer to the line it was used in as she hit back at Kanye for claiming he made her famous.\n\nFull Taylor Swift/Kanye West transcript Kanye West: You still got the Nashville number? Taylor Swift: I still have the Nashville um, area code but I had to change it. KW: For all my southside n***** that know me best, I feel like me and Taylor might still have sex. TS: I’m like this close to over exposure… KW: Oh well this this one, I think this is a really cool thing to have, uh… TS: I know, I mean it’s like a compliment kind of. KW: All I give a fuck about is just you as a person and as a friend I want things that make… TS: That’s sweet. KW: I don’t want to do rap that makes people feel bad. TS: Um, yeah I mean go with whatever line you think is better. It’s obviously very tongue in cheek either way. And I really appreciate you telling me about it, that’s really nice. KW: Yeah, I just had a responsibility to you as a friend, you know, and thanks for being like so cool about it. TS: Aw thanks. Yeah I really appreciate it. The heads up is soo nice, and I really appreciate it and I never would’ve expected you to tell me about a line in one of your songs. And the flowers that you sent me, I like Instagrammed a picture of them and it’s the most Instagram likes I’ve ever gotten it was like 2.7… KW: Relationships are more important than punchlines, you know. TS: Yeah, I mean I don’t think anybody would listen to that and be like oh that’s a real diss, like she must be crying. You’ve gotta tell the story the way that it happened to you and the way that you experienced it. Like you honestly didn’t know who I was before that. It doesn’t matter if I sold 7 million of that album before you did that, which is what happened. You didn’t know who I was before that it’s fine. I might be that I can make these things happen that I create these things and concepts and like I’m always going to respect you and I’m really glad that you have the respect to call me and tell me that this time about the song and… It’s just like a really cool thing to do like and it really shows the friendship so thank you. KW: Thank you too. TS: And you know if people ask me about it I think it would great for me to be like look he called me and told me the line before it came out like so jokes on you guys we’re fine. You guys want to call this a feud you want to call this throwing shade. Right after the song comes out I’m going to be on a Grammy red carpet and I’m gonna be like, He called me. Yeah, she does, it made her famous. You know, it’s more provocative to say ‘Might still have sex’… it’s not..it’s not..it doesn’t matter to me. There’s not one that hurts my feelings and one that doesn’t.\n\nBut in the recording she tells Kanye, ‘Yeah, I mean I don’t think anybody would listen to that and be like oh that’s a real diss, like she must be crying. You’ve gotta tell the story the way that it happened to you and the way that you experienced it. Like you honestly didn’t know who I was before that. It doesn’t matter if I sold 7 million of that album before you didn’t that, which is what happened. You didn’t know who I was before that it’s fine.’\n\nAdvertisement\n\nSince the recording has been released the online world has thrown their support behind Kim and Kanye. Taylor took to social media to defend herself after no doubt a deluge of social shade.\n\nThat moment when Kanye West secretly records your phone call, then Kim posts it on the Internet. pic.twitter.com/4GJqdyykQu — Taylor Swift (@taylorswift13) July 18, 2016\n\nMetro.co.uk has contacted Taylor’s reps for further comment.\n\nMORE: Kim Kardashian celebrates third anniversary with Kanye West after Ariana Grande social media fail\n\nMORE: Kim Kardashian removes tribute to Ariana Grande and victims of Manchester terror attack following online abuse from trolls", "images": ["https://d17fy28x8ov4h8.cloudfront.net/190x/images/j/JL_Brandlines_Logo_Micro_Use_Blk_RGB-100px_9.png", "https://d3tsytm1wtjqo2.cloudfront.net/180x/images/c/currys_9.png", "https://metro.co.uk/wp-content/themes/metro-parent/img/fallback.png", "https://i2.wp.com/metro.co.uk/wp-content/uploads/2017/05/kim2.png?quality=90&strip=all&zoom=1&resize=644%2C379&ssl=1", "https://d17fy28x8ov4h8.cloudfront.net/190x/images/v/virgin-media_9.png", "https://sb.scorecardresearch.com/p?c1=2&c2=6034964&cv=2.0&cj=1", "https://d3tsytm1wtjqo2.cloudfront.net/images/media/72/n/nord_logo_square_1x_9.png", "https://i0.wp.com/metro.co.uk/wp-content/uploads/2017/05/kim3.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "https://d17fy28x8ov4h8.cloudfront.net/190x/images/w/Wickes-Logo_9.png"], "top_img": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2017/05/kim3.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "keywords": [], "authors": ["Claire Eaton-Rutter"], "canonical_link": "https://metro.co.uk/2017/05/29/kim-kardashian-claims-kendall-jenner-was-never-part-of-taylor-swifts-squad-after-kanye-feud-6668707/", "title": "Kim Kardashian claims Kendall was never part of Taylor Swift’s squad", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "format-detection": "telephone=no", "robots": "max-image-preview:large", "google-site-verification": "NRfCb8mBNAy5_f17NpvLZYoY38EzM2dgpcOh_Am9yps", "twitter": {"widgets": {"csp": "on"}, "image": {"src": "https://metro.co.uk/wp-content/uploads/2017/05/kim3.png?w=1200&h=630&crop=1"}, "title": "Kim Kardashian claims Kendall Jenner was never part of Taylor Swift’s squad", "description": "The reality star appeared on WWHL.", "card": "summary_large_image", "site": "@MetroUK", "account_id": 138749160}, "ir-site-verification-token": 422605026, "description": "Kim Kardashian didn’t really think about her little sister Kendall Jenner when sharing that controversial video of Kanye West’s chat with Taylor Swift over Famous.", "news_keywords": "Kim Kardashian, Kim K, Kim Kardashian Twitter, Kim Kardashian Instagram, Taylor Swift, Kendall Jenner, Kanye West, Famous, Kanye West famous, Taylor Swift squad,", "msvalidate.01": "11110DC8D42E74E13F24B3A18E7CFB8A", "generator": "WordPress 5.4", "fb": {"pages": "117118184990145,427889824264313", "app_id": 176908729004638}, "ia": {"markup_url": "https://metro.co.uk/2017/05/29/kim-kardashian-claims-kendall-jenner-was-never-part-of-taylor-swifts-squad-after-kanye-feud-6668707/?ia_markup=1"}, "theme-color": "#000000", "apple-mobile-web-app-title": "Metro", "sailthru.date": "2017-05-29 08:45:18", "sailthru.title": "Kim Kardashian claims Kendall Jenner was never part of Taylor Swift’s squad after Kanye feud", "sailthru.tags": "kim kardashian, social media", "sailthru.description": "The reality star appeared on WWHL.", "sailthru.image.full": "https://metro.co.uk/wp-content/uploads/2017/05/kim3.png?w=150&h=150&crop=1", "sailthru.image.thumb": "https://metro.co.uk/wp-content/uploads/2017/05/kim3.png?w=50&h=150&crop=1", "og": {"locale": "en_GB", "title": "Kim Kardashian claims Kendall Jenner was never part of Taylor Swift’s squad", "type": "article", "url": "https://metro.co.uk/2017/05/29/kim-kardashian-claims-kendall-jenner-was-never-part-of-taylor-swifts-squad-after-kanye-feud-6668707/", "description": "The reality star appeared on WWHL.", "site_name": "Metro", "image": {"identifier": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2017/05/kim3.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "secure_url": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2017/05/kim3.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/MetroUK", "section": "Entertainment", "tag": "Social Media", "published_time": "2017-05-29T08:45:18+0000", "modified_time": "2019-12-12T10:45:16+0000"}, "msapplication-TileImage": "https://metro.co.uk/wp-content/uploads/2020/03/cropped-m-icon-black-9693.png?w=270"}, "movies": [], "publish_date": 1495987200.0, "source": "https://metro.co.uk", "summary": ""}