{"url": "https://en.wikipedia.org/wiki/911_(Law_%26_Order:_Special_Victims_Unit)", "text": "3rd episode of the seventh season of Law & Order: Special Victims Unit\n\n\"911\" is the third episode of the seventh season of the police procedural television series Law & Order: Special Victims Unit. It originally aired on October 4, 2005 in the United States.[1] The episode focuses on the search for a nine-year-old girl who claims to be locked in a room and calls the police for help. When it becomes clear that the phone call is not what it seems, most of the detectives in the unit become suspicious of the girl's story but Detective Olivia Benson (Mariska Hargitay) remains convinced, believing that she is a victim of child pornography.\n\nThe episode was written by Patrick Harbinson and directed by Ted Kotcheff. Unlike most other episodes of the series, the action takes place primarily in the police station with many scenes building suspense only by showing Detective Benson talk into a speaker phone. Hargitay won an Emmy Award for her portrayal of Benson in this episode. Three of the main cast members, Christopher Meloni, BD Wong, and Tamara Tunie do not appear.\n\nIn its original broadcast, \"911\" pulled in 16.24 million viewers and a 5.8 rating in the age 18–49 viewer demographic.\n\nPlot [ edit ]\n\nA nine-year-old girl named Maria calls 911 stating she is stuck in a room and needs help. The call is put through to Olivia Benson, and Maria tells her the telephone belongs to her father Richard and her mother, Beatrice, is dead. Cragen learns the phone Maria is calling from is registered to a cab driver named Ricardo Garcia, who was arrested for assaulting his wife.\n\nFin tracks down Garcia and orders him to take him to his apartment, but finds his daughter Angela safe there. Munch leads a search of the surrounding apartments, but fails to turn up any leads. Morales suggests Richard could have spoofed Garcia's phone number, making the task of tracing the call harder. When questioned further, Maria says Richard buys her food from \"Felipe's Burgers\", which is 20 blocks away from the search area. Fin goes to the location and learns it burned down three months prior. Benson then instructs Maria not to lie to her, and Maria hangs up.\n\nMorales enhances the background of Maria's previous call and reveals the sounds of traffic, bells and a car engine despite the phone signal not moving. After Novak brings in an expert to track Maria's dialect, Maria calls back with a signal in the Holland Tunnel, insisting she did not move. Cragen orders Fin to the tunnel and shuts it down to search every vehicle for Maria. Meanwhile, Julia confirms that Maria is from Honduras prompting Novak to meet the Honduran consul to convince him to connect to the Honduran police.\n\nThe SVU team notices Maria's signal not moving in over a half-hour and instructs her to hang up and call back. When she does, her new signal puts her in central Queens, which given the circumstances, is impossible. They also reveal to Benson that the background traffic noises are playing in a tape loop. Doubts surrounding the authenticity of Maria's call begin to grow and Cragen declines to arrange another search for her. A solution to the mystery is revealed when FBI expert Rachel Sorannis discovers that the phone company's switchboard was infected with a virus that redirects the signal to random cell towers. A photo of Maria from her ninth birthday comes in from the consulate, and Maria describes exactly what she was wearing in the photo. Benson recognizes her from a notice sent by the Montreal SVU about an unknown child pornographer.\n\nMaria describes Richard as having brown hair and silver glasses that come in a blue case. While Benson convinces her to stay on the phone and not fall asleep, Sorannis locates and removes the virus. To get her real location, Maria has to hang up and call one more time, but before she can, Richard arrives and hangs up himself. The detectives look through photos of Maria for clues and Munch observes a mug with the logo of Felipe's Burgers on it. When Fin sees this, he remembers there is an electronics store across the street from where the restaurant was.\n\nBenson and Tutuola go to the store and Benson notices a driver taking his folded glasses out of a blue case and putting them on; she and Fin stop him before he can drive off. He identifies himself as Richard Dwyer. In the basement of his store, they find Richard's child pornography studio, but no sign of Maria. When Dwyer tries to escape, Benson punches him out. From the mud on his shoes, Benson and Fin find chips of burnt wood in the mud and trace it back to the empty lot at Felipe's. They dig through the earth and find Maria buried. Benson revives her with CPR and the two finally meet face to face.\n\nProduction [ edit ]\n\n\"911\" was written by Patrick Harbinson and directed by Ted Kotcheff who is an executive producer of the series. As mentioned in the show, part of the inspiration for the episode came from a hoax perpetrated by a girl claiming to be four years old and a witness to a crime.[1] The call drove police into a search in September 2004.\n\nSince \"911\" focused predominantly on Olivia Benson, the production team chose \"Ripped\" which focused on Elliot Stabler as the next episode to air.[2] This, however, did not follow the chronology of events as intended by the writers - the title cards for \"Ripped\" have it taking place closer to the end of the season. The episode that follows \"911\" chronologically is the fifth episode of the season, \"Strain\". Christopher Meloni appears in neither \"911\" nor \"Strain\" coinciding with an in-universe absence of Elliot Stabler while he was working on another case.\n\nReception [ edit ]\n\nRatings [ edit ]\n\nDuring its October 4, 2005 broadcast on NBC, \"911\" was watched by 16.24 million viewers and achieved a 5.8 rating in the 18–49 age demographic.[3]\n\nCritical response [ edit ]\n\nMariska Hargitay won an Emmy Award at the 58th Primetime Emmy Awards for \"Outstanding Lead Actress in a Drama Series\" for her performance in this episode.[1] \"911\" was acclaimed by Matt Roush of TV Guide who watched the episode before it aired and said that it deserved an Emmy nomination.[2] In 2012, when reflecting on her favorite episodes, Hargitay listed \"911\" as one of her top ten.[4] The episode has also been well received by bloggers, garnering praise such as \"what every screenwriter and actor should attempt to emulate\"[5] and \"breaks away from the usual narrative structure of Law & Order\".[6]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/images/wikimedia-button.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/911_(Law_%26_Order:_Special_Victims_Unit)", "title": "911 (Law & Order: Special Victims Unit)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}