{"url": "people.com/tv/bachelorette-becca-kufrin-frustrated-tia-booth-colton-underwood/", "text": "Happy Monday, Bachelor Nation. We’re back with another week of Becca Kufrin‘s season of The Bachelorette — read on for everything that goes down.\n\nHOMETOWN DATE WITH GARRETT\n\nFor her first date of the week, Becca travels to Garrett’s family’s home-base in Manteca, California. They own an agricultural business, so Becca and Garrett spend the day planting tomatoes — and, of course, a rose bush. It’s all very wholesome and sweet, and Becca reiterates how much Garrett — a real “salt of the earth” kind of guy — reminds her of her late father.\n\nGet push notifications with news, features and more.\n\nBecca is wary that Garrett’s family is going to be extra guarded considering his recent failed marriage. It’s important to her that they realize that she’s “nothing like his ex,” and it appears she succeeds. By the end of the evening, Becca has won over the whole family and they happily — albeit cautiously — give Garrett their blessing to pursue a future with her.\n\n“Garrett’s family is so kind,” she reflects afterwards. “There’s just so much heart and love behind all of them, and that’s something that I want in my future partner’s family — and in my future family. I could see myself fitting in with his family for life and starting a family of our own, and that’s something really special and meaningful. Something just feels so easy and right and natural with him. It just feels like it’s all falling into place.”\n\nHOMETOWN DATE WITH JASON\n\nNext up is Jason’s hometown date in Buffalo, New York. After hitting up a wing-eating competition and spending some time at a hockey rink, they arrive at Jason’s family home, where Becca meets his parents, his brother and his brother-in-law.\n\nJason reveals to his family that even though his heart is generally “pretty darn guarded,” he’s falling for Becca “really deeply, really seriously — like I’ve never fell for anyone before.” For her part, Becca admits that there’s “still a long way to go,” but she’s “hopeful” about their future.\n\nBefore they part ways that night, Jason decides the time has come to finally express his feelings.\n\n“When I’m with you, I can’t stop smiling, and when I go to bed, I can’t stop thinking about you,” he tells her. “When I wake up, I want to be with you. When I kiss you, I don’t want to stop kissing you. All that does is tell me one thing. It tells me that I’m so insanely, wildly in love with you and I can say it with more confidence than I’ve ever been able to say anything.”\n\nHOMETOWN DATE WITH BLAKE\n\nBlake’s hometown date kicks off at Platte Canyon High, his local high school in Bailey, Colorado. As we already know, high school was a huge part of Blake’s life — it’s where he found out that his mom, who worked at the school, was having an affair with one of his teachers. But as he reveals on the date, those four years were made even more impactful when they were struck by true tragedy: His senior year, the school was victimized by a shooting in which one student lost her life.\n\nBlake opens up about the experience because he wants Becca to know how deeply it changed his outlook, encouraging him to see “life as a gift.” After the emotional revelation, he surprises Becca with a Betty Who concert in the school auditorium before bringing her home to meet his family. Right from the get-go, they can tell that he’s head-over-heels for her.\n\n“I absolutely believe Blake is in love,” says his mom, Shelly. “He’s got that look in his eye that makes me think he has found the one that he wants to spend the rest of his life with. But my biggest fear is that Blake’s heart could be broken again.”\n\nSitting down with Becca, Shelly asks if she feels ready to be engaged again, a mere six months after the Arie breakup. Becca says she’s ready to jump back in “with the right person” — and says Blake is the one that makes her feel so hopeful again.\n\n“After talking with Blake’s family, I feel like I know him so much more,” Becca reflects afterwards. “It makes my feelings grow even stronger for him. … I can see Blake in my life forever, and his family in my life forever.”\n\nRELATED VIDEO: The Bachelorette‘s Blake Opens Up About Surviving School Shooting — Bachelor Nation Reacts\n\nHOMETOWN DATE WITH COLTON\n\nFor the final hometown date, Becca heads to Parker, Colorado. Colton, who founded a non-profit that benefits cystic fibrosis, takes her to the Children’s Hospital to surprise some of the kids with presents and toys.\n\nThat night, she meets his family. One of the big questions Colton’s dad has is about the whole Tia situation. As previously revealed, Colton had a short-lived relationship in January with Tia Booth, who competed on The Bachelor alongside Becca. Though Becca wasn’t quite sure how to take the news at first — especially considering the fact that she and Tia are actually good friends — Tia made an appearance on a recent episode and gave Becca her blessing to keep dating Colton.\n\nColton reassures his dad that he’s been totally honest with Becca about the situation and they’ve moved past it, a sentiment echoed by Becca herself. But his dad isn’t done with the tough line of questioning, and when he sits down one-on-one with Becca, he point-blank asks her not to pick his son unless he’s truly the one. “It’s better to have someone hurt now than down the road, if it’s the wrong decision,” he warns her.\n\nBecca, meanwhile, is concerned that Colton — who’s a virgin — may not have enough relationship experience to know what he wants. But before they part ways that night, he makes sure to tell her exactly how he’s feeling.\n\n“When Colton tells me he loves me, it makes me feel so special,” she says afterwards. “Everything that I’ve seen in Colton, just in his actions, I could see a husband, a life partner, a teammate. I’m falling for him.”\n\nROSE CEREMONY\n\nOf course, things could only go so smoothly for so long. After the four hometowns, Becca flies back to Los Angeles to gear up for the rose ceremony. But before she makes her final decision, she’s visited by a few of her fellow Bachelor alums to catch them up on where everything stands so far. A visibly uncomfortable Tia asks to pull her aside.\n\n“Obviously this is hard for me and I’m nervous to even have to talk to you about this right now,” she begins. “But I just had to be fully honest and put it out there because it’s been weighing on me. I feel like I’m so excited to hear you talk about Blake and Garrett and Jason — and when I think about Colton, if I’m being completely honest with myself, I do feel like I still have feelings for him. When I think about Colton being at this point, now, it makes me sick to my stomach — knowing that you got to meet his family and knowing that he’s still here in this makes me sick.”\n\nBecca is understandably surprised — “I did think that we put that behind us,” she says — and irritated.\n\n“I thought we put it to bed weeks ago,” she says after Tia leaves. “I thought it was done, so the fact that she does still have some feelings and isn’t on board with me being with Colton makes me frustrated. It makes me angry. It hurts to hear. I don’t want to lose any friendship over a guy, but the last time I saw Colton it was a wonderful night with his family and he told me that he loves me. So now, I don’t know what to do.”\n\nRELATED: Bachelor Alum Bekah Martinez Apologizes for Blasting Tia Booth & Colton Underwood: ‘I Got Heated’\n\nAfter giving it some thought, Becca declares that her conversation with Tia “doesn’t change anything” and vows to keep trusting her gut and following her heart.\n\n“I knew coming into tonight that this rose ceremony was going to be the hardest because I am falling for all of these guys,” she says. “I know I’m making the right choice, but it’s going to be difficult because it’s not fair to this person who I’m about to blindside. I feel terrible.”\n\nThe men arrive, and Becca hands out her final three roses: one for Blake, one for Jason, and one for Garrett. She walks Colton out with a heavy heart, admitting that she feels like a “terrible person.”\n\n“I’m shocked,” says Colton. “I’m confused. I just didn’t see tonight going like that, at all. I’m trying to figure out why, because my hometown date was hands down one of the best days. I fell in love Becca — and it’s just hard when you don’t get loved back.”\n\nThe Bachelorette airs Mondays (8 p.m. ET) on ABC.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Ftia-boothinset-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Ftia-boothinset-1-2000.jpg", "keywords": [], "authors": ["Aurelie Corinthios"], "canonical_link": "https://people.com/tv/bachelorette-becca-kufrin-frustrated-tia-booth-colton-underwood/", "title": "The Bachelorette: Becca 'Frustrated' That Tia Still Has Feelings for Colton", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Becca Kufrin,News,Recap,The Bachelorette,TV", "news_keywords": "Becca Kufrin,News,Recap,The Bachelorette,TV", "description": "\"When I think about Colton, if I'm being completely honest with myself, I do feel like I still have feelings for him,\" Tia Booth says", "og": {"title": "Becca Kufrin 'Frustrated' When Tia Booth Reveals She Still Has Feelings for Colton Underwood: 'I Thought It Was Done'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/bachelorette-becca-kufrin-frustrated-tia-booth-colton-underwood/", "description": "Happy Monday,&nbsp;Bachelor&nbsp;Nation. We’re back with another week of&nbsp;Becca Kufrin‘s season of&nbsp;The Bachelorette — read on for everything that goes down. HOMETOWN DATE WITH GARRETT For&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Ftia-boothinset-1-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/bachelorette-becca-kufrin-frustrated-tia-booth-colton-underwood/", "description": "\"When I think about Colton, if I'm being completely honest with myself, I do feel like I still have feelings for him,\" Tia Booth says", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Ftia-boothinset-1-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/bachelorette-becca-kufrin-frustrated-tia-booth-colton-underwood/", "title": "Becca Kufrin 'Frustrated' When Tia Booth Reveals She Still Has Feelings for Colton Underwood: 'I Thought It Was Done'", "description": "\"When I think about Colton, if I'm being completely honest with myself, I do feel like I still have feelings for him,\" Tia Booth says", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F06%2Ftia-boothinset-1-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}