{"url": "https://www.rollingstone.com/music/music-news/pusha-t-to-drake-you-are-silent-on-all-black-issues-628100/", "text": "Pusha-T said Drake‘s explanation of his blackface photo “doesn’t change my view at all,” during an interview with Los Angeles’ Real 92.3 Thursday, per Pitchfork.\n\nPusha-T used the picture as the cover art for his new diss track, “The Story of Adidon.” While the track contains several incendiary burns and claims, Drake felt compelled to respond to the photo, which he said was taken in 2007 for “a project that was about young black actors struggling to get roles, being stereotyped and type cast.”\n\nPusha-T dismissed Drake’s response, pointing to his lack of activism as he’s become one of the biggest artists in the world. “You are silent on all black issues, Drake,” said Pusha-T. “You don’t stand for nothing, you don’t say nothing about nothing.” The rapper added, “You have all the platform in the world. You were so passionate back then? No you weren’t. That’s number one. That’s what I know.”\n\nPusha-T released “The Story of Adidon” Tuesday in response to Drake’s “Duppy Freestyle,” which was a response to Pusha-T’s Daytona track “Infrared.” After the track premiered, Pusha-T detailed the photo’s source on Twitter, linking to the website of photographer David Leyes and writing, “These are his truths, see for yourself.”\n\nThe photo has elicited an explanation from both Drake and the Canadian streetwear brand Too Black Guys, which made the “Jim Crow” shirt Drake wears in the photo. While the company noted that the photo wasn’t taken during a Too Black Guys photoshoot, they defended both their clothing and Drake’s intention, writing, “We feel that Drake, who is a long-time friend of the brand, was brilliantly illustrating the hypocrisy of the Jim Crow Era. The subtleties of Drake, a young black man, mimicking how white men used to mimic and dehumanize black people may be lost in a rap battle, but we should not be distracted from the issues that are still affecting our communities.”", "images": ["https://www.rollingstone.com/wp-content/uploads/2018/06/pusha-t-to-drake-beef-0b51ab31-9151-44b0-9ffa-77d544743158.jpg", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=www.rollingstone.com&path=%2Fmusic%2Fmusic-news%2Fpusha-t-to-drake-you-are-silent-on-all-black-issues-628100%2F&ct=article&lob=rollingstone&loc=us&env=desktop&post_id=628100", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.rollingstone.com/wp-content/uploads/2019/11/RS-Get-The-Magazine-Free-Tote.jpg", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/pusha-t-to-drake-beef-0b51ab31-9151-44b0-9ffa-77d544743158.jpg", "keywords": [], "authors": ["Jon Blistein", "Jon Blistein'S Most Recent Stories", "Johnny Marr Teaches Viewers How To Play The Smiths", "The Headmaster Ritual", "Adeline Ruminates On A Lost Love With New Song", "Twilight", "Michael Mcdonald Offers Self-Isolation Balm With", "On My Own", "View All"], "canonical_link": "https://www.rollingstone.com/music/music-news/pusha-t-to-drake-you-are-silent-on-all-black-issues-628100/", "title": "Pusha-T to Drake: ‘You Are Silent on All Black Issues’", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#df3535", "apple-mobile-web-app-title": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2018/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2018/07/cropped-rs-favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "application-name": "Rolling Stone", "description": "Pusha-T dismissed Drake's explanation of his blackface photo, saying, \"You are silent on all black issues, Drake.\"", "news_keywords": "Drake, Hip-Hop, Pusha T", "og": {"type": "article", "title": "Pusha-T to Drake: 'You Are Silent on All Black Issues'", "url": "https://www.rollingstone.com/music/music-news/pusha-t-to-drake-you-are-silent-on-all-black-issues-628100/", "description": "‘Daytona’ rapper dismisses Drake’s explanation of controversial blackface photo", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/pusha-t-to-drake-beef-0b51ab31-9151-44b0-9ffa-77d544743158.jpg", "width": 1024, "height": 576, "alt": "Drake, Pusha T"}, "locale": "en_US"}, "article": {"published_time": "2018-05-31T17:40:39+00:00", "modified_time": "2018-06-25T13:38:31+00:00"}, "twitter": {"text": {"title": "Pusha-T to Drake: 'You Are Silent on All Black Issues'"}, "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/pusha-t-to-drake-beef-0b51ab31-9151-44b0-9ffa-77d544743158.jpg?w=1024", "alt": "Drake, Pusha T"}, "card": "summary_large_image", "site": "@RollingStone", "title": "Pusha-T to Drake: ‘You Are Silent on All Black Issues’", "description": "Pusha-T dismissed Drake's explanation of his blackface photo, saying, \"You are silent on all black issues, Drake.\""}, "generator": "WordPress 5.4", "author": "Jon Blistein", "content_type": "Article", "post_id": 628100, "title": "Pusha-T to Drake: 'You Are Silent on All Black Issues'", "published_at": "2018-05-31 17:40:39", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/pusha-t-to-drake-beef-0b51ab31-9151-44b0-9ffa-77d544743158.jpg?w=1024", "comment_count": 0, "tags": "Pusha T", "topics": "Music News", "body": "Pusha-T said Drake's explanation of his blackface photo \"doesn't change my view at all,\" during an interview with Los Angeles' Real 92.3 Thursday, per Pitchfork. Pusha-T used the picture as the cover art for his new diss track, \"The Story of Adidon.\" While the track contains several incendiary burns and claims, Drake felt compelled to respond to the photo, which he said was taken in 2007 for \"a project that was about young black actors struggling to get roles, being stereotyped and type cast.\" Pusha-T dismissed Drake's response, pointing to his lack of activism as he's become one of the biggest artists in the world. \"You are silent on all black issues, Drake,\" said Pusha-T. \"You don't stand for nothing, you don't say nothing about nothing.\" The rapper added, \"You have all the platform in the world. You were so passionate back then? No you weren't. That's number one. That's what I know.\"Pusha-T released \"The Story of Adidon\" Tuesday in response to Drake's \"Duppy Freestyle,\" which was a response to Pusha-T's Daytona track \"Infrared.\" After the track premiered, Pusha-T detailed the photo's source on Twitter, linking to the website of photographer David Leyes and writing, \"These are his truths, see for yourself.\"The photo has elicited an explanation from both Drake and the Canadian streetwear brand Too Black Guys, which made the \"Jim Crow\" shirt Drake wears in the photo. While the company noted that the photo wasn't taken during a Too Black Guys photoshoot, they defended both their clothing and Drake's intention, writing, \"We feel that Drake, who is a long-time friend of the brand, was brilliantly illustrating the hypocrisy of the Jim Crow Era. The subtleties of Drake, a young black man, mimicking how white men used to mimic and dehumanize black people may be lost in a rap battle, but we should not be distracted from the issues that are still affecting our communities.\"", "onesignal": "wordpress-plugin"}, "movies": [], "publish_date": 1527788439.0, "source": "https://www.rollingstone.com", "summary": ""}