{"url": "http://time.com/5037890/will-ferrell-i-will-always-love-you-usc-graduation/", "text": "When Will Ferrell was asked to deliver the commencement address at the University of Southern California in May 2017, for no apparent reason, he ended the speech with a heart-stirring rendition of Whitney Houston’s “I Will Always Love You.” When he stopped by The Graham Norton Show over the weekend, he finally explained his reasoning.\n\nFerrell — who appeared on the talk show with John Lithgow, Mel Gibson, and Mark Wahlberg — decided he wanted to “inspire” the graduating class, by singing the Houston song to them. “I started thinking, ‘Do I sing a couple of lines or do I torture the students and their parents by singing the entire song?’ and I chose the latter,” he explained. In addition to the song, Ferrell gave the graduating students sound advice: “I just told them to keep your feet firmly planted on the ground and reach for the stars — which I read on the back of a cereal box.”\n\nThe decision may have been spawned in part by nerves, after all Ferrell isn’t typically asked to preside over serious situations. “I hadn’t been put in that position before because usually I just make fun of things,” Ferrell said, who graduated from USC in 1990 with a degree in sports information. “A program so difficult, so arduous, that they discontinued the major eight years after I left,” he said during the commencement address where he received an honorary USC doctorate, thus requiring that his wife and children address him as “Dr. Ferrell.” “There will be no exceptions,” he joked, noting, “I think my fellow doctorates would agree, based on our achievements, we are all on equal footing.”\n\nGet The Brief. Sign up to receive the top stories you need to know right now. Please enter a valid email address. Sign Up Now Check the box if you do not wish to receive promotional offers via email from TIME. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Use and Privacy Policy Thank you! For your security, we've sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don't get the confirmation within 10 minutes, please check your spam folder.\n\nContact us at editors@time.com.", "images": ["http://time.com/img/Paper-plane.svg", "https://api.time.com/wp-content/uploads/2017/09/time-newsletter-tout-footer.png", "https://api.time.com/wp-content/uploads/2017/05/will-ferrell-usc-song.png?w=1158&h=624&crop=1", "http://subscription-assets.timeinc.com/current/1850_top2_205_thumb.jpg", "http://time.com/img/loading-circle.gif", "http://api.time.com/wp-content/uploads/2020/01/tim191125_cover_awkwafina3.jpg", "http://time.com/img/newsletter-round.svg", "https://subscription-assets.timeinc.com/current/1850_top1_205_thumb.jpg"], "top_img": "https://api.time.com/wp-content/uploads/2017/05/will-ferrell-usc-song.png?w=1158&h=624&crop=1", "keywords": [], "authors": ["Melissa Locker"], "canonical_link": "https://time.com/5037890/will-ferrell-i-will-always-love-you-usc-graduation/", "title": "Will Ferrell Explains Why He Sang Whitney Houston at USC", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Will Ferrell, Whitney Houston, Graham Norton, Will Ferrell Whitney Houston, Will Ferrell Graduation, Will Ferrell singing, Will Ferrell Singing Whitney Houston", "news_keywords": "Will Ferrell, Whitney Houston, Graham Norton, Will Ferrell Whitney Houston, Will Ferrell Graduation, Will Ferrell singing, Will Ferrell Singing Whitney Houston, Will Ferrell USC commencement", "description": "\"Do I torture the students and their parents by singing the entire song?\" Will Ferrell rhetorically asked", "og": {"title": "Will Ferrell Explains Why He Sang Whitney Houston at USC", "type": "article", "site_name": "Time", "url": "https://time.com/5037890/will-ferrell-i-will-always-love-you-usc-graduation/", "description": "\"Do I torture the students and their parents by singing the entire song?\"", "image": {"identifier": "https://api.time.com/wp-content/uploads/2017/05/will-ferrell-usc-song.png?w=1158&h=624&crop=1", "width": 1158, "height": 624}}, "article": {"content_tier": "free", "opinion": "false"}, "pinterest": {"url": "https://time.com/5037890/will-ferrell-i-will-always-love-you-usc-graduation/", "description": "\"Do I torture the students and their parents by singing the entire song?\" Will Ferrell rhetorically asked", "media": "https://api.time.com/wp-content/uploads/2017/05/will-ferrell-usc-song.png?w=1158&h=624&crop=1"}, "twitter": {"card": "summary_large_image", "url": "https://time.com/5037890/will-ferrell-i-will-always-love-you-usc-graduation/", "title": "Will Ferrell Explains Why He Sang Whitney Houston at USC", "description": "\"Do I torture the students and their parents by singing the entire song?\"", "site": "@TIME", "image": "https://api.time.com/wp-content/uploads/2017/05/will-ferrell-usc-song.png?w=1024&h=512&crop=1"}, "fb": {"app_id": 53177223193, "pages": 10606591490}}, "movies": [], "publish_date": null, "source": "http://time.com", "summary": ""}