{"url": "https://people.com/parents/the-challenge-sarah-rice-suffered-miscarriage/", "text": "The Challenge‘s Sarah Rice is opening up about her devastating miscarriage.\n\nRice, 32, revealed on The Brain Candy Podcast on Thursday that she previously suffered a miscarriage, telling listeners and cohost Susie Meister that she had planned to reveal the “surprise” of her pregnancy to her followers.\n\nGet push notifications with news, features and more.\n\n“It was so exciting, it was great. It was so hard to keep my mouth shut,” Rice said. “But, then I got another surprise when I went in for my first ultrasound at 12 weeks and the baby didn’t have a heartbeat, so no more baby and I had a miscarriage, so that was really hard.”\n\n“I think for the first time in my entire life, I felt sorrow. I had felt grief before. I felt loss,” said the reality star, who married boyfriend Landon Patterson in May 2015. “This was an experience that I didn’t know what this feeling was.”\n\nImage zoom Sarah Rice\n\n“Landon was the one who said… you felt grief, this is sorrow,” she said. “You can’t explain it away. Okay well, there’s something chromosomally abnormal with the baby so your body does what it’s supposed to do, which is terminate the pregnancy so that you can only have healthy babies.”\n\nAlthough she understands that the miscarriage was her body’s natural response, she said her emotional responses were not in tune with her body at all.\n\nRELATED: Jenni ‘JWoww’ Farley Reveals She Had a Miscarriage in 2011: ‘I Couldn’t Handle Life’\n\n“Your body doesn’t communicate that to your emotional side at all. What was really traumatizing for me was that the baby stopped growing at about nine weeks and I didn’t find out ’til 12 weeks and so, I felt like a coffin and then that I was, like, loving and romanticizing something that had been dead inside me,” she said. “They said my mind wasn’t convinced that I wasn’t pregnant, but my body was.”\n\nWant all the latest pregnancy and birth announcements, plus celebrity mom blogs? Click here to get those and more in the PEOPLE Babies newsletter.\n\nRice revealed that while she considered herself knowledgeable in medical terms and subjects, she was still taken by surprise when her doctor told her the baby would have to be removed through a dilation and curettage (D&C) procedure, which would require surgically removing the fetus.\n\n“I had never, ever, ever heard of that. Not once. This really is the last taboo of what we’re not able to just talk about,” she said. “I was like, God I have to talk about this. This was so much more upsetting than I thought it was going to be.”\n\nWhile it took her time to overcome her trauma from losing her child, as well as the procedure she underwent, Rice said, “There is a light at the end of the tunnel … I feel better.”\n\nWant to keep up on the latest from PEOPLE? Sign up for our daily newsletter to get our best stories of the day delivered straight to your inbox.\n\n“I feel like what really helped was moving my body, was like being around friends, too,” she continued. “I didn’t want anybody to tell me ‘I’m sorry’ again.”\n\n“I’m sure everybody’s journey through this is totally different,” Rice added. “I think that there are just so many ways that people can heal and you kind of have to find your own.”\n\nOn Instagram Thursday, Rice shared a photo of herself with Patterson, writing in the caption, “This last month was a tough one. @iatewhat and I had some big plans and then all of a sudden things changed, as they often do. In the latest episode of the @braincandypodcast, I share our story. It wasn’t easy, but I hope it lets other women out there know they are not alone.💕💕💕💕.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fsarah-rice-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fsarah-rice-landon.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fsarah-rice-landon.jpg", "keywords": [], "authors": ["Alexia Fernandez"], "canonical_link": "https://people.com/parents/the-challenge-sarah-rice-suffered-miscarriage/", "title": "The Challenge's Sarah Rice Reveals She Suffered a Miscarriage", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Babies,Miscarriages,News,The Challenge,TV,TV Watch", "news_keywords": "Babies,Miscarriages,News,The Challenge,TV,TV Watch", "description": "\"There is a light at the end of the tunnel,\" Sarah Rice said", "og": {"title": "The Challenge's Sarah Rice Reveals She Suffered a Miscarriage: 'I Felt Like a Coffin'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/parents/the-challenge-sarah-rice-suffered-miscarriage/", "description": "The Challenge‘s Sarah Rice is opening up about her devastating miscarriage. Rice, 32, revealed on&nbsp;The&nbsp;Brain Candy Podcast&nbsp;on Thursday that she previously suffered a miscarriage, telling&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fsarah-rice-landon.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/parents/the-challenge-sarah-rice-suffered-miscarriage/", "description": "\"There is a light at the end of the tunnel,\" Sarah Rice said", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fsarah-rice-landon.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/parents/the-challenge-sarah-rice-suffered-miscarriage/", "title": "The Challenge's Sarah Rice Reveals She Suffered a Miscarriage: 'I Felt Like a Coffin'", "description": "\"There is a light at the end of the tunnel,\" Sarah Rice said", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Fsarah-rice-landon.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}