{"url": "https://pitchfork.com/thepitch/lcd-soundsystems-gavin-russom-comes-out-as-transgender-interview/", "text": "Two months ago, Gavin Russom danced like no one was watching on national TV. As LCD Soundsystem debuted new songs on “Saturday Night Live,” Russom could be spotted just over James Murphy’s shoulder, lost in a groove. The band’s resident synth and electronics wizard, who joined officially during the recording of 2010’s This Is Happening, was wearing a T-shirt nodding at Octavia E. Butler—the sci-fi pioneer whose Patternist series offering an alternate history of humankind had become a recent source of comfort for Russom.\n\n“Butler even uses the word transition to describe this moment in the Patternists’ lives: They have these latent powers and then suddenly something would shift where their process accelerated,” Russom says. “A lot of that felt like what happened to me. Over the last year and a half, I went from my trans identity being something I was in touch with and worked through in one way or another, to suddenly this shift where it’s on the front burner. Now it's time to become a whole person.”\n\nAfter touring and recording with LCD Soundsystem last year, Russom took time off to focus on her own self-care, ultimately finding support in New York City’s large and diverse community of trans women. The step-by-step process has led Russom here: “A new photo that reflects how I feel comfortable expressing myself, feminine pronouns, and I'm using my old name.”\n\nHer name carries clout in the electronic music world. Over the last two decades, Russom established herself by creating custom analog synthesizers for Murphy’s DFA Records, as well as via her musical output with Delia Gonzalez and the Crystal Ark. As a solo performer, most often under the moniker Black Meteoric Star, Russom’s heavy acid-house and techno bubbles with the fire and creativity of early Detroit acts.\n\nOn July 13th, the eve of LCD’s headlining set at Pitchfork Music Festival, Russom will DJ publicly for the first time as a trans woman during Femme’s Room, a popular monthly party celebrating femme and queer culture. Russom was asked to DJ the event, held at Chicago’s Berlin nightclub, before the organizers knew she was trans. “Having not said anything about my gender identity or transition, it felt like this amazing synchronicity,” she says, “one of those moments where the universe is tapping you on the shoulder, [saying], ‘It's OK, it's real.’”\n\nIn a frank phone conversation over the holiday weekend, Russom shared her story for the first time. This is it, carefully compiled from her own words.\n\nI'm 43 and I can identify that once a decade, I made a concerted effort to make my trans identity known. That includes a period of time when I was a child in the ’70s, when I was going through puberty in the ’80s, and then several periods throughout my twenties, thirties, and forties. What makes this time different is that I'm in a stable moment in my life. Working with LCD Soundsystem all last year and then having a solid block of time off to focus on self-care was really important for me. This is what came out of that. I don't like coming out so much as a term, but sometimes it's the only way to say it.\n\nIn early twenties, I was on my way to coming out into transitioning. I would dress gender nonconforming and quite often explicitly feminine, and I would talk to people that I felt a closeness to about what I was going through. I experienced a lot of violence and harassment. That was part of my daily experience. Sometimes, if they happened to be walking behind me at enough distance where they would read me as feminine, they would catcall me. Getting closer to me, they would see me as masculine and then become very angry. I was assaulted on a number of occasions.\n\nI do think the world has changed, to some degree. I have to say that makes me hopeful. Things are different than they were in 1997, despite our current overarching political system. That's not to say there isn’t a very long way to go. But I think those experiences and then having gone through a period where I was less open about my gender identity meant I had sort of worked through some of those things. It also gave me so much compassion and admiration for people who did live publicly as trans women.\n\nUp until this point, I felt comfortable working with my own gender fluidity, my own identification within the feminine end of the spectrum, and the politics that arise from those things through my music. Retroactively, this is a thread that goes through my entire body of work. It's an interesting way to listen to it if you weren't already getting that.\n\nI feel very blessed because the world that I operate in is relatively open-minded. I mean, the electronic music world can be extremely bro-y and also close-minded and sometimes even worse than maybe a more traditional office job. However, at least where I've found myself, the people who are around me have been very supportive. I still had fears that I might experience consequences, mostly because I know so many trans women who have lost their jobs when they've come out. It's a very unfortunate reality. There was a fear and awareness that my ability to do this really is a privilege—and it shouldn't be, but it is.\n\nI had my own internalized societal prejudices. I have spoken publicly about trans rights previous to my transition, and if anybody would have asked me, “Do you think a trans woman can be a synthesizer technician?” I would have said absolutely—a trans woman can do anything she wants. But I noticed as I started transitioning, there were all of this internalized transphobia and all kinds of other garbage that I actually carried with me.\n\nEven in childhood, I was able to spend time with and be educated by people whose backgrounds were really different from my own. A lot of value was placed on that in my family, but that isn't to say I feel immune from dominant cultural prejudices. I think it's a similar thing to racism. I've had a lot of experiences that have helped me overcome this culture’s racist programming, but it’s still in there. I don't want it to be—I find it abhorrent. But the reality is I do work on it every day.\n\nWith my transition, there was that horrifying realization of, “Oh my god, this stuff gets to your blood.” I experienced transmisogyny towards myself. But there's also something wonderful about that too, because it felt like now I could see it. And if I can see it, I can accept it and say unfortunately, this is the reality of living in a dysfunctional culture. It made it really scary to talk to people and walk through a lot of self-doubt.\n\nI had worked enough that I felt I could take two months and just say, “I’m going to take care of this now.” I took a period of time away from not only working on my career, but also things like dating. I got off social networks except for very basic work things. I just focused on my health. I have a lifelong history of insomnia, which I think is not unrelated to struggling with being trans, so I worked on that too. I got some outside help in the form of therapy.\n\nIn terms of seeking out support, it was a step-by-step thing. I had some really cool synchronicities. The clinic I have gone to for years happens to have a lot of specialists in trans health on staff. It was a great place for me to test things out in a totally safe environment. This was probably the first time in my life where I had the desire or willingness to reach out for support. To be in the context of a trans-feminine support group and have somebody point to my side of the room and ask, “Do any girls over here want to say something?” That felt right.\n\nSupport groups should be everywhere in the whole entire world. Part of it is the blessing of being in New York City and part of it is that there have been people out there doing a lot of very hard work. Most of them, I would say, are trans-identified people of color. I feel a tremendous gratitude to know there are people out there—many of whom have much less of a degree of privilege than I do—who have been fearless enough to do the work.\n\nI think the most helpful thing was talking to people with different transgender experiences, especially those with upbringings, economic circumstances, and ethnic backgrounds different than my own. It allowed me to hear all these different perspectives and see the ways in which the trans experience is so varied and so individual. But also, there are certain things that seem to be common threads.\n\nThe difficulties I've had in dealing with [my transition in the past] definitely led me into some self-destructive behaviors, particularly around addiction and substance abuse. In the past, it consistently clouded or interrupted my ability to get into the kind of relationship with myself I needed to. I had to really work on that stuff and get it out of the picture.\n\nThe major experience has been one of things falling into place, things that maybe seemed incongruous about my life. Suddenly, as I started to accept the reality, it started to make more sense—like, “Oh, OK, that's what that was. Oh, that's how this period of my life connects to this other period.” Maybe the most important kernel is realizing that being a transgender person is really a real thing. It's not any of the things that I think people who don't have this experience tend to frame it as.\n\nIt has been a process of paying really deep attention to what's going on with me. I had a very significant moment very early on when I called my bank and the teller said, “Oh sir, thank you so much for calling us.” It's so hurtful, and of course they don't know—they're just looking at a document that has a gender identifier. But it was so powerful to just be enough in my own body to say, “Whoa, that didn't feel good.”\n\nThere was legitimately something unmanageable for me about living as a cis man. I was working so hard just to present this image of myself that ran very deeply counter to who I really am. There's nothing theoretical or intellectual about that. It's the physical thing in my body. It felt like there was almost another person constantly walking next to me being like, “Hey, hey, hey, pay attention to me, hey, hey, hey.” To some degree I wish I had been able to work through it sooner, but I'm also very glad that I worked it the way I did. Having gone through 42 and a half years of being in denial and trying to work through this stuff has given me a lot of experience.\n\nThere may be people who are fans of either LCD or of my own music who really don't have any experience with these things. It's so easy to develop prejudices when you've never encountered a person in whatever group you’re prejudiced against. I hope there's an opportunity to be of service and share my experience [in a way that’s] true to the music.", "images": ["https://media.pitchfork.com/photos/595e424ffd29f43ecf9b48a6/2:1/w_790/gavin3.jpg"], "top_img": "https://media.pitchfork.com/photos/595e424ffd29f43ecf9b48a6/2:1/w_790/gavin3.jpg", "keywords": [], "authors": ["Britt Julious"], "canonical_link": "https://pitchfork.com/thepitch/lcd-soundsystems-gavin-russom-comes-out-as-transgender-interview/", "title": "LCD Soundsystem’s Gavin Russom On Coming Out as Transgender", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, user-scalable=no", "og": {"site_name": "Pitchfork", "url": "https://pitchfork.com/thepitch/lcd-soundsystems-gavin-russom-comes-out-as-transgender-interview/", "title": "LCD Soundsystem’s Gavin Russom On Coming Out as Transgender", "description": "“Now it’s time to become a whole person,” says DFA Records’ longtime synth expert", "type": "article", "image": "https://media.pitchfork.com/photos/595e424ffd29f43ecf9b48a6/2:1/w_790/gavin3.jpg"}, "description": "“Now it’s time to become a whole person,” says DFA Records’ longtime synth expert", "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "site": "@pitchfork", "title": "LCD Soundsystem’s Gavin Russom On Coming Out as Transgender", "description": "“Now it’s time to become a whole person,” says DFA Records’ longtime synth expert", "image": "https://media.pitchfork.com/photos/595e424ffd29f43ecf9b48a6/2:1/w_790/gavin3.jpg"}, "keywords": "LCD Soundsystem,Black Meteoric Star,The Crystal Ark,as told to,LGBTQ,Electronic,Rock", "news_keywords": "LCD Soundsystem,Black Meteoric Star,The Crystal Ark,as told to,LGBTQ,Electronic,Rock", "msvalidate.01": "2E96EF3F0014FF765EEE9A9CE8B22E64"}, "movies": [], "publish_date": null, "source": "https://pitchfork.com", "summary": ""}