{"url": "https://champagneandshade.com/2017/10/22/danielle-staub-takes-shots-at-dolores-catania-and-siggy-flicker-sides-with-margaret-josephs/", "text": "Meghan King Edmonds continues to stick her foot in her mouth with comments about RHOC cast by Tiffany Bailey\n\nEven Danielle Staub said it, there are no ‘wallflowers’ on Season 8 of RHONJ and that is going to make for some explosive TV.\n\nAfter the first few episode of RHONJ have aired, fans of the Bravo series have found themselves taking sides in the growing war between Siggy Flicker and Margaret Josephs. It turns out that the RHONJ cast are also taking sides and Danielle Staub making it very clear who she thinks is right and who she thinks is wrong in this latest reality TV drama.\n\nDanielle’s return to Real Housewives of New Jersey as a friend of the cast has been interesting. For starters because when she left after Season 2, Danielle wasn’t a friend of anybody. Don’t forget that Teresa Giudice’s table flipping and her “prostitution whore” insult both were aimed at Danielle.\n\nFor Season 8, Teresa Giudice has reconciled with Danielle Staub and somehow the two women have become great friends. I’m willing to bet that their friendship has more to do with RHONJ ratings than actual friendship but there you have it.\n\nNow that Danielle is back, she’s buddied up to Teresa and Melissa. She even quickly befriended RHONJ newcomer Margaret Josephs, which plants her on the opposite side of Siggy Flicker and Dolores Catania.\n\nWhat does everyone think about these great ladies and tonight's episode of #RHONJ on @bravotv @bravoandy A post shared by Danielle Staub (@danielle_staub) on Oct 18, 2017 at 8:26pm PDT\n\nDanielle Staub even managed to make the divide between the New Jersey housewives even wider in her Bravo blog. In it, she divided up each section by RHONJ co-star and addressed the things she did or didn’t like about them and the recent episode.\n\nWhen it came to Siggy Flicker, Danielle made it clear that she was upset about the way that Siggy handled the drama with Margaret.\n\nDanielle Staub goes in on Siggy Flicker\n\n“I met you years ago, Siggy, and I thought you were so nice, and you seemed to have a genuine desire to help heal relationships,” Danielle wrote. “You intrigued me all those years ago. So it was painful for me to watch you tear at Margaret like you did, even when she reminded you that this wasn’t mirroring your message of empowering other women!”\n\nNow I know a lot of RHONJ fans feel the same way about Siggy as Danielle does. It’s been very apparent on Twitter, where Bravo fans share their thoughts about the episodes in real time, as they watch. I get it. I am also a die-hard Siggy Flicker fan and feel like she wouldn’t have reacted so harshly if she had not been provoked. Also, it’s still incredibly rude to throw cake (or any other kind of food) in a restaurant. I would have went ballistic too.\n\n, the bigger hurt in Siggy’s case seems to come from the beach memorial that Margaret Josephs secretly set up for Teresa Giudice. She didn’t tell Siggy about it beforehand even though it was Siggy’s trip to Boca that she arranged and invited everyone on.\n\nThen, when Siggy didn’t show up for yoga and ignored the group text (something I can see myself doing after the drama from the night before) she still wasn’t told about the special event planned for Teresa that day?\n\nNope! I can’t even blame her for being mad. Not to mention that Margaret has made a very obvious beeline for the popular girls and it’s looking very much like she did what she had to do to bond with Teresa and Melissa in an effort to ensure she’s not a one-season wonder.\n\nAnd then she went for Dolores Catania\n\n“I decided to take your advice. I looked up ‘loyal’ in the dictionary, and I failed to see your picture or any resemblance of you,” Danielle said about Dolores. “I get you wanting to have Siggy’s back “5,000%.” You are her friend, and it’s obvious you mean a great deal to one another; however, Margaret is a wonderful person with a kind heart. We all see this.”\n\nSeriously, Danielle actually called Dolores Catania disloyal while pointing out how incredibly loyal she’s been to her friend Siggy. Dolores is BFF goals. Who wouldn’t want a friend that had your back 5000 percent? Sign me up for that!\n\nYou all know the heart I have for animals, and tomorrow is a day that is such a special cause for me. The annual @onyxandbreezy gala is tomorrow night! You can still head to the link in my bio for tickets or make sure to tune in to their Facebook page tomorrow at 7pm est for a Facebook live from the red carpet! All of the proceeds from this gala will be going to disaster relief in Puerto Rico! Hope to see you all there❤️🐶 #onyxandbreezyfoundation #adoptdontshop A post shared by Dolores Catania (@dolorescatania) on Oct 20, 2017 at 11:45am PDT\n\nAnyway, obviously not everyone sees what a wonderful person Margaret is. She is gaining popularity with RHONJ fans rather quickly. She also got in the good graces of Teresa and Melissa and even Danielle Staub with record speed. Does that make her wonderful or just wonderful at working her way up the social ladder and securing her role?\n\nWhile Danielle Staub is busy helping Teresa Giudice and Melissa Gorga stroke Margaret Josephs ego, it’s worth noting that Siggy went out of her way to throw an amazing birthday party complete with a gorgeous (and very expensive) custom cake and her efforts were literally trashed. Just like the way her RHONJ co-stars keep trashing her for being upset about it.\n\nTo make matters worse, Siggy brought Margeret into the mix and invited her on the Boca trip, only to have her efforts to celebrate Melissa’s birthday overshadowed by Margaret’s secret plan to throw a beach memorial for Teresa. And it was a nice gesture, don’t get me wrong but everyone is talking about how Siggy didn’t answer a group text. Considering the magnitude of the ceremony that Margaret planned, if she wasn’t shady, why didn’t she call Siggy up and tell her that there was a huge reason she wouldn’t want to miss out and that it wasn’t yoga.", "images": ["https://images2.minutemediacdn.com/image/fetch/c_fill,f_auto,w_150,h_150/https://fansided.com/wp-content/assets/site_images/champagneandshade/logo_champagneandshade-com__150x150.png", "https://images2.minutemediacdn.com/image/fetch/w_850,h_560,c_fill,g_auto,f_auto/https%3A%2F%2Fchampagneandshade.com%2Ffiles%2F2017%2F10%2FDanielle-Staub-RHONJ-WWHL-850x560.jpg", "https://images2.minutemediacdn.com/image/fetch/w_2000,h_2000,c_fit/https%3A%2F%2Fchampagneandshade.com%2Ffiles%2F2017%2F10%2FDanielle-Staub-RHONJ-WWHL.jpg", "https://champagneandshade.com/wp-content/themes/fansided-v5/assets/images/apple-app.png", "https://www.facebook.com/tr?id=1578981752316085&ev=PageView&noscript=1", "https://champagneandshade.com/wp-content/themes/fansided-v5/assets/images/android-app.png", "http://b.scorecardresearch.com/p?c1=2&c2=6035728&cv=2.0&cj=1", "https://cdn.fansided.com/wp-content/themes/fansided-v5/assets/images/fansided-logo.svg", "https://cdn.fansided.com/wp-content/assets/site_images/champagneandshade/logo_champagneandshade-com__150x150.png"], "top_img": "https://images2.minutemediacdn.com/image/fetch/w_2000,h_2000,c_fit/https%3A%2F%2Fchampagneandshade.com%2Ffiles%2F2017%2F10%2FDanielle-Staub-RHONJ-WWHL.jpg", "keywords": [], "authors": ["Tiffany Bailey", "Shaunee Flowers"], "canonical_link": "https://champagneandshade.com/2017/10/22/danielle-staub-takes-shots-at-dolores-catania-and-siggy-flicker-sides-with-margaret-josephs/", "title": "Danielle Staub takes shots at Dolores Catania and Siggy Flicker, sides with Margaret Josephs", "meta_data": {"HandheldFriendly": "True", "MobileOptimized": 320, "viewport": "width=device-width, initial-scale=1.0", "description": "Danielle Staub has taken sides on RHONJ against Siggy Flicker and Dolores Catania and even used her recent blog post to tear them down even more.", "news_keywords": "danielle staub, dolores catania, rhonj, siggy flicker", "twitter": {"card": "summary_large_image", "description": "Even Danielle Staub said it, there are no 'wallflowers' on Season 8 of RHONJ and that is going to make for some explosive TV.  After the first few episode...", "title": "Danielle Staub takes shots at Dolores Catania and Siggy Flicker, sides with Margaret Josephs", "image": {"identifier": "https://champagneandshade.com/files/2017/10/Danielle-Staub-RHONJ-WWHL.jpg", "src": "https://images2.minutemediacdn.com/image/fetch/w_2000,h_2000,c_fit/https%3A%2F%2Fchampagneandshade.com%2Ffiles%2F2017%2F10%2FDanielle-Staub-RHONJ-WWHL.jpg"}, "creator": "@ShauneeSays", "site": "@ChampagneShade", "domain": "https://champagneandshade.com", "app": {"name": {"iphone": "FanSided", "ipad": "FanSided", "googleplay": "FanSided"}, "id": {"iphone": 553311886, "ipad": 553311886, "googleplay": "com.noticesoftware.FanSided"}}}, "DC.date.issued": "2017-10-22T18:46:07-04:00", "generator": "WordPress 4.9.13", "og": {"type": "article", "title": "Danielle Staub takes shots at Dolores Catania and Siggy Flicker, sides with Margaret Josephs", "url": "https://champagneandshade.com/2017/10/22/danielle-staub-takes-shots-at-dolores-catania-and-siggy-flicker-sides-with-margaret-josephs/", "image": "https://images2.minutemediacdn.com/image/fetch/w_2000,h_2000,c_fit/https%3A%2F%2Fchampagneandshade.com%2Ffiles%2F2017%2F10%2FDanielle-Staub-RHONJ-WWHL.jpg", "site_name": "Champagne and Shade", "description": "Even Danielle Staub said it, there are no 'wallflowers' on Season 8 of RHONJ and that is going to make for some explosive TV.  After the first few episode..."}, "fb": {"admins": "10105391,1369422511"}, "article": {"author": "https://champagneandshade.com/author/sflowers/", "published_time": "2017-10-22T18:46:07+00:00"}, "al": {"ios": {"url": "fansided://champagneandshade.com/2017/10/22/danielle-staub-takes-shots-at-dolores-catania-and-siggy-flicker-sides-with-margaret-josephs/app/", "app_store_id": 553311886, "app_name": "FanSided"}, "android": {"url": "fansided://champagneandshade.com/2017/10/22/danielle-staub-takes-shots-at-dolores-catania-and-siggy-flicker-sides-with-margaret-josephs/app/", "app_name": "FanSided", "package": "com.noticesoftware.FanSided"}, "web": {"url": "https://champagneandshade.com/2017/10/22/danielle-staub-takes-shots-at-dolores-catania-and-siggy-flicker-sides-with-margaret-josephs/"}}, "theme-color": "#7F281B", "mobile-web-app-capable": "yes", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "format-detection": "telephone=no", "msapplication-config": "none", "application-name": "Champagne and Shade", "msapplication-TileColor": "#7F281B", "msapplication-navbutton-color": "#C2B59B", "msapplication-tooltip": "Real Housewives. Real Life.", "msapplication-TileImage": "https://cdn.fansided.com/wp-content/assets/site_images/champagneandshade/logo_champagneandshade-com__300x300.png", "msapplication-square70x70logo": "https://cdn.fansided.com/wp-content/assets/site_images/champagneandshade/logo_champagneandshade-com__150x150.png", "msapplication-square150x150logo": "https://cdn.fansided.com/wp-content/assets/site_images/champagneandshade/logo_champagneandshade-com__300x300.png", "msapplication-square310x310logo": "https://cdn.fansided.com/wp-content/assets/site_images/champagneandshade/logo_champagneandshade-com.png", "apple-itunes-app": "app-id=553311886"}, "movies": [], "publish_date": 1508601600.0, "source": "https://champagneandshade.com", "summary": ""}