{"url": "https://people.com/crime/mary-kay-letourneau-wants-fix-marriage-vili-fualaau/", "text": "A year ago, Vili Fualaau grabbed national headlines when he filed for legal separation from his wife, former school teacher and sex offender Mary Kay Letourneau.\n\nBut things aren’t over. The couple has repeatedly been spotted together around the Seattle area. Sources close to them have told PEOPLE that they’re working on their marriage — and still in love.\n\nGet push notifications with news, features and more.\n\nOn Tuesday night’s Autobiography on A&E, Fualaau, now 34, declined to address the split directly. When asked about it by a producer, he sheepishly smiled while Letourneau said, “We’re not talking about that.”\n\nWhile the couple themselves wouldn’t address it, their inner circle was given the green light to speak frankly about what went wrong in their notorious coupling.\n\n“When the news came out that he filed for separation, people were stunned,” friend Anne Bremner told the show. “They’d been together all this time.”\n\n• Want to keep up with the latest crime coverage? Click here to get breaking crime news, ongoing trial coverage and details of intriguing unsolved cases in the True Crime Newsletter.\n\nImage zoom From left: Mary Kay Letourneau and Vili Fualaau Splash News Online\n\n“I’m gonna tell you why she refuses to speak about it,” added longtime friend Mark Greenberg. “It’s because she doesn’t know the answer to it. She’s living in hope. Mary wants this relationship to work. Vili’s in his mid-30s, and Mary’s in her mid-50s, and you just have to relate it to anyone else you know and their relationship issues.”\n\n“Mary’s hopeful,” Greenberg continued. “She loves Vili. There’s absolutely no question about that.”\n\nDavid Gehrke, another friend, said the two are “in counseling” and still “living together.”\n\n“They’re working on their problems,” he said. “Everybody wants a good love story, and generally when you’re caught up in this situation, there’s no way it can end up happy, even if it was love.”\n\n• It was the scandal that rocked America’s most storied political family and changed the course of presidential history. PEOPLE‘s first-ever podcast, Cover-Up, dives into the Chappaquiddick scandal and attempts to piece together what happened in the hours after Ted Kennedy’s car went over a narrow wooden bridge, killing his passenger, Mary Jo Kopechne. Subscribe now on Apple Podcasts, Spotify, Google Play or wherever podcasts are available.\n\nImage zoom From left: Vili Fualaau and Mary Kay Letourneau in 2015 Heidi Gutman/ABC/Getty\n\nThe endurance of Letourneau’s connection to Fualaau is, to some outside observers, one improbable fact among many.\n\nTheir relationship started when when she was 34 and he was her 12-year-old sixth-grade student. Following a guilty plea for felony second-degree rape of a child, Letourneau was sentenced to six months behind bars, with three months suspended, and told to have no contact with Fualaau for life. But she was unable to stay away from him and was re-arrested when she was caught having sex with him, again, in a car.\n\nLetourneau was sent back to prison and was released in 2004. She twice became pregnant with Fualaau’s child when he was underage. The couple eventually married and raised their two daughters together.\n\nOn Autobiography this week, she eventually agreed to speak in generalities about the state of her marriage.\n\n“There is a labor in love,” she said. “Anyone who’s making love work in a marriage knows it’s work.”\n\nMary Kay Letourneau: Autobiography aired Tuesday and is available on demand and on A&E’s website. It will be rebroadcast throughout the month.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F04%2Fmary-kay-letourneau-21.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Fmary-kay-letourneau-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1800&h=942&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F04%2Fmary-kay-letourneau-21.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1800&h=942&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F04%2Fmary-kay-letourneau-21.jpg", "keywords": [], "authors": ["Steve Helling"], "canonical_link": "https://people.com/crime/mary-kay-letourneau-wants-fix-marriage-vili-fualaau/", "title": "Mary Kay Letourneau 'Hopeful' She Can Fix Marriage with Her Student-Turned-Husband, Vili Fualaau", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Crime News,News", "news_keywords": "Crime News,News", "description": "The notorious couple has repeatedly been spotted together around the Seattle area and sources have told PEOPLE that they're working on their relationship", "og": {"title": "Mary Kay Letourneau 'Hopeful' She Can Fix Marriage with Her Student-Turned-Husband, Vili Fualaau", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/crime/mary-kay-letourneau-wants-fix-marriage-vili-fualaau/", "description": "A year ago,&nbsp;Vili Fualaau&nbsp;grabbed national headlines when he filed for legal separation from his wife, former school teacher and sex offender&nbsp;Mary Kay Letourneau. But things&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1800&h=942&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F04%2Fmary-kay-letourneau-21.jpg", "width": 1800, "height": 942}}, "pinterest": {"url": "https://people.com/crime/mary-kay-letourneau-wants-fix-marriage-vili-fualaau/", "description": "The notorious couple has repeatedly been spotted together around the Seattle area and sources have told PEOPLE that they're working on their relationship", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F04%2Fmary-kay-letourneau-21.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/crime/mary-kay-letourneau-wants-fix-marriage-vili-fualaau/", "title": "Mary Kay Letourneau 'Hopeful' She Can Fix Marriage with Her Student-Turned-Husband, Vili Fualaau", "description": "The notorious couple has repeatedly been spotted together around the Seattle area and sources have told PEOPLE that they're working on their relationship", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1800&h=942&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2019%2F04%2Fmary-kay-letourneau-21.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}