{"url": "www.politico.com/story/2017/11/06/kellyanne-conway-texas-shooting-democrats-disrespectful-244595", "text": "Kellyanne Conway slammed officials who in the wake of the latest historic mass shooting were calling for action on gun legislation. | Matt Rourke/AP Conway: Politicizing Texas shooting 'disrespectful to the dead'\n\nWhite House counselor Kellyanne Conway on Monday criticized Democrats for \"pointing fingers\" and calling for increased gun control measures in response to the deadly Texas shooting over the weekend, saying the quick reaction is \"disrespectful to the dead.\"\n\n\"The rush to judgment, particularly by people who just see politics and Trump derangement in every single thing they do, it doesn't help the victims, and it's disrespectful to the dead,\" Conway said during an appearance on \"Fox & Friends\" Monday morning.\n\nAdvertisement\n\nConway lamented Sunday's lethal shooting, which left at least 26 dead after a gunman opened fire on the First Baptist Church in Sutherland Springs, Texas, during a worship service on Sunday — the deadliest mass shooting in state history. \"There is evil among us,\" she said.\n\nThe counselor to the president also slammed officials who, in the wake of the latest historic mass shooting, were calling for action on gun legislation.\n\n“It's so beyond any type of reasonable response that anyone should have — why people see politics immediately,\" she said, hitting liberal politicians and celebrities for \"taking to Twitter in the comfort of their very luxurious lives and pointing fingers.\"\n\nPOLITICO Playbook newsletter Sign up today to receive the #1-rated newsletter in politics Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nPresident Donald Trump weighed in on the tragedy while speaking at a news conference in Japan, during his first major diplomatic trip to Asia, calling the incident \"a mental health problem at the highest level.\"\n\n“This was a very deranged individual,” Trump said in addressing reporters alongside Japanese Prime Minister Shinzo Abe, adding, “We have a lot of mental health problems in our country, as do other countries. This isn’t a guns situation.”\n\nIt was unclear what led Trump to say the shooting was a result of \"mental health.\" Officials are still investigating the motive behind the shooter's outburst.\n\nThe president said it was too soon to rehash the gun control debate, though, echoing a common refrain from Republican officials after recent mass casualty shootings.\n\nThe White House similarly dismissed calls for fast action in response to the lethal Las Vegas shooting last month that claimed the lives of more than 50 and left more than 500 injured. \"I think that we can have those policy conversations, but today is not that day,\" White House press secretary Sarah Huckabee Sanders said the day after the shooting during a White House news briefing.", "images": ["https://static.politico.com/dims4/default/66244ac/2147483647/resize/1160x%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Fa8%2Fd7%2F895ef0544e19bd67faedb18a3d4b%2F171106-kellyanne-conway.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://static.politico.com/a8/d7/895ef0544e19bd67faedb18a3d4b/171106-kellyanne-conway.jpg"], "top_img": "https://static.politico.com/a8/d7/895ef0544e19bd67faedb18a3d4b/171106-kellyanne-conway.jpg", "keywords": [], "authors": ["Cristiano Lima"], "canonical_link": "https://www.politico.com/story/2017/11/06/kellyanne-conway-texas-shooting-democrats-disrespectful-244595", "title": "Conway: Politicizing Texas shooting 'disrespectful to the dead'", "meta_data": {"article": {"opinion": "false"}, "og": {"title": "Conway: Politicizing Texas shooting 'disrespectful to the dead'", "description": "Conway lamented Sunday's lethal shooting, which left at least 26 dead after a gunman opened fire on the First Baptist Church in Sutherland Springs, Texas, on Sunday.", "type": "article", "url": "http://politi.co/2h7H29G", "image": "https://static.politico.com/a8/d7/895ef0544e19bd67faedb18a3d4b/171106-kellyanne-conway.jpg", "fb_appid": 114037015331397, "site_name": "POLITICO"}, "description": "Conway lamented Sunday's lethal shooting, which left at least 26 dead after a gunman opened fire on the First Baptist Church in Sutherland Springs, Texas, on Sunday.", "viewport": "width=device-width, initial-scale=1", "theme-color": "#dc0228", "fb": {"pages": 62317591679}, "twitter": {"card": "summary_large_image", "site": "@politico", "creator": "@politico"}, "host": "www.politico.com", "build": "release/cge-ghana c9cdd63 2020-04-15T19:31:28Z"}, "movies": [], "publish_date": 1509897600.0, "source": "http://www.politico.com", "summary": ""}