{"url": "https://deadline.com/2017/11/russell-simmons-accuser-megyn-kelly-1202213706/", "text": "UPDATE, with video Former model Keri Claussen Khalighi told Megyn Kelly this morning that music mogul Russell Simmons has privately apologized to her for sexually assaulting her, despite his public insistence that what happened in 1991, when she was 17 years old, was consensual.\n\n“Russell and I have actually had a face-to-face confrontation about what happened, we’ve had phone conversations where there was no dispute about what we were taking about,” Khalighi told Kelly during a live interview from her home in Los Angeles with the NBC morning show host. “And he actually apologized,” Khalighi added.\n\n‘What he’s speaking about privately with me is completely different from what’s come out publicly,’ Khalighi says.\n\n“Part of what’s so confusing and re-traumatizing is that what he’s speaking about privately with me is completely different from what’s come out publicly,” Khalighi continued.”That’s the piece that’s been, quite honestly, repugnant with hypocirsy and the lies and the denial.”\n\nRelated Story 'Bombshell' Completes Fox News Trip With Oscar Win For Makeup And Hairstyling\n\nNBC via Jeremy Gerard\n\nKhalighi, who is about to deliver her third child, recalled 1991 incident in detail. Simmons and Ratner, she said, after meeting her, invited her to Simmons’ apartment on the pretext of seeing a music video they had produced. As the video played, she said, Simmons began sexually assaulting her, ripping off her clothes, Kelly reported, forcing her to perform oral sex and later intercourse, all in Ratner’s presence.\n\n“I looked over at Brett and asked for help, because I thought he was a friend,” Khalighi told Kelly, before realizing that “this was their plan all along. There was no help that was gonna come.” Khalighi said that “in the fashion circles it was widely known that they had a reputation for being modelizers…”\n\nSimmons denied the claim of assault to the Los Angeles Times, which first reported the story. In an emotional dialogue this morning between Khalighi and Kelly, the ex-model said that her story was complicated by the fact that after the first assault, she had taken a shower and returned, only to be assaulted by Simmons a second time.\n\n“After the oral sex part of the story,” she recalled, “I stayed. I didn’t run out. I stayed and I took a shower and an additional sexual assault happened there.” Women don’t always follow “a cut-and-dried, black-and-white story line…I’ve learned in a lot of the work I’ve done around this issue there’s a whole spectrum, a variety of response of fight, flight or freeze. I certainly froze. I did what I could to normalize what was an incredibly hard-to-process situation in the moment, as a 17-year-old.”\n\nWatch the interview here.", "images": ["https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://pmcdeadline2.files.wordpress.com/2017/11/img_02851.jpg?w=300&h=224", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=deadline.com&path=%2F2017%2F11%2Frussell-simmons-accuser-megyn-kelly-1202213706%2F&ct=article&lob=deadline&loc=us&env=desktop&post_id=1202213706&comment_count=26", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://s0.wp.com/wp-content/themes/vip/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pmcdeadline2.files.wordpress.com/2017/11/img_0289-1-e1511366720472.jpg?w=350"], "top_img": "https://pmcdeadline2.files.wordpress.com/2017/11/img_0289-1-e1511366720472.jpg?w=350", "keywords": [], "authors": ["Jeremy Gerard"], "canonical_link": "https://deadline.com/2017/11/russell-simmons-accuser-megyn-kelly-1202213706/", "title": "Russell Simmons’ Accuser Tells Megyn Kelly ‘He Actually Apologized’", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Deadline", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "UPDATE, with video Former model Keri Claussen Khalighi told Megyn Kelly this morning that music mogul Russell Simmons has privately apologized to her for sexually assaulting her, despite his public insistence that what happened in 1991, when she was 17 years old, was consensual.", "news_keywords": "Brett Ratner, Harassment, Keri Claussen Khalighi, Megyn Kelly, Russell Simmons", "apple-itunes-app": "app-id=533209613", "generator": "WordPress.com", "og": {"type": "article", "title": "Russell Simmons’ Accuser Tells Megyn Kelly ‘He Actually Apologized’", "url": "https://deadline.com/2017/11/russell-simmons-accuser-megyn-kelly-1202213706/", "description": "UPDATE, with video Former model Keri Claussen Khalighi told Megyn Kelly this morning that music mogul Russell Simmons has privately apologized to her for sexually assaulting her, despite his public…", "site_name": "Deadline", "image": {"identifier": "https://pmcdeadline2.files.wordpress.com/2017/11/img_0289-1-e1511366720472.jpg?w=350", "width": 2592, "height": 1936}, "locale": "en_US"}, "article": {"published_time": "2017-11-22T15:30:05+00:00", "modified_time": "2017-11-22T16:35:35+00:00"}, "twitter": {"site": "@Deadline", "text": {"title": "Russell Simmons’ Accuser Tells Megyn Kelly ‘He Actually Apologized’"}, "card": "summary_large_image", "creator": "@jbgerard", "title": "Russell Simmons’ Accuser Tells Megyn Kelly ‘He Actually Apologized’", "description": "UPDATE, with video Former model Keri Claussen Khalighi told Megyn Kelly this morning that music mogul Russell Simmons has privately apologized to her for sexually assaulting her, despite his public…", "image": "https://pmcdeadline2.files.wordpress.com/2017/11/img_0289-1-e1511366720472.jpg?w=350"}, "author": "Jeremy Gerard", "content_type": "Article", "post_id": 1202213706, "title": "Russell Simmons' Accuser Tells Megyn Kelly 'He Actually Apologized'", "published_at": "2017-11-22 07:30:05", "image": "https://pmcdeadline2.files.wordpress.com/2017/11/img_0289-1-e1511366720472.jpg?w=296&h=166&crop=1", "comment_count": 26, "tags": "Russell Simmons", "topics": "TV", "body": "UPDATE, with video Former model Keri Claussen Khalighi told Megyn Kelly this morning that music mogul Russell Simmons has privately apologized to her for sexually assaulting her, despite his public insistence that what happened in 1991, when she was 17 years old, was consensual.\r\n\r\n\"Russell and I have actually had a face-to-face confrontation about what happened, we've had phone conversations where there was no dispute about what we were taking about,\" Khalighi told Kelly during a live interview from her home in Los Angeles with the NBC morning show host. \"And he actually apologized,\" Khalighi added.\r\n'What he's speaking about privately with me is completely different from what's come out publicly,' Khalighi says.\r\n\"Part of what's so confusing and re-traumatizing is that what he's speaking about privately with me is completely different from what's come out publicly,\" Khalighi continued.\"That's the piece that's been, quite honestly, repugnant with hypocirsy and the lies and the denial.\"\r\n\r\n\r\n\r\nKhalighi, who is about to deliver her third child, recalled 1991 incident in detail. Simmons and Ratner, she said, after meeting her, invited her to Simmons' apartment on the pretext of seeing a music video they had produced. As the video played, she said, Simmons began sexually assaulting her, ripping off her clothes, Kelly reported, forcing her to perform oral sex and later intercourse, all in Ratner's presence.\r\n\r\n\"I looked over at Brett and asked for help, because I thought he was a friend,\" Khalighi told Kelly, before realizing that \"this was their plan all along. There was no help that was gonna come.\" Khalighi said that \"in the fashion circles it was widely known that they had a reputation for being modelizers...\"\r\n\r\nSimmons denied the claim of assault to the Los Angeles Times, which first reported the story. In an emotional dialogue this morning between Khalighi and Kelly, the ex-model said that her story was complicated by the fact that after the first assault, she had taken a shower and returned, only to be assaulted by Simmons a second time.\r\n\r\n\"After the oral sex part of the story,\" she recalled, \"I stayed. I didn't run out. I stayed and I took a shower and an additional sexual assault happened there.\" Women don't always follow \"a cut-and-dried, black-and-white story line...I've learned in a lot of the work I've done around this issue there's a whole spectrum, a variety of response of fight, flight or freeze. I certainly froze. I did what I could to normalize what was an incredibly hard-to-process situation in the moment, as a 17-year-old.\"\r\n\r\nWatch the interview here.", "application-name": "Deadline", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Hollywood Entertainment Breaking News", "msapplication-task": "name=Subscribe;action-uri=https://deadline.com/feed/;icon-uri=https://pmcdeadline2.files.wordpress.com/2019/04/cropped-icon-512x512.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!", "fb": {"page_id": 105558754896}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1511364605.0, "source": "https://deadline.com", "summary": ""}