{"url": "https://en.wikipedia.org/wiki/Game_of_Thrones_(season_8)", "text": "Television series season\n\nThe eighth and final season of the fantasy drama television series Game of Thrones, produced by HBO, premiered on April 14, 2019, and concluded on May 19, 2019. Unlike the first six seasons, which consisted of ten episodes each, and the seventh season, which consisted of seven episodes, the eighth season consists of only six episodes.\n\nThe final season depicts the culmination of the series' two primary conflicts: the Great War against the Army of the Dead, and the Last War for control of the Iron Throne. The first half of the season involves many of the main characters converging at Winterfell with their armies in an effort to repel the Night King and his army of White Walkers and wights. The second half of the season resumes the war for the throne as Daenerys Targaryen assaults King's Landing in an attempt to unseat Cersei Lannister as the ruler of the Seven Kingdoms.\n\nThe season was filmed from October 2017 to July 2018 and largely consists of original content not found in George R. R. Martin's A Song of Ice and Fire series, while also incorporating material that Martin has revealed to showrunners about the upcoming novels in the series, The Winds of Winter and A Dream of Spring. The season was adapted for television by David Benioff and D. B. Weiss.\n\nThe season was met with mixed reviews from critics, in contrast to the widespread acclaim of previous seasons, and is the lowest-rated of the series on the website Rotten Tomatoes. Criticism was mainly directed at the writing and shorter runtime of the season, as well as numerous creative decisions made by the showrunners; though the acting, production, and musical score continued to receive praise.\n\nThe season received 32 nominations at the 71st Primetime Emmy Awards, the most for a single season of television in history.[1] It won twelve, including Outstanding Drama Series and Outstanding Supporting Actor in a Drama Series for Peter Dinklage.\n\nEpisodes [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Directed by Written by Original air date [2] U.S. viewers\n\n(millions) 68 1 \"Winterfell\" David Nutter Dave Hill April 14, 2019 ( ) 11.76[3] Upon reaching Winterfell with their combined armies, Jon and Daenerys learn the Army of the Dead has breached the Wall, and the Night King commands the undead Viserion. The Northern Houses and their allies rally around Winterfell, but distrust Daenerys and doubt Cersei's pledge to send troops. Euron returns to King's Landing with the Golden Company and entices Cersei to consummate their union. On Cersei's orders, Qyburn hires Bronn to assassinate Tyrion and Jaime. Theon rescues Yara, who then sets out to retake the Iron Islands, while Theon returns to Winterfell. At Winterfell, Jon reunites with Bran and Arya, and later learns to ride Rhaegal, during which Jon and Daenerys deepen their bond. Sam meets Daenerys, who states that she executed his father and brother. Sam reveals to Jon that he is actually Aegon Targaryen. At House Umber's seat of Last Hearth, Tormund and Beric encounter Edd and other Night's Watch members. They find the castle's occupants dead, and the wight of Ned Umber is left as a gruesome message. Jaime arrives at Winterfell where Bran awaits him. 69 2 \"A Knight of the Seven Kingdoms\" David Nutter Bryan Cogman April 21, 2019 ( ) 10.29[4] Jaime reveals Cersei's deception to the Targaryen-Stark alliance and joins them after Brienne vouches for his loyalty. Jaime later apologizes to Bran for crippling him; Bran replies he harbors no anger and says they are no longer the same people. Tyrion loses Daenerys' trust for having believed Cersei, prompting Jorah to ask her to forgive Tyrion's mistakes. Citing their mutual love for Jon, Daenerys tries and fails to gain Sansa's trust after refusing to give assurances about the North's fate. Theon, Edd, Tormund, and Beric arrive at Winterfell, with the latter three reporting the undead army's impending arrival. Bran proposes that he lure out the Night King, who wants to destroy the Three-Eyed Raven. The others agree, with Theon and the Ironborn offering Bran protection. Arya seduces Gendry. Jaime formally anoints Brienne as a knight. Jorah fails to dissuade Lyanna Mormont from fighting, and he receives House Tarly's ancestral sword as a gift from Sam. As the Army of the Dead approaches, Jon reveals his Targaryen lineage to Daenerys. 70 3 \"The Long Night\" Miguel Sapochnik David Benioff & D. B. Weiss April 28, 2019 ( ) 12.02[5] The Living Army meets the Army of the Dead outside Winterfell. The initial Dothraki charge is decimated, and the Unsullied are quickly overwhelmed. Edd is killed while saving Sam. The survivors retreat into the castle as Melisandre ignites the defensive fire trench surrounding Winterfell to delay the advancing horde. Jon and Daenerys engage the Night King on their dragons. The wights invade Winterfell, overpowering the defenders and killing Lyanna Mormont. Beric dies defending Arya. Jon and Rhaegal knock the Night King off Viserion, and Daenerys burns him with dragonfire but it has no effect. The Night King then raises slain Winterfell defenders, including the dead entombed in the crypt where the non-combatants are attacked. After wights pull Daenerys from Drogon, Jorah is fatally wounded defending her. The Night King arrives at the Godswood for Bran and kills Theon. Arya ambushes the Night King, stabbing him with her Valyrian steel dagger. The Night King and his White Walkers shatter, causing Viserion and the wights to collapse. Her purpose served, Melisandre allows herself to die from old age. 71 4 \"The Last of the Starks\" David Nutter David Benioff & D. B. Weiss May 5, 2019 ( ) 11.80[6] The survivors mourn and burn the dead. Daenerys legitimizes Gendry as a Baratheon, naming him Lord of Storm's End. Arya declines Gendry's subsequent marriage proposal. Jaime and Brienne become lovers. To protect her claim to the throne, Daenerys wants Jon to conceal his true parentage. Bronn arrives to kill Jaime and Tyrion for Cersei, but spares them in exchange for being promised Highgarden castle. Jon reveals his true parentage to Sansa and Arya, swearing them to secrecy. Wanting Jon as king, Sansa tells Tyrion, who informs Varys. Arya and the Hound head for King's Landing, bent on revenge. Tormund returns north with the Wildlings, taking Ghost at Jon's request. Daenerys and her fleet set sail for King's Landing, while Jon leads the Northern army. At Dragonstone, Euron's navy ambushes her fleet, killing Rhaegal with ship-mounted scorpions. Missandei is taken hostage. Daenerys considers seizing King's Landing using dragonfire. Varys and Tyrion debate whether Jon would be a better ruler than Daenerys. Jaime feels compelled to return to Cersei, despite Brienne's plea that he stay. Cersei defiantly refuses Daenerys' demand to surrender and has Missandei beheaded before an enraged Daenerys and Grey Worm. 72 5 \"The Bells\" Miguel Sapochnik David Benioff & D. B. Weiss May 12, 2019 ( ) 12.48[7] Varys urges Jon to advance his claim, but Jon refuses to betray Daenerys. After Tyrion reveals Varys' plot, Daenerys executes Varys by dragon fire. Jaime is captured, but Tyrion releases him so Jaime can persuade Cersei to surrender the city and then escape Westeros with Cersei. Jaime, Arya, and the Hound each infiltrate King's Landing. Atop Drogon, Daenerys destroys the Iron Fleet and most of the city's defenses, allowing her army to enter. Cersei's forces are quickly overwhelmed and the city signals its surrender, but an enraged Daenerys begins leveling the city, burning soldiers and civilians. The allied army follows her lead, slaughtering anyone in their path, horrifying Tyrion and Jon. Jaime kills Euron but is himself mortally wounded. The Hound convinces Arya to abandon her longtime vendetta and save herself, then confronts the Mountain. The brothers ultimately perish after falling from a tower into flames. Cersei and Jaime reunite but are killed as the Red Keep collapses atop them. Jon calls for a retreat as frantic civilians flee the devastation. Arya barely escapes alive. 73 6 \"The Iron Throne\" David Benioff & D. B. Weiss David Benioff & D. B. Weiss May 19, 2019 ( ) 13.61[8] Following the battle, the Unsullied execute captured soldiers upon Daenerys' orders. Tyrion finds Jaime and Cersei dead in the ruins. Daenerys rallies the Unsullied and Dothraki, declaring she will lead them to \"liberate\" the entire world. Tyrion denounces her and resigns as Hand. He is imprisoned for treason to await execution. Arya and Tyrion separately warn Jon that Daenerys is a threat to House Stark and the people. Jon confronts Daenerys. Unable to halt her destructive path, an agonized Jon kills her. Drogon melts the Iron Throne, then gently carries Daenerys' body away. Tyrion proposes that all future monarchs be chosen by Westerosi leaders, rather than through familial succession. Bran Stark is proclaimed king, titled Bran the Broken. He grants Sansa the North's secession as an independent kingdom and appoints Tyrion as his Hand. Jon is sentenced to the Night's Watch to appease the Unsullied, who then set sail for Naath, Missandei's homeland. Tyrion reorganizes the Small Council – Brienne, Bronn, Davos, and Sam – to rebuild King's Landing. Podrick is knighted. Sansa is crowned Queen in the North. Arya sets sail to explore west of Westeros. Jon rejoins Tormund and Ghost at Castle Black, leading the Wildlings north of the Wall.\n\nCast [ edit ]\n\nMain cast [ edit ]\n\nRecurring cast [ edit ]\n\nThe recurring actors listed here are those who appeared in season 8. They are listed by the region in which they first appear.\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nHBO announced the eighth and final season of the fantasy drama television series Game of Thrones in July 2016.[35][36] Like the previous season, it largely consists of original content not found in George R. R. Martin's A Song of Ice and Fire series.[37] As Benioff had verified in March 2015, the creators have talked with Martin about the end of the series, and they \"know where things are heading.\" He explained that the ends of both the television and the book series would unavoidably be thematically similar, although Martin could still make some changes to surprise the readers.[38] When asked about why the television series is coming to an end, he said, \"this is where the story ends.\"[39]\n\nCrew [ edit ]\n\nSeries creators and executive producers David Benioff and D. B. Weiss serve as showrunners for the eighth season. The directors for the eighth season were announced in September 2017. Miguel Sapochnik, who previously directed \"The Gift\" and \"Hardhome\" in the fifth season, as well as \"Battle of the Bastards\" and \"The Winds of Winter\" in the sixth season, returned to direct two episodes. David Nutter, who had directed two episodes each in the second, third, and fifth seasons, including \"The Rains of Castamere\" and \"Mother's Mercy\", directed three episodes for the eighth season. The final episode of the series was directed by Benioff and Weiss, who have previously co-directed two episodes, taking credit for one episode each.[40]\n\nAt the series' South by Southwest panel on March 12, 2017, Benioff and Weiss announced the writers for the series to be Dave Hill (episode 1) and Bryan Cogman (episode 2). The showrunners divided up the screenplay for the remaining four episodes amongst themselves.[41]\n\nWriting [ edit ]\n\nWriting for the eighth season started with a 140-page outline. Benioff said that the divvying up process and who should write what section became more difficult because \"this would be the last time that [they] would be doing this.\"[42]\n\nFilming [ edit ]\n\nIn an interview with Entertainment Weekly, HBO programming president Casey Bloys said that instead of the series finale's being a feature film, the final season would be \"six one-hour movies\" on television. He continued, \"The show has proven that TV is every bit as impressive and in many cases more so, than film. What they're doing is monumental.\"[43] Filming officially began on October 23, 2017[44] and concluded in July 2018.[45] Many exterior scenes were filmed in Northern Ireland and a few in Dubrovnik, Croatia; Paint Hall Studios in Belfast were used for interior filming.[46] The direwolf scenes were filmed in Alberta, Canada.[47]\n\nCasting [ edit ]\n\nThe eighth season saw the return of Tobias Menzies as Edmure Tully and Lino Facioli as Robin Arryn in the final episode, neither of whom appeared in the seventh season.[34] Marc Rissmann was cast as Harry Strickland, the commander of the Golden Company.[33]\n\nContent [ edit ]\n\nCo-creators David Benioff and D. B. Weiss have said that the seventh and eighth seasons would likely comprise fewer episodes, saying that after the sixth season, they were \"down to our final 13 episodes after this season. We're heading into the final lap\".[48][49] Benioff and Weiss said that they were unable to produce 10 episodes in the series' usual 12 to 14-month timeframe, as Weiss explained, \"It's crossing out of a television schedule into more of a mid-range movie schedule.\"[48] HBO confirmed in July 2016 that the seventh season would consist of seven episodes and would premiere later than usual in mid-2017 because of the later filming schedule.[50] Benioff and Weiss later confirmed that the eighth season would consist of six episodes and would premiere later than usual for the same reason.[51]\n\nBenioff and Weiss said about the end of the series: \"From the beginning, we've wanted to tell a 70-hour movie. It will turn out to be a 73-hour movie, but it's stayed relatively the same of having the beginning, middle[,] and now we're coming to the end. It would have been really tough if we lost any core cast members along the way[;] I'm very happy we've kept everyone and we get to finish it the way we want to.\"[51] The first two episodes are, respectively, 54 and 58 minutes long, while the final four episodes of the series are all more than an hour in length—episode three is 82 minutes (making it the longest episode of the series), episodes four and five are each 78 minutes,[52] and the final episode is 80 minutes.[53]\n\nA two-hour documentary, Game of Thrones: The Last Watch, which documents the making of the eighth season, aired on May 26, the week after the series finale.[54]\n\nMusic [ edit ]\n\nRamin Djawadi returned as the series' composer for the eighth season.[55] The soundtrack album for the season was released digitally on May 19, 2019 and was released on CD on July 19, 2019.[56]\n\nRelease [ edit ]\n\nBroadcast [ edit ]\n\nThe season premiered on April 14, 2019 in the United States on HBO.[57]\n\nMarketing [ edit ]\n\nOn December 6, 2018, HBO released the first official teaser trailer for the eighth season.[58] A second teaser trailer was released on January 13, 2019, which announced the premiere date as April 14, 2019. The trailer was directed by David Nutter.[59] HBO released a promotional advertisement with Bud Light on February 3, 2019 during Super Bowl LIII.[60] Later, first-look photos of several main characters were released on February 6, 2019.[61] On February 28, posters of many of the main characters sitting upon the Iron Throne were released.[29] The official full trailer was released on March 5, 2019.[30]\n\nIllegal distribution [ edit ]\n\nThe season premiere was reportedly pirated by nearly 55 million people within the first 24 hours of release. Of these numbers, 9.5 million downloads came from India, 5.2 million came from China, and 4 million came from the U.S.[62] On April 21, 2019, it was reported that the second episode of the season was illegally leaked online hours before it aired due to being streamed early on Amazon Prime Germany.[63] On May 5, 2019, it was reported that the fourth episode of the season was leaked online, with footage from the episode circulating on social media.[64]\n\nHome media [ edit ]\n\nThe season was released on Ultra HD Blu-ray, Blu-ray, and DVD on December 3, 2019.[65]\n\nReception [ edit ]\n\nCritical response [ edit ]\n\nThe season received mixed reviews from critics.[66] On Rotten Tomatoes, it holds an approval rating of 58% based on 18 reviews with an average rating of 6.5/10, the lowest rating for a season of Game of Thrones.[a] The website's critical consensus reads: \"Game of Thrones' final season shortchanges the women of Westeros, sacrificing satisfying character arcs for spectacular set-pieces in its mad dash to the finish line\".[68] On Metacritic, the eighth-season premiere garnered a score of 74 out of 100 based on 12 reviews, indicating \"generally favorable reviews.\"[69]\n\nThe first two episodes were met with mostly positive feedback. \"The Long Night\" was praised for the cinematography and grand scale of the battle between the living and the dead,[70] but was criticized for its lack of catharsis, logic, disorienting lighting, and the anticlimactic ending of the White Walker storyline that had been built up for seven seasons.[71][72][73] \"The Last of the Starks\" and \"The Bells\" were criticized for their rushed pacing, writing, and deviation from character development, with \"The Last of the Starks\" being labeled as \"anticlimactic\" and \"a huge letdown.\"[74][75][76][77][78] \"The Iron Throne\" was described as \"divisive\", and according to Rotten Tomatoes, the series finale represents \"a modest rebound\" but it \"went out with a whimper.\"[79][80] \"The Bells\" and \"The Iron Throne\" are the worst-reviewed episodes of the entire series on the website, with an approval of 49% and 48% respectively, while the last four episodes of the season \"plunged to record low scores.\"[74][81][82][83]\n\n\n\n\n\nGame of Thrones (season 8): Critical reception by episode Season 8 (2019) : Percentage of positive reviews tracked by the website Rotten Tomatoes[68]\n\nDavid Sims of The Atlantic wrote that the final season \"has been the same story over and over again: a lot of tin-eared writing trying to justify some of the most drastic story developments imaginable, as quickly as possible. As usual, the actors did their best with what was on the page.\"[79] Lucy Mangan of The Guardian wrote that the final season \"has been a rushed business. It has wasted opportunities, squandered goodwill[,] and failed to do justice to its characters or its actors.\"[84] Zack Beauchamp of Vox wrote that the final season \"dispensed almost entirely with trying to make sense of its characters' internal motivations — let alone the complex political reality that its psychological realism initially helped create.\"[85]\n\nKelly Lawler of USA Today wrote that the series ultimately betrayed its \"identity\" of \"tragedy and injustice\" with a \"pandering\" ending.[86] Judy Berman of Time wrote that the series failed to complete the answer to \"conflicting ideas about freedom, justice and leadership\"; these were themes that previously brought depth to the series.[87] Ellen Gray of the Philadelphia Inquirer and Darren Franich of Entertainment Weekly agreed that the final season was not as complex as previous seasons.[88][89] Franich gave the final season, featuring \"big-huge set pieces,\" a 'C' rating. The final season's \"broseph mentality shined through,\" shunting the interaction between female characters. Additionally, Franich criticized Cersei doing nothing this season, as well as the ultimate focus \"on Jon Snow, the least complicated main character.\"[89]\n\nHuw Fullerton of Radio Times wrote that the eighth season was not \"Thrones at its best\" but still had \"some sort of ending for the characters.\" For Fullerton, the season was \"like the finale — some bits I liked, one or two I loved, an awful lot that leaves me scratching my head.\"[90]\n\nRatings [ edit ]\n\nAudience response [ edit ]\n\nA petition to HBO for \"competent writers\" to remake the eighth season of Game of Thrones in a manner \"that makes sense\" was started on Change.org after \"The Last of the Starks\" aired, but went viral after \"The Bells\" aired.[97][98] The petition described showrunners David Benioff and D. B. Weiss as \"woefully incompetent writers\".[99][100][101][102] As of September 6, 2019, it has amassed over 1.73 million signatures.[97][101][103][104][105][106][107] Digital Spy reported that fans of the series criticized the season for the way it handled several character arcs and the \"rushed\" pacing.[97][108] The petition's creator stated that he never expected HBO to remake the season, but saw the petition as a message \"of frustration and disappointment at its core\".[97]\n\nThe petition was labelled as \"disrespectful to the crew and the filmmakers\" by actress Sophie Turner (who plays Sansa Stark),[109][110] \"ridiculous\", \"weird, juvenile\" by actor Isaac Hempstead Wright (who plays Bran Stark),[110][111] and \"rude\" by actor Jacob Anderson (who plays Grey Worm).[112] Emilia Clarke (who plays Daenerys Targaryen) indicated she was previously unaware of the petition, but gave a warmer response when she was asked what she would want to see happen if the eighth season were redone: \"I can only speak to my own character, and the people that I interact with on the show. But I would've loved some more scenes with me and Missandei. I would've loved some more scenes with me and Cersei\".[113]\n\nRichard Roeper, writing for the Chicago Sun Times, wrote: \"Over the last 25+ years, I've reviewed thousands of movies and dozens of TV shows, and I don't think I've ever seen the level of fan (and to a lesser degree, critical) vitriol leveled at [this show] in recent weeks\". However, Roeper noted that social media was not yet widely used during much of this time period.[106]\n\nLenika Cruz, writing for The Atlantic, wrote that with the end of the series, \"there are folks who don't feel as though the hours and hours they've devoted to this show have been wasted\", but \"there are many others\" who felt the opposite.[79] Kelly Lawler of USA Today wrote that the ultimate ending of the series was not what fans \"signed up for\".[86]\n\nCBS News has described several plot points that fans are dissatisfied with: the character arcs of Daenerys and Jaime; the manner of death for Jaime, Missandei, Rhaegal, and the Night King; the Battle of Winterfell being visually too dark; the \"basic existence of Euron Greyjoy\"; and \"Jon's treatment of Ghost\".[101]\n\nCast response [ edit ]\n\nIn an interview published just as the final season premiered, Kit Harington said, \"whatever critic spends half an hour writing about this season and makes their [negative] judgement on it, in my head they can go fuck themselves. [...] I know how much work was put into this [...] Now if people feel let down by [this final season], I don't give a fuck—because everyone [working on the series] tried their hardest. That's how I feel. In the end, no one's bigger fans of the show than we are, and we're kind of doing it for ourselves.\"[114]\n\nIn an interview with The New Yorker, Emilia Clarke said she had to hold back her innermost anxiety from Beyoncé: \"I was just, like, Oh, my God, my absolute idol in life is saying that she likes me, and I know for a fact that by the end of this season she's going to hate me. [...] All I wanted to scream was 'Please, please still like me even though my character turns into a mass-killing dictator! Please still think that I'm representing women in a really fabulous way.'\"[113]\n\nNathalie Emmanuel, who played Missandei, was heartbroken when she read her character's sudden demise: \"...I think the fact that she died in chains when she was a slave her whole life, that for me was a pungent cut for that character, that felt so painful\". Emmanuel, who was the only woman of color who was a regular on the series for the last several seasons, said, \"It's safe to say that Game of Thrones has been under criticism for their lack of representation, and the truth of it is that Missandei and Grey Worm have represented so many people because there's only two of them.\"[115]\n\nConleth Hill, who played Varys, told Entertainment Weekly that the seventh and eighth seasons were \"kind of frustrating\" and not his \"favorite\", noting that Varys \"kind of dropped off the edge\". Hill reacted with \"dismay\" to Varys apparently \"losing his knowledge\": \"If he was such an intelligent man and he had such resources, how come he didn't know about things?\" After being \"very bummed to not have a final scene with [Littlefinger]\", Hill was \"bummed not to have any reaction to [Littlefinger] dying, if he was [Varys'] nemesis\". Also, once the series ran out of book material as a source, Hill noted that \"special niche interest in weirdos wasn't as effective as it had been\". However, Hill was \"not dissatisfied on the whole\" regarding the series.[116]\n\nLena Headey had a \"mixed\" initial reaction to the manner of death of Cersei Lannister, the character she played. Headey would rather have Cersei die by \"some big piece or fight with somebody\". Eventually, fellow actor Nikolaj Coster-Waldau persuaded Headey on how to appreciate the scene, and she said her eventual belief that \"it seemed like the perfect end for\" Cersei because Cersei and Jaime \"came into the world together and now they leave together\".[117]\n\nAccolades [ edit ]\n\nWith 32 nominations, Game of Thrones broke the record of the most nominations received by a regular TV show in a single year.\n\nNotes [ edit ]\n\n^ [67] Before May 24, 2019, Rotten Tomatoes calculated a 67% approval from 627 reviews and scored a 7.48/10 average rating.", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Global_thinking.svg/10px-Global_thinking.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/en/e/e0/Game_of_Thrones_Season_8.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/32px-Blank_television_set.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e0/Game_of_Thrones_Season_8.png/220px-Game_of_Thrones_Season_8.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/api/rest_v1/page/graph/png/Game_of_Thrones_%28season_8%29/0/3c4a4990f7a165b4c784e3c3f2b9fb7d5cd6cc4c.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/e/e0/Game_of_Thrones_Season_8.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Game_of_Thrones_(season_8)", "title": "Game of Thrones (season 8)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/e/e0/Game_of_Thrones_Season_8.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}