{"url": "https://www.refinery29.com/en-us/2016/05/108339/the-hills-mtv-drama-fake-reality", "text": "“There are things the cast does not want to talk about, like Lauren and the sex tape. As producers, for us the challenge is getting access to what we know is the real story. Lauren would forever say, ‘I’m not mentioning Heidi’s name,’ or, ‘I’m not doing the show if she’s on the show.’ We were so sympathetic to that, but at the same time, you had Heidi wanting to make up with Lauren, still wanting to be a part of the show. And [you had] the sex tape rumors that Lauren didn’t want to talk about, yet that was a betrayal that was so important and such a big elephant in the room that we just had to work with Lauren and say, ‘Alright, so what are we going to do? We are going to have to access this somehow.’ It’s always a discussion… Lauren didn’t want to confront Heidi. That was a catch-the-drama moment. As reality TV producers, we are hoping these two [will] meet up, you know? We were lucky enough to be there at the nightclub where we thought Heidi and Spencer might show up. We knew Lauren was there, and I think we knew they might show up.”“I don’t want to get into the specifics of [the sex tape rumors] just because that’s their story, but from what we got on tape, it all just kind of came to a head at that nightclub. We were at Les Deux, [and] Heidi ended up showing up with Spencer, and [Lauren and Heidi] got into it outside. We weren’t even aware that they were [fighting]. I mean, you can see at the beginning of that scene that we’re scrambling to get our cameras there. There’s even a shot of cameras, which we go to great lengths to avoid, but because it was happening in real time and it really went down, it erupted and happened so quickly that we just hustled to get it.” Justin Bobby Brescia is the anti Spencer Pratt on The Hills. He’s still a shitty reality TV boyfriend (please refer to the times Audrina caught him making out with other women while she was at the same club), but he has this seductive power that makes it easy to see why Audrina returns to him time after time. Justin Bobby speaks in ridiculous platitudes, like “Truth and time tells all,” which now sound like everything spewed on The Bachelor, but back then were unique in their somehow grounded inanity. It’s hard to believe that he isn’t putting on an act for cameras or behaving a certain way due to producer intervention. Both DiVello and Travis insist that it didn’t take any special editing to depict Justin Bobby’s essence to audiences, nor did much of his footage wind up on the cutting room floor.“We knew Audrina was dating Justin Bobby. All of season 2, we were thinking, ‘Oh my gosh, Audrina has no story. All she does is go on dates with these guys, these funny characters.’ But then we knew she had this boyfriend, and we weren’t getting access to this story line. [We said to her], ‘We know this is happening. We know you’re dating this guy.’ It took a lot of work, and I think it was [producer] Sara Mast, who came on in season 3; she was able to get Justin to trust us.”“Justin’s such a genuinely nice person off camera to our crew and to all of us. He never gave us a problem. He was always very polite and thankful… I think Justin was a surprise each week, because he was like, ‘I’m starting to look like such an ass on the show. Can you not make me look so bad?’ We weren’t doing any of it. We kept explaining to him, ‘You’re doing this all to yourself. You’re just seeing this on camera, but this is how you are.’ I think he was such a great character, and he was such a natural on camera.”“In Audrina and Justin’s case, that was the relationship [in which] he was the bad [guy] who was really charming. She was always trying to break up with him or get away from him and his seductive power. Every time she would want to do it, if she broke up with him off camera, we would want her to at least have a conversation with him on camera so we could see that process, and inevitably they would get back together. So that turned out to be a long, drawn-out story line. What’s interesting, too, [is that] you do a lot of shooting with cast members, and then some of the best stuff makes the cut, but with Justin, he was so unwilling to shoot. It was very hard. He would give us so little of his time, and I think that there aren’t any shoots we did with Justin Bobby that didn’t make it to air. I think every single scene we shot with him is on television.” Lauren Conrad’s mascara tears during her fight with Audrina in season 4 have become the GIF that keeps on GIF-fing from The Hills. In 2013, Conrad told Cosmopolitan that producers had slowed down her single tear to make it even more dramatic, and that, “Whoops,” she wasn’t wearing waterproof mascara. The producers actually received letters asking why she didn’t think to apply makeup that would withstand her tears.“The mascara thing just happened, and it became a thing. Most of the time when we were shooting, we would be sitting on their balcony, like six or seven of us crammed on this tiny little balcony. You’re watching little monitors, and when you get that like black eyeliner roll, you’re just like, ‘Damn, this is so great,’ because again, we don’t have those [to-camera] confessionals — those OTF’s we call them in the business — so we have no other device to tell stories other than something like a black mascara line running down her face. You clearly notice she’s upset, and that’s so far and few between. Other than the help of music, that’s really all we have, so those were extremely helpful to us and they kind of became Lauren’s hallmark… We got so many letters that were like, ‘Why didn’t she wear waterproof mascara?,’ and I never could answer that. I didn’t know.”“I think it might have been slowed down in the trailer, but not in the show. It would be a little strange in the episode when we’re supposed to be in a kind of real-time scene for [the tear] to slow down. We would joke that we’d have these scenes where Lauren is finally going to talk to Audrina, and we would swear that Lauren would wear the runny mascara where because of that, she would literally ‘win’ the scene. They’re both crying, and Audrina’s mascara wouldn’t run, and Lauren’s would. Therefore, our hearts would go out to Lauren. We thought, ‘Does she do it on purpose? Does she wear the runny mascara because she wants to [win]?’ I mean, I don’t think so. She tries so hard not to cry. She used to say, ‘Guys, I'm so tired of crying on the show.’”", "images": ["https://www.refinery29.com/assets/d27ad8510dcf0eef13f6419f4f9a76e6.svg", "https://www.refinery29.com/assets/a899ed2b6826791e2b8dd7b2901f3668.svg", "https://www.refinery29.com/assets/563283d1407bc6df5095935bc30a3daa.svg", "https://www.refinery29.com/assets/e0a9b3381492f1a143fc3d5144778c26.svg", "https://www.refinery29.com/assets/94ef6f5acdd752723f8644874464d07a.svg", "https://www.refinery29.com/assets/94aebf5b5499306ab207a2b4f13e34a8.svg", "https://s2.r29static.com/bin/public/bff/0,0,2000,1050/x,80/1580497/image.jpg", "https://www.refinery29.com/assets/a70678be6c693f8a9915bec2fa49ee49.svg"], "top_img": "https://s2.r29static.com/bin/public/bff/0,0,2000,1050/x,80/1580497/image.jpg", "keywords": [], "authors": ["Shannon Carlin", "Ariana Brockington", "Martha Sorren", "Ariana Romero", "Leah Marilla Thomas", "Ineye Komonibo", "Elena Nicolaou", "Kaitlin Reilly", "The Hills Reality Show Real Or Fake"], "canonical_link": "https://www.refinery29.com/en-us/2016/05/108339/the-hills-mtv-drama-fake-reality", "title": "The Hills Producers Finally Tell Us What Was Real & What Was Fake", "meta_data": {"title": "The Hills Reality Show Real Or Fake", "description": "Was MTV's \"The Hills\" real or fake? On the show's 10th anniversary, the producers reveal how the drama behind the reality show actually went down.", "og": {"url": "https://www.refinery29.com/en-us/2016/05/108339/the-hills-mtv-drama-fake-reality", "title": "\"The Hills\" Producers Finally Tell Us What Was Real & What Was Fake", "description": "Was MTV's \"The Hills\" real or fake? On the show's 10th anniversary, the producers reveal how the drama behind the reality show actually went down.", "image": {"identifier": "https://s2.r29static.com/bin/public/bff/0,0,2000,1050/x,80/1580497/image.jpg", "secure_url": "https://s2.r29static.com/bin/public/bff/0,0,2000,1050/x,80/1580497/image.jpg", "width": 2000, "height": 1050}, "type": "article"}, "twitter": {"title": "\"The Hills\" Producers Finally Tell Us What Was Real & What Was Fake", "card": "summary_large_image", "site": "@refinery29", "description": "Was MTV's \"The Hills\" real or fake? On the show's 10th anniversary, the producers reveal how the drama behind the reality show actually went down.", "image": "https://s2.r29static.com/bin/public/bff/0,0,2000,1050/x,80/1580497/image.jpg"}, "pinterest": {"image": "https://s3.r29static.com/bin/entry/f39/112,0,1776,2400/x/1580495/image.png"}, "fb": {"app_id": 155023867867753, "pages": "86973707921,587074007996399,269626263209765,509115739117952,1562713254009921,583745561686633,656112191237463,284423314989162,974273182666651,192477361634120"}, "article": {"publisher": "refinery29"}, "viewport": "width=device-width, initial-scale=1", "theme-color": "#fd5b4e", "news_keywords": "the hills, lauren conrad, spencer pratt, heidi montag, holly montag, kristin cavallari, brody jenner, jason wahler, was the hills real, was the hills fake, the hills reality show, the hills scripted, whitney port, was the hills faked, audrina patridge, justin bobby, justin brescia, justin bobby brescia, spencer pratt and heidi montag, the city, laguna beach, stephen colletti, lauren conrad boyfriends, lauren conrad sex tape, lauren conrad sex tape rumor, you know what you did, lauren conrad mascara tears, natasha bedingfield unwritten, hilary duff, the hills theme song, was the hills totally fake, secrets of the hills, the princes of malibu, stephanie pratt, best moments on the hills, lauren conrads best moments, lauren conrads best the hills lines, fidm, teen vogue, lauren doesnt go to paris, stacie the bartender", "p": {"domain_verify": "b10faeb45f92f5ebf0073a215d615ea9"}, "entry_template": "entry.article", "author": "Lauren Le Vine", "channel": {"tag": "tv-shows"}}, "movies": [], "publish_date": 1462809600.0, "source": "https://www.refinery29.com", "summary": ""}