{"url": "www.theatlantic.com/politics/archive/2017/11/grading-president-trump/544985/", "text": "The obsession with “the base” is equally misleading. By definition, the “base” of a president’s support is the part of the electorate that is so passionate about the victor on election day that it takes immense problems and a long time to shake their support. Most presidents, including Richard Nixon, don’t lose their base. In a look at Watergate, Iran-Contra, and the Monica Lewinsky scandals, Julia Azari, Perry Bacon Jr., and Harry Enten found that the party base remained loyal to the president until the very end. Using the “base is still with him” standard is a little like saying that in a bad season the 30-year NFL season-ticket holder who never misses a game, who hosts a massive tailgate party every Sunday, who owns every piece of team paraphernalia sold at the team store, and who spends most of the non-working day checking his or her smartphone to see the latest injury report, still loves his or her team.\n\nThere are much better ways through which to evaluate the president that offer us a better understanding of how Trump has performed thus far.\n\nWhat are some ways in which Trump can claim that the critics have been wrong? In terms of using executive power to pursue his policy agenda, the president has a pretty stellar record. This is one area in office where he has boldly used presidential power to fulfill the promises that he has made on the campaign trail. His number one target has been regulations to curb climate change and high-risk financial investments. Starting from his first days in office, he has issued a series of executive orders that roll back actions taken under President Obama. Scott Pruitt at the EPA has moved aggressively against environmental protections and courted business interests who want more development. While his plan to build a wall along the southern border has stalled in Congress, Trump has relied on executive power to ramp up the detention and deportation of illegal immigrants. When the repeal and replace of ACA floundered, the Department of Health and Human Services has used all of its administrative power to render the Affordable Care Act ineffective. President Trump also ended vital subsidies for health-insurance providers that kept state-insurance markets stable. He declared an end to the Deferred Action for Childhood Arrivals program through executive fiat, eliminating the protections that Obama had granted to undocumented immigrants brought to the U.S. as children. To be sure, some of his efforts have been turned back by the courts, such as his early attempts to implement a ban on travelers from several mostly Muslim nations. Overall, however, the president receives high marks from his success at deploying this power.\n\nThe economy is also doing well. Though the president has not crafted any policies that diminish the middle- and working-class insecurity that motivated so many of his core supporters in states like Wisconsin, the stock market is booming; unemployment remains low. His critics rightfully point out that much of the rebound stems from the policies that President Obama put into place after the 2008 crash as well as the natural rhythm of the economic cycle. The trends that Trump boasts about already started under Obama. Wages also remain stagnant, the chief source of concern for much of Trump’s base. But politically these distinctions don’t matter. At least in the first year, Trump can tell voters that he is governing over a robust economy.", "images": ["https://cdn.theatlantic.com/thumbor/4HJxDswnpnlX7N02Yw8Dba07LVA=/3x352:2398x1600/960x500/media/img/mt/2017/11/RTX2SVNX/original.jpg", "https://cdn.theatlantic.com/assets/media/files/nav-crossword.png", "https://atlanticmedia.122.2o7.net/b/ss/atlanticprod/1/H.22--NS/0", "https://cdn.theatlantic.com/thumbor/qjytGxkoLFZIIzkbXHBYqsJx05s=/0x125:2399x1474/720x405/media/img/mt/2017/11/RTX2SVNX/original.jpg"], "top_img": "https://cdn.theatlantic.com/thumbor/4HJxDswnpnlX7N02Yw8Dba07LVA=/3x352:2398x1600/960x500/media/img/mt/2017/11/RTX2SVNX/original.jpg", "keywords": [], "authors": ["Julian E. Zelizer"], "canonical_link": "https://www.theatlantic.com/politics/archive/2017/11/grading-president-trump/544985/", "title": "Grading President Trump", "meta_data": {"viewport": "width=device-width,initial-scale=1", "description": "While he gets high marks for using his executive power to enact policy changes, by most measures, he is not doing well.", "theme-color": "#000000", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-status-bar-style": "black", "apple-mobile-web-app-title": "The Atlantic", "referrer": "unsafe-url", "og": {"site_name": "The Atlantic", "locale": "en_US", "title": "Grading President Trump", "type": "article", "url": "https://www.theatlantic.com/politics/archive/2017/11/grading-president-trump/544985/", "image": "https://cdn.theatlantic.com/thumbor/4HJxDswnpnlX7N02Yw8Dba07LVA=/3x352:2398x1600/960x500/media/img/mt/2017/11/RTX2SVNX/original.jpg", "description": "While he gets high marks for using his executive power to enact policy changes, by most measures, he is not doing well."}, "fb": {"pages": "29259828486,1468531833474495,1061579677251147,457711054591520,370457103090695,1631141167169115,148681772342453,1510507419185410,128344747344340,128377530562508,236061986423933", "admins": "577048155,17301937", "app_id": 100770816677686}, "p": {"domain_verify": "68e1a0361a557708fefc992f3309ed70"}, "twitter": {"site": "@theatlantic", "domain": "theatlantic.com", "card": "summary_large_image", "image": {"src": "https://cdn.theatlantic.com/thumbor/4HJxDswnpnlX7N02Yw8Dba07LVA=/3x352:2398x1600/960x500/media/img/mt/2017/11/RTX2SVNX/original.jpg"}}, "application-name": "theatlantic", "msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "https://cdn.theatlantic.com/assets/static/b/theatlantic/img/lacroix/apple-touch-icon-iphone.50541ad29f2c.png", "ROBOTS": "INDEX, FOLLOW", "krux": {"title": "Grading President Trump", "description": "While he gets high marks for using his executive power to enact policy changes, by most measures, he is not doing well."}, "author": "Julian E. Zelizer", "ia": {"markup_url": "https://www.theatlantic.com/facebook-instant/article/544985/"}, "article": {"publisher": "https://www.facebook.com/TheAtlantic/", "opinion": "false", "content_tier": "metered", "tag": "politics", "section": "Politics", "published_time": "2017-11-08T06:00:00-05:00", "modified_time": "2017-11-08T13:02:51-05:00"}, "keywords": "President Trump", "news_keywords": "President Trump"}, "movies": [], "publish_date": 1510138800.0, "source": "http://www.theatlantic.com", "summary": ""}