{"url": "https://en.wikipedia.org/wiki/Michelle_Tanner", "text": "Michelle Elizabeth Tanner is a fictional character on the long-running ABC sitcom Full House, who was portrayed by Mary-Kate and Ashley Olsen. She first appeared in the show's pilot, \"Our Very First Show\", which aired in 1987 and continued to appear throughout up to the two-part series finale, \"Michelle Rides Again\" in 1995. The character of Michelle was the Olsen twins' first acting role; the two were infants when they started working on the series. After Full House, the twins started to play in a lot of movies. Michelle Tanner is not on the continuation of the show, called “Fuller House”. The other characters talk sometime about Michelle, so they let other people know that she is still a character of the show.\n\nCharacter [ edit ]\n\nMichelle Tanner is the youngest member of the Tanner family and is notable in the series for saying a string of precocious catchphrases such as \"you got it dude\", “puh-lease”, \"you're in big trouble, mister\", \"no way, José!\", and \"aw nuts!\" Raised by her father Danny Tanner, her uncle Jesse Katsopolis and her father's friend Joey Gladstone after her mother Pamela's death in a car accident caused by a drunk driver, Michelle debuted during her character's infancy, maturing throughout the progression of the series. She is depicted as being slightly mischievous, though her status as the youngest daughter of the family leaves many of her misdeeds undisciplined and spares her from punishment – much to the chagrin of her older sisters. Michelle is quite playful, being a young child; however many episodes end with her realization of a vital moral. Having never interacted with her deceased mother, Michelle occasionally yearns for a mother of her own and episode plots have surrounded her desire for a mother and her plans to attempt to gain one through her father Danny remarrying. She forms a very strong familial bond with Jesse and enjoys his company and playful teasing. She was the flower girl at his and Becky's wedding. Their relationship is so strong that she becomes crestfallen upon learning of Jesse's intended relocation from the Tanner household after his marriage to Rebecca Donaldson in the season four episode \"Fuller House\". She holds a tendency to scheme when met with a new desire as an enhancement to the comedy of the series but she eventually realizes the errors of her ways by the episode's conclusion. From seasons six through eight (as first established in \"Lovers and Other Tanners\"), Michelle is a \"Honey Bee\" in an organization which her sisters D.J. and Stephanie had previously participated in. Michelle attends Meadowcrest Preschool through seasons 3-4 and later, Frasier Street Elementary School through seasons 5–8.\n\nFriendships [ edit ]\n\nIn the season three episode \"Bye, Bye Birdie\", on Michelle's first day of preschool, she meets a boy named Aaron Bailey, who, that day, is able to wear the sharing crown because he brought his toys in. That day, the teacher calls the kids to the reading carpet for story time and Michelle tells the class bird to come to participate, opening the cage and consequently resulting in the bird flying out the open window. A saddened Michelle desperately attempts to get the bird back but at the end of the episode, Danny gets her a new bird for her class. When she brings it in, all the kids love it and Aaron lets Michelle wear the sharing crown for bringing the bird to be the class pet; the two eventually become friends and stay friends throughout the series. In seasons five and six, she is friends with a boy named Teddy, whom she meets on her first day of kindergarten in the season five premiere \"Double Trouble\". The two enjoy doing many things together; it is revealed in \"The Long Goodbye\" that they enjoy dotting each other's \"I\"'s on their papers. When the two are in first grade, Teddy reveals his father got a new job and thus he and his family have to move to Amarillo, Texas. Michelle, saddened by the news, ties him up in her room tricking him into thinking she was teaching him how to jump rope. He is eventually untied by Joey and he gives her his special toy, \"Furry Murray\" and she gives him her special stuffed pig, \"Pinky.\" Later, the two decide to write to one another. At the end of that same episode, Michelle makes a new friend named Denise Frazier, who then sits in Teddy's old seat and learns how to cross \"T\"'s. The two become friends through the seventh season (Denise does not appear in season eight due to her portrayer Jurnee Smollett's commitment to the short-lived sitcom On Our Own). She, at first, does not want a new best friend but she does like Denise. Michelle also makes many other friends throughout the series, including shy but intelligent Derek Boyd (Blake McIver Ewing) and tough-girl Lisa Leeper (Kathryn Zaremba). In the season seven episode \"Be Your Own Best Friend,\" Teddy moves back to San Francisco and attends Michelle's school once again, rejoining her class. Michelle, Teddy and Denise get into an argument when Danny comes into class for Parent Volunteer Day. He gives an assignment to trace each student's best friend, leading Michelle to believe that a person could only have one best friend. The three then have trouble deciding whom to trace, allowing Michelle to take advantage of the situation. She says that she would pick the one who gives her the best stuff but she did not say it explicitly (Teddy offers to give her his lone-star bolo tie and some Snickles candy – a parody of Skittles and Denise offers her hair scrunchie and pencil case; Michelle takes them up on the offers, not realizing she is accepting bribes, which ultimately make Teddy and Denise angry when they understand what is actually happening). The three eventually make up in the end after Michelle picks Comet the dog as her best friend and traces him and Danny helps them to understand that they could all be best friends.\n\nComet the dog [ edit ]\n\nIn the season three episode \"And They Call It Puppy Love,\" the Tanner family adopts a dog named Comet, one of the puppies born to Minnie, a golden retriever who wandered from the home of her owners (in Ohio) and wandered halfway through California and was found by Joey and Michelle in the backyard. Michelle grows a strong bond with Comet over the course of the series. In the season four episode \"One Last Kiss,\" Michelle wanted another dog that was her size because Comet got bigger. In the season six episode \"Road to Tokyo,\" when Jesse is on tour in Tokyo, Michelle decides to dig a hole to Tokyo in order to visit and she asks Comet to dig. In the season eight episode \"Comet's Excellent Adventure,\" Comet runs away when Jesse unknowingly gives her permission to walk Comet by herself (as he was trying to deal with his bandmates in Jesse and the Rippers voting him out of the group due to the intrusion of his commitments to the family and his radio show gig), leading Michelle (and eventually, the rest of the family) to look all around San Francisco to find him (it was the only episode of the series that was filmed on location in San Francisco).[1] Comet comes home at the end of the episode.\n\nCrediting [ edit ]\n\nThe production team behind Full House did not want people to know that Michelle was played by a set of twins, so the girls were credited as \"Mary-Kate Ashley Olsen\" for most of the show's run (making it appear as if a single actress had the first name Mary-Kate and the middle name Ashley). Although the two were credited separately as \"Mary-Kate Olsen and Ashley Olsen\" during the closing credits in the series' first season (they were not officially added to the opening title sequence until season two but were credited in the syndicated versions of the season one opening titles), it was not until the eighth and final season that the twins were credited as \"Mary-Kate and Ashley Olsen\" in the opening titles. Despite the fact that the Olsens are fraternal twins, their physical appearances were nonetheless similar enough so that few could tell the difference between the two over the course of the show's run. In season one, Mary-Kate was used more often due to the fact Ashley cried when she was put on set for a scene.[2]\n\nReception [ edit ]\n\nIn 1989, Mary-Kate and Ashley Olsen won a Young Artist Award for Best Young Actor/Actress Under Five Years of Age for their portrayal of Michelle.[3] In 1990, they were also awarded Young Artist Awards for their work on Full House, in the category of Outstanding Performance by an Actress Under Nine Years of Age.[4] The two also won the Young Artist Awards for Exceptional Performance by a Young Actress Under Ten in 1991.[5]\n\nBook series [ edit ]\n\nShortly after the show ended, two separate book series focusing respectively on Michelle and Stephanie were published. The stories take place mainly during the continuity of the show's later seasons and include the sisters' friends and many other characters. The plots mainly focus on the characters' struggles and triumphs. Most of the books were not an episode in the series. Michelle is about nine years old and Stephanie is in her teens in the series. The books were mainly published in the 1990s.[6]\n\nFuller House [ edit ]\n\nThe twins declined to reprise their role for Fuller House, the 2016 Netflix sequel to Full House. Ashley cited their 12 years away from acting and Mary-Kate said the timing was bad.[7] In the series, their character is only seen during flashbacks and mentioned from time-to-time. For example, they mention that Michelle is now working as a fashion designer in New York, and thus has become an unseen character of this series.", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/7/75/Michelle_Tanner.jpg/220px-Michelle_Tanner.jpg", "https://upload.wikimedia.org/wikipedia/en/7/75/Michelle_Tanner.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/7/75/Michelle_Tanner.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Michelle_Tanner", "title": "Michelle Tanner", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/7/75/Michelle_Tanner.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}