{"url": "www.inquisitr.com/4093856/suits-star-meghan-markle-and-prince-harrys-christmas-wedding-not-confirmed/", "text": "Meghan Markle and Prince Harry are reportedly not getting married in December. The couple recently attended the wedding of Prince Harry’s best pal, Tom Inskip, in Jamaica, and according to a tabloid, the British prince came back all inspired by the feel and setting of the wedding location. He and Meghan Markle reportedly told friends that they would be getting married before Christmas in the Caribbean.\n\nEarlier this month, Prince Harry and Meghan Markle made their first public appearance as a couple at Tom Inskip and Lara Hughes-Young’s destination wedding in Jamaica. There, the 32-year-old royal’s friends joked that he would be the next to tie the knot. And according to Vanity Fair, Prince Harry had confided to his friends that he hoped to get married soon.\n\nThe report quoted a friend as telling Royal Watch that some of them “really” thought that he would propose to Meghan Markle by the end of the year.\n\n“Harry is head over heels about Meghan and some of us really think he’ll have popped the question by the end of the year.”\n\nPrince Harry, Meghan Markle's wedding date not yet confirmed. [Image by Justin Tallis - WPA Pool / Getty Images]\n\nAnother report speculated that Prince Harry and Meghan Markle would get engaged this summer. Life & Style, on the other hand, reported that the British royal was extremely impressed by the “romantic setting” of the Caribbean wedding, adding that he wanted his wedding to have a similar feel, according to Gossip Cop.\n\n“He was blown away by the romantic setting and told friends he wants his own wedding to have a similar feel.”\n\nAs Meghan Markle had always dreamed of a beach wedding, she did not need much convincing, the report said. It also reported when the couple would like to get married — just before Christmas.\n\n“The couple made it official, telling friends they’ve decided to tie the knot in the Caribbean just before Christmas.”\n\nMoreover, according to the tabloid, Prince Harry and Meghan Markle were determined to make their wedding as romantic as possible.\n\nThe gossip buster site Gossip Cop has reported that there was no truth in Life & Style‘s report. An unnamed source told the site that the wedding reports “aren’t true, like most of what is written” about Meghan Markle and Prince Harry.\n\nMeanwhile, the Daily Mail is reporting that Prince Harry and Meghan Markle intend to take their relationship to the next level. They are planning to move in together and make an apartment in Kensington Palace their new address. The apartment is being renovated, and the prince is taking a “very close” interest in the work that is taking place.\n\nThe report quoted a source as saying that the royal seemed to be in a real hurry to move in with Meghan Markle.\n\n“He keeps popping round and asking when it will be ready. He seems in a real hurry to move in with Meghan.”\n\nA palace spokesperson, however, has refused to comment on the new apartment, saying that it was a “private matter,” according to the report.\n\nMeghan Markle and Prince Harry intend to move in together. [Image by Tasos Katopodis/Getty Images]\n\nIt does not look like Meghan Markle will be moving in soon, as the American actress is going to begin filming Suits Season 7 in April. On the long-running legal series, she plays Rachel Zane, who is one of the central characters and the love interest of the male protagonist. There are speculations that she might quit the series midway, but for now, she is returning to Toronto, Canada, where the filming of Suits takes place, soon.\n\nA friend told The Sun that Meghan Markle and Prince Harry were trying to spend as much time together as possible as the former would be busy filming the series through spring and summer.\n\n“They’re trying to spend as much time to­gether as possible as Meg has filming commitments over the spring and summer. But she feels that a move to London is inevitable as their relationship becomes more serious.”\n\nMeghan Markle and Prince Harry began dating in the summer of last year.\n\n[Featured Image by Robin Marchant/Getty Images]", "images": ["https://cdn.inquisitr.com/wp-content/uploads/2017/03/Meghan-Markle-7.jpg", "https://cdn.inquisitr.com/wp-content/uploads/2017/03/Prince-Harry-2.jpg", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_footer.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'300'%20height%3D'170'%20viewbox%3D'0%200%20300%20170'%3E%3C%2Fsvg%3E", "https://certify.alexametrics.com/atrk.gif?account=Tllhu1DlQy20Y8", "https://secure.gravatar.com/avatar/50b42e2387782ca1645e3e66762f236d?s=250&d=mm&r=g", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/logo_header_no_tagline.png", "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "data:image/svg+xml,%3Csvg%20xmlns%3D'http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg'%20width%3D'138'%20height%3D'70'%20viewbox%3D'0%200%20138%2070'%3E%3C%2Fsvg%3E", "https://cdn.inquisitr.com/wp-content/uploads/2017/03/Suits-Actress-Meghan-Markle.jpg"], "top_img": "http://www.inquisitr.com/assets/05e3e3/dist/images/logos/favicon.png", "keywords": [], "authors": ["Anshu Shrivastava"], "canonical_link": "https://www.inquisitr.com/4093856/suits-star-meghan-markle-and-prince-harrys-christmas-wedding-not-confirmed/", "title": "‘Suits’ Star Meghan Markle And Prince Harry’s Christmas Wedding Not Confirmed", "meta_data": {"msapplication-TileImage": "//www.inquisitr.com/assets/05e3e3/dist/images/logos/inq-win.png", "msapplication-TileColor": "#ed1c24", "fb": {"pages": 71179904752, "app_id": 164157850314499}, "y_key": "f282393706a5fd85", "viewport": "width=980", "mediapartners-google": "noindex", "adsbot-google": "noindex", "adsbot": "noindex", "msvalidate.01": "1C6368F835120934051BE08C50A93BA3", "p": {"domain_verify": "27de048ce20584ff72683f9a7e89cbc1"}, "yandex-verification": "01101353387c3168"}, "movies": [], "publish_date": null, "source": "http://www.inquisitr.com", "summary": ""}