{"url": "https://people.com/parents/jamie-lynn-spears-pregnant-expecting-second-child/", "text": "Image zoom Jason Merritt/Getty Images\n\nSurprise — Jamie Lynn Spears is pregnant!\n\nThe actress and singer, 26, is expecting her second child and first with husband Jamie Watson, she confirmed Sunday on Instagram.\n\nGet push notifications with news, features and more.\n\n“Looks like we are starting off 2018 with another big milestone…sooo happy to announce that Maddie is FINALLY going to be a big sister,” wrote Spears alongside a family photo. “2017 was filled with some of the biggest challenges of my life, as well as some of the biggest blessings, so I made a choice to lay low this year to focus on truly becoming my best self as a person and as an artist.”\n\nShe continued, “During that time, I continued working on my music and telling my story, which has created some of my most honest work and I [CAN’T] wait to share that with you all very soon. 2018 is going to be filled with many milestones both personally and professionally.”\n\n“I appreciate each of you for your patience and support through I[it] all. 2018 has a lot coming, so GET READY…….. #12DaysofJLS.”\n\nThe post was the final addition to her #12DaysofJLS social media countdown, during which the star shared 12 milestones from her life leading up to Christmas.\n\nSpears’ bundle of joy on the way joins the star’s daughter Maddie Briann, her 9½-year-old daughter with ex-fiancé Casey Aldridge.\n\nWant all the latest pregnancy and birth announcements, plus celebrity mom blogs? Click here to get those and more in the PEOPLE Babies newsletter.\n\nReacting to the announcement on Twitter, the star’s older sister Britney Spears wrote, “Maddie is going to be the best big sister!!! So happy for you @jamielynnspears!!!! Love you all sooo much!!!”\n\nRELATED VIDEO: Jamie Lynn Spears Thanks First Responders as Daughter Maddie Celebrates 9th Birthday Four Months After ATV Accident\n\n\n\nFor more coverage, follow our babies magazine on Flipboard.\n\nSpears’ happy news follows tragedy that struck her family in February, when Maddie was involved in an ATV accident on Super Bowl Sunday. The vehicle she was riding flipped over into a pond on Watson and Spears’ Kentwood, Louisiana, property, and Maddie was subsequently submerged under water for several minutes.\n\nHelp arrived quickly and freed the little girl from the seat belt and safety netting after Spears, Watson and others could not. Maddie woke up, and was able to return home from the hospital five days later.\n\nRELATED: Jamie Lynn Spears and Daughter Maddie Celebrate Valentine’s Day After Accident: “We Don’t Take a Second for Granted”\n\nFamily members, including aunt Britney asked for prayers over social media and elsewhere following the incident — and Maddie was eventually able to make a full recovery, celebrating her birthday in style four months later alongside some very special guests.\n\n“My baby is 9 years old today, and more then ever we realize how precious every day is. So, we have to thank these 2 HEROS 🙏🏻 John and Victoria are the first responders, who literally saved Maddie’s life, and they were able to celebrate her another year of her life with us this past weekend!” she captioned a June photo of the two with the birthday girl.\n\nFROM PEN: Katherine Heigl Reveals the Emotional Way She Told Her Daughters She Was Pregnant\n\n\n\nRELATED GALLERY: Kylie Jenner and More Celebs Who Became Moms at a Young Age\n\nThe star opened up to Entertainment Tonight in 2016 about the potential of adding to her family, saying if it was up to Watson, they would “have kids, like yesterday.”\n\n“But for me, I think that having children is about timing, as well. I know that they always say, ‘There is no right time to have a child, you know. Just have babies,’ ” Spears said.\n\n“But I think right now that it’s maybe a little selfish for me to have a child. I am getting busy,” she continued. “I want to be able to do the same as what I have done with Maddie — really just be a mom for a little bit and have that time to focus on my next child. But, yeah, we want more babies, of course.”\n\n“I’ve been wanting to have kids since the day we got married,” said Watson, 35, adding that he and his wife would like to have “a bunch” of children and noting with a smile, “The time is right. It’s always something with her career [and] I’m really busy, too. There’s no good time to have a kid.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20140'%3E%3C/svg%3E", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1426&h=747&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fjamie-lynn-spears1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fjamie-lynn-spears1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1426&h=747&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fjamie-lynn-spears1-2000.jpg", "keywords": [], "authors": ["Jen Juneau"], "canonical_link": "https://people.com/parents/jamie-lynn-spears-pregnant-expecting-second-child/", "title": "Jamie Lynn Spears Pregnant, Expecting Second Child", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Babies,Expecting,Jamie Lynn Spears,Kids,Maternity,News", "news_keywords": "Babies,Expecting,Jamie Lynn Spears,Kids,Maternity,News", "description": "Jamie Lynn Spears' second child on the way will join big sister Maddie Briann, her 9½-year-old daughter from a previous relationship", "og": {"title": "Jamie Lynn Spears Expecting Second Child: 'We Are Starting Off 2018 with Another Big Milestone'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/parents/jamie-lynn-spears-pregnant-expecting-second-child/", "description": "Surprise — Jamie Lynn Spears is pregnant! The actress and singer, 26, is expecting her second child and first with husband Jamie Watson, she confirmed&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1426&h=747&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fjamie-lynn-spears1-2000.jpg", "width": 1426, "height": 747}}, "pinterest": {"url": "https://people.com/parents/jamie-lynn-spears-pregnant-expecting-second-child/", "description": "Jamie Lynn Spears' second child on the way will join big sister Maddie Briann, her 9½-year-old daughter from a previous relationship", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fjamie-lynn-spears1-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/parents/jamie-lynn-spears-pregnant-expecting-second-child/", "title": "Jamie Lynn Spears Expecting Second Child: 'We Are Starting Off 2018 with Another Big Milestone'", "description": "Jamie Lynn Spears' second child on the way will join big sister Maddie Briann, her 9½-year-old daughter from a previous relationship", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1426&h=747&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F05%2Fjamie-lynn-spears1-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}