{"url": "https://en.wikipedia.org/wiki/A_Christmas_Prince", "text": "2017 film by Alex Zamm\n\nA Christmas Prince is a 2017 American Christmas romantic comedy film directed by Alex Zamm, written by Karen Schaler and Nathan Atkins and stars Rose McIver, Ben Lamb, Tom Knight, Sarah Douglas, Daniel Fathers, Alice Krige and Tahirah Sharif. The film was released on Netflix on November 17, 2017.[1][2] A sequel, titled A Christmas Prince: The Royal Wedding, was released in 2018 and another one in 2019, A Christmas Prince: The Royal Baby.\n\nPlot [ edit ]\n\nJust before Christmas, an aspiring young American magazine journalist, Amber Moore, is sent to the foreign nation of Aldovia to cover a press conference given by Prince Richard, who is set to take the throne following his father's recent death. Richard has been portrayed in the press as an irresponsible playboy and he is also rumored to be planning to abdicate. Amber hopes her work in Aldovia will lead to a big break and she heads to the royal family's palace for the press conference, but the prince fails to appear. Rather than leave with the press pack, Amber decides to snoop around the palace and while doing so is mistaken for young Princess Emily's new American tutor, Martha Anderson. Amber plays along and assumes Martha's identity in order to investigate the rumors of abdication.\n\nEmily, who has spina bifida, tries to prank Amber into quitting, but warms up to her after Amber treats her like a normal student rather than an invalid. As Emily's tutor, Amber meets the royal family, including Richard, who she realizes is the man she insulted earlier at the Aldovian airport after he stole the taxi she was about to get into. Amber becomes attracted to Richard after learning that contrary to rumors he is a compassionate and responsible man, though he is indeed reluctant to take the throne. During this time Amber learns from Emily that Richard's scheming and jealous cousin Simon is next in line for the throne, which he sorely wants; Amber also encounters Richard's beautiful ex-girlfriend Sophia, who Richard suspects was only interested in him for his future title.\n\nEmily learns the truth about Amber's identity but agrees to keep it secret so long as Amber writes a story that exposes Prince Richard for the good man that he is. In pursuit of her story, Amber follows Richard on horseback through the woods, but her horse throws her off and she is nearly attacked by a wolf, only to be saved by the prince. Richard takes Amber to his father's old hunting cabin, where he reveals that after he told his father he was going to renounce the throne they had a fight and that the king died soon after. Richard then shows Amber a mysterious poem written by his father, and the two almost kiss but are interrupted by the sound of neighing horses. After Richard leaves to check on the animals, Amber searches the late king's desk and discovers a hidden compartment holding documents proving that the Prince was secretly adopted; she hides the documents and takes them back to the palace.\n\nAmber is reluctant to reveal the truth as it would deeply hurt Richard but decides to tell him during a walk. Richard interrupts her confession with a kiss, and Amber realizes she is in love with him. At the same time, a suspicious Sophia and Simon search Amber's room and discover her true identity and Richard's adoption certificate. At the Christmas Eve Ball, as Richard prepares to be crowned, Sophia reveals his adoption certificate and Amber's true identity. Simon asserts himself as next in line for the throne as Richard storms off and rebuffs a repentant Amber's apologies, and she tearfully leaves the palace. Later, the queen reveals to Richard that she adopted him after being told she could not have children, and that she regretted not telling him sooner, but that she and the king considered him their true son. Richard forgives his mother for her deception and promises to not let Simon win the throne so easily.\n\nSimon marries Sophia but learns he cannot be crowned until the queen is available to preside over the ceremony. Meanwhile, Amber suspects that she can prove Richard is the rightful king based on clues from his father's poem. She is allowed back into the palace and in a Christmas ornament made by the late king, finds a secret proclamation that declares Richard as the rightful heir. Amber takes the document to the official chamber where Simon is being crowned and arrives in time for Richard to be crowned instead; she quietly leaves Aldovia after the ceremony.\n\nBack home, the magazine Amber works for refuses to publish her story on Richard, calling it a 'puff piece'. In anger, she quits the magazine, deciding to blog about the true Richard instead. Her blog becomes popular and eventually gains the attention of Richard himself. Amber is spending New Year's Eve at her father's New York City diner when Richard surprises her. He tells Amber that he is truly in love with her and proposes, which she happily accepts.\n\nCast [ edit ]\n\nLocation [ edit ]\n\nThe trilogy was filmed at Peleș Castle, Sinaia, Romania. Other filming locations in Romania included Bragadiru Palace, the Cotroceni National Museum, and the Carol Davila Medicine and Pharmacy University, all of which are located in Bucharest, the Romanian capital, which is about two hours from Sinaia.\n\nRelease [ edit ]\n\nThe film was released on Netflix on November 17, 2017.[3]\n\nReception [ edit ]\n\nOn review aggregator website Rotten Tomatoes, the film holds an approval rating of 70% based on 10 reviews, and an average rating of 6/10.[4]\n\nSequels [ edit ]\n\nOn May 18, 2018, a sequel was announced, titled A Christmas Prince: The Royal Wedding. It was released on Netflix on November 30, 2018.[5]\n\nA third film, titled A Christmas Prince: The Royal Baby was announced by Netflix on March 11, 2019 for a December 5, 2019 release. [6]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/9/91/A_Christmas_Prince.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/9/91/A_Christmas_Prince.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/A_Christmas_Prince", "title": "A Christmas Prince", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/9/91/A_Christmas_Prince.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}