{"url": "https://www.dogster.com/lifestyle/snow-buddies-not-much-fun-for-puppies-who-died-in-filming", "text": "Did these dogs come from a puppy mill? That's the first thing that came to my mind when I read this release from the American...\n\nDid these dogs come from a puppy mill? That’s the first thing that came to my mind when I read this release from the American Humane Association. First, whoar reputable breeder in his or her right mind would have released those puppies that early? Second, the fact they had Parvo suggests to me that these puppies were bred and raised in an unhealthy environment. Granted, Parvo can occur in many places but ANY reputable breeder would NEVER have had this bad a problem with Parvo OR released dogs who could possibly have been exposed to Parvo.\n\nI don’t care how cute this movie could be, I don’t plan on seeing it. I can pass on full length ads for puppy mills, thank you.\n\nThanks to all of you who have barked in about the poor puppies who died during the new “Snow Buddies” movie. Here’s one comment from Nika but I have heard from too many of you to thank!\n\nNika wrote:\n\nHey guys.. I just wanted to make sure you know about this article on Snow Buddies. It looks like a cute movie, but I just can’t get past the sadness of knowing some puppies were shipped out WAY too early to make this movie and then some even died. It was so irresponsible on the part of the movie makers as well as the breeders. Anyway.. please share this article with folks, so they can read before they buy.\n\nHere’s the press release from the AHA:\n\nAmerican Humane Association Statement on Snow Buddies Los Angeles (March 27, 2007) The American Humane Association is conducting an investigation after five puppies died while on location for the filming of the movie Snow Buddies. As many as six others have fallen ill after exposure to parvovirus. Twenty-eight puppies are being treated after being exposed to the virus. Earlier in the production, 30 puppies were removed from the set when 15 of them showed signs of illness, eventually diagnosed as giardia and coccidia. Three of these puppies were euthanized due to intestinal complications. Parvovirus, also known as parvo, is a highly contagious viral infection in dogs. It causes fever, vomiting, diarrhea and lack of appetite and it can be fatal.\n\nAmerican Humane is the authority behind the No Animals Were Harmed end credit on movies. An American Humane Certified Safety Representative visited the Snow Buddies set in Vancouver, British Columbia, on Feb. 19, 2007, the first day of shooting. Fifteen golden retriever puppies were on set, and American Humane learned that 15 others had been treated by a local veterinarian since Feb. 7. The Safety Representative requested that all the puppies receive additional veterinary checks before proceeding with filming. Twenty-five of the puppies were from an American breeder and five were from a Canadian breeder. At the time they were seen by the American Humane Safety Representative, the puppies were approximately 8 weeks old. However, it is believed that they were only 6 weeks old when they were separated from their mothers and brought by the trainer, Anne Gordon, to the Snow Buddies movie set. American Humane has recommended that Snow Buddies only import puppies that are older than 14 weeks. All vaccinations have to be done by a veterinarian, along with thorough check-ups. American Humane was unaware that the puppies were underage when they were transported by the trainer from the breeders. American Humane will investigate the breeder who allegedly exported 25 puppies to Canada under the age of 8 weeks. Per the U.S. Department of Agriculture, it is illegal to transport puppies under the age of 8 weeks. American Humane has contacted the Canadian authorities and is working with the U.S.D.A. Investigations and Enforcement division. To continue filming the movie, Snow Buddies hired 28 older replacement golden retrievers after the first 30 were removed for treatment. Unfortunately, this second group has been exposed to parvovirus. American Humane learned recently that one litter of the older puppies used after the first became sick was vaccinated for parvovirus at the Canadian border by a veterinarian contacted by the puppies trainer, and the first sign of the parvo was from that same litter. We have also learned that, unbeknownst to the production, the filming location in the lower mainland of Vancouver has witnessed an outbreak of parvo dating back as far as six months before production began. In this case, the puppies from Washington State were removed from their mother (breeder) too early and vaccinated. The vaccine takes two weeks before it is effective. Sometimes when puppies are vaccinated early there is still a risk of infection. High levels of maternal antibodies present in a puppys bloodstream will block the effectiveness of a vaccine. Despite being vaccinated, puppies can still contract parvovirus because the window of susceptibility can be several days to a couple of weeks. American Humane is conducting a full investigation on the trainer and breeders and following the progress of the puppies that have been retired from the production, many of whom have been placed in new adoptive homes. The company producing Snow Buddies has complied with each request from American Humane and has made changes so that working puppies will not be put in any position where they may fall ill. The film production company has been very cooperative and has suspended filming until further notice. All of the dogs in the production now have been checked and are being cared for by a veterinarian. We will continue to monitor the production and release our findings once the investigation is complete\n\nFollow this link to read more of this press release.", "images": ["http://ox.mequoda.com/openx/www/delivery/avw.php?zoneid=1054&cb=1318302402&n=a188d9c5", "http://ox.mequoda.com/openx/www/delivery/avw.php?zoneid=913&cb=622095235&n=a417ef24", "https://www.dogster.com/wp-content/uploads/2020/04/Bulldog-Sneeze_getty148448151-160x106.png", "https://www.dogster.com/wp-content/themes/dogster/assets/images/icons/icon-comment-gry.png", "https://www.dogster.com/wp-content/themes/dogster/assets/images/logos/logo_dogster_r.png", "http://ox.mequoda.com/openx/www/delivery/avw.php?zoneid=919&cb=1163133393&n=a2ba4905", "http://ox.mequoda.com/openx/www/delivery/avw.php?zoneid=921&cb=355829450&n=ac616cfa", "http://ox.mequoda.com/openx/www/delivery/avw.php?zoneid=920&cb=1074158667&n=aa7bb1c6", "http://dogblog.dogster.com/uploads/2008/02/nika.jpg", "http://ox.mequoda.com/openx/www/delivery/avw.php?zoneid=1088&cb=1702524528&n=a13e0819", "https://www.dogster.com/wp-content/uploads/2019/11/French-Bulldog_pink_getty667734132-160x106.png", "https://www.dogster.com/wp-content/uploads/2018/04/Older-dog-limping-as-other-dog-looks-on-160x106.jpg", "https://www.dogster.com/wp-content/uploads/2020/04/2004_Wet-Dog_HHildreth-160x106.png", "http://ox.mequoda.com/openx/www/delivery/avw.php?zoneid=hide&cb=1373848166&n=a417ef24"], "top_img": "http://dogblog.dogster.com/uploads/2008/02/nika.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.dogster.com/lifestyle/snow-buddies-not-much-fun-for-puppies-who-died-in-filming", "title": "Snow Buddies Not Much Fun for Puppies Who Died in Filming", "meta_data": {"viewport": "width=device-width", "description": "Did these dogs come from a puppy mill? That's the first thing that came to my mind when I read this release from the American...", "og": {"locale": "en_US", "type": "article", "title": "Snow Buddies Not Much Fun for Puppies Who Died in Filming", "description": "Did these dogs come from a puppy mill? That's the first thing that came to my mind when I read this release from the American...", "url": "https://www.dogster.com/lifestyle/snow-buddies-not-much-fun-for-puppies-who-died-in-filming", "site_name": "Dogster", "image": "http://dogblog.dogster.com/uploads/2008/02/nika.jpg"}, "article": {"tag": "Dogs in Art", "section": "Lifestyle", "published_time": "2008-02-18T14:35:29+00:00"}, "twitter": {"card": "summary", "description": "Did these dogs come from a puppy mill? That's the first thing that came to my mind when I read this release from the American...", "title": "Snow Buddies Not Much Fun for Puppies Who Died in Filming", "image": "http://dogblog.dogster.com/uploads/2008/02/nika.jpg", "site": "Dogster", "url": "https://www.dogster.com/lifestyle/snow-buddies-not-much-fun-for-puppies-who-died-in-filming", "creator": "Joy"}, "fb": {"page_id": 19882}, "author": "Joy", "parsely-page": "{\"title\": \"Snow Buddies Not Much Fun for Puppies Who Died in Filming\",\n                \"link\": \"https://www.dogster.com/lifestyle/snow-buddies-not-much-fun-for-puppies-who-died-in-filming\",\n                \"image_url\": \"\",\n                \"type\": \"post\",\t\"post_id\": \"19882\",\n                \"pub_date\": \"2008-02-18T14:35:29-04:00\",\n                \"section\": \"Lifestyle\",\n                \"author\": \"Joy\",\"tags\": [\"Celebrities\", \"Dogs in Art\", ]}", "ahrefs-site-verification": "07bedd986021945ae4ebc37c4f1e5b7ab310eaf23bfcda9098dc762928fa92e4”>\n\n</head>\n<body class="}, "movies": [], "publish_date": 1203345329.0, "source": "https://www.dogster.com", "summary": ""}