{"url": "https://www.liveabout.com/tips-for-tailoring-your-jeans-2040402", "text": "We'll also tell you what you can expect when you take your jeans to a tailor or seamstress, to prevent surprises. Plus, find out when it's better to buy a new pair of jeans, instead of spending your money trying to alter a too-challenging pair.\n\nWe've created this practical, money-saving guide to everything you need to know about jeans alterations. You'll learn what is possible to have tailored, how to hem jeans so they flatter your shape perfectly, and the one thing you should always do before taking your jeans for alterations.\n\nMany women have no hesitation about taking a pair of wool trousers to the tailor for alterations, in order to get a customized fit. So why do most of us expect to find jeans that fit us perfectly off the rack, with no nips and tucks required? While it's important to shop for jeans that generally fit your figure well — especially in certain, hard-to-alter areas, such as around the hips — there's plenty you can do to customize an almost-perfect pair of denim, and create a made to measure look, in jeans.\n\nYou'll be surprised at how doing so can make a pair of almost-perfect jeans conform better to your body, and create a made to measure jeans look.\n\nHowever, many other fit issues — including a too-long length, a pair of jeans that gaps slightly at the waist, or overly baggy legs — can be addressed by taking them to a tailor to take in (or remove) excess fabric.\n\nIf jeans sit too high or low on the waist, don't cling to your hips (or squeeze you too tightly), or don't fit properly at the crotch, it's best to leave that pair on the rack and keep shopping for a generally better-fitting pair.\n\nWhen you shop for jeans , it's great to know you can have them tailored if they don't fit perfectly. Just a word of caution, though — there are some things it's not easy, or worth your money, to have altered when it comes to denim.\n\nKnow what you can tailor in a pair of jeans - and what you can't.\n\n02 of 06\n\nAdjusting the Length\n\nHem your jeans for a clean finish and the perfect length. Kirstin Sinclair/Getty Images\n\nShortening too-long jeans (aka hemming jeans) is generally the easiest alteration you can make to denim pants. A tailor or seamstress can shorten or hem jeans, either by cutting off some fabric and redoing the hems, or by taking up the hems in a way that doesn't involve cutting the fabric.\n\nHere's how to ask for either treatment, to get the best results:\n\nCutting Jeans Shorter — The Original Hem Method\n\nYou'll try on your jeans at the alterations shop, so the tailor can mark the correct length with chalk or pins. Be sure to bring or wear the shoes you'll wear most often with the jeans, so you can get the right length.\n\nYou can ask your tailor to give you an \"original hem\" (also called a \"European hem\"), which involves removing the original hems of the jeans and re-attaching them after the excess fabric is cut from the legs. While this can add cost to your alterations, this will ensure your jean hems look right — and can be much less difficult than having a tailor reproduce the right thread, stitching method, original spacing between the stitches, and so on.\n\nIf you have invested in designer jeans, which are often recognizable by the unique fading or stitching on their hems, you will definitely want to hem your jeans using this method.\n\nTalk to your tailor if you're looking to hem jeans by more than an inch or two, about whether they'll need to change the leg shape, which can be a complicating factor when it comes to bootcut or flare jeans styles. As well, if your jeans are faded or distressed, they'll need to be cut at a place that doesn't look wrong with the styling.\n\nTaking Up Jeans — The Inside Hem Method", "images": ["https://www.liveabout.com/thmb/U3Dwc0ADZnTGXQAHNqwHJgIRKHU=/2048x2048/filters:fill(auto,1)/LiveAboutDefaultShareImage-67fc6776ae1049f28fed94e0577b2f81.png", "https://www.liveabout.com/thmb/YJVqj-IQ5Tis_F6KVcT77J8UPdE=/220x0/filters:no_upscale():max_bytes(150000):strip_icc()/Entertainment2x-e9b58da51da149bfae92f0c38fed6aad.png", "https://www.liveabout.com/thmb/8Mvn8a6Hkc7LE0LvGcbvaM0s0QM=/768x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-image-source-5957bac83df78c4eb6d5f03a.jpg", "https://:0"], "top_img": "https://www.liveabout.com/thmb/U3Dwc0ADZnTGXQAHNqwHJgIRKHU=/2048x2048/filters:fill(auto,1)/LiveAboutDefaultShareImage-67fc6776ae1049f28fed94e0577b2f81.png", "keywords": [], "authors": ["Catherine Jacobs"], "canonical_link": "https://www.liveabout.com/tips-for-tailoring-your-jeans-2040402", "title": "6 Tips for Tailoring Jeans For a Perfect Fit", "meta_data": {"robots": "NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Are you on a mission to find those perfect-fitting jeans? Check out our essential guide to jeans alterations, so you get a made to measure jeans fit.", "emailcontenttype": "LISTSC", "emailvertical": "LIVEABOUT", "sailthru.author": "Catherine Jacobs", "sailthru.tags": "entertainment,fashion-and-style,jeans", "article": {"section": "LiveAbout"}, "fb": {"app_id": 233430483833280}, "og": {"type": "article", "site_name": "LiveAbout", "url": "https://www.liveabout.com/tips-for-tailoring-your-jeans-2040402", "title": "Want Perfect Fitting Jeans? Here's How Jeans Alterations Work", "description": "Are you on a mission to find those perfect-fitting jeans? Check out our essential guide to jeans alterations, so you get a made to measure jeans fit.", "image": "https://www.liveabout.com/thmb/U3Dwc0ADZnTGXQAHNqwHJgIRKHU=/2048x2048/filters:fill(auto,1)/LiveAboutDefaultShareImage-67fc6776ae1049f28fed94e0577b2f81.png"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/3.16.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/3.16.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/3.16.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/3.16.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/3.16.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://www.liveabout.com", "summary": ""}