{"url": "https://www.elle.com/culture/celebrities/a20886044/prince-harry-ex-chelsy-davy-final-phone-call-before-royal-wedding-report/", "text": "Both Prince Harry's major exes, Cressida Bonas and Chelsy Davy, attended his royal wedding to Meghan Markle last weekend. But days before the actual ceremony, Harry and Davy had a final, emotional phone call, Vanity Fair reports. Davy was Harry's most serious girlfriend before Markle; they dated on and off for seven years, from 2004 to 2011. As recently as September 2015, The Sun and other outlets were reporting Harry still had feelings for her and that the two tried to make their relationship work again in summer 2015. They had \"one last hurrah\" in Africa, and their time there was kept secret from the press. Ultimately, they split because Davy didn't want to lead such a public life.\n\nDavy was not invited to the second, more intimate reception, and she practically didn't even go to the wedding at all after her call with Harry, a family friend told Vanity Fair. “It was their final call, a parting call in which they both acknowledged Harry was moving on,\" the source said. \"Chelsy was quite emotional about it all, she was in tears and almost didn’t go to the wedding. In the end, she went and promised Harry she wouldn’t try and gatecrash the party.”\n\nSo Davy went to the ceremony, and during the broadcast of it, the internet noticed and memed her expressions:\n\nBut the history between these two is emotional. In September 2015, a source told The Sun: “Harry still holds a candle for her. Chelsy has his heart. They saw each other recently. There’s still very much something between them, but Chelsy won’t commit yet because she doesn’t want to lead a life in the spotlight. Harry’s very sensitive to that.”\n\nTogether on May 7, 2010 Getty Images\n\nAnd royal reporter and Prince Harry biographer Katie Nicholl echoed this to InStyle ahead of the royal wedding: “You sort of get the feeling that neither of them were quite ever willing to completely let go of that love affair. They’d carved their names into one of the tree trunks on the family estate. It was such a love affair, it really was. Right up until 2015 they were trying to give it another chance. I was quite struck by that and I think everyone that’s been in love, you know, you never forget your first love, and in that respect I think Prince Harry was no different. And I think what’s so lovely is he still manages to have a friendship with Chelsy, and there’s that amazing respect between the two of them. Neither of them have spoken about their relationship and I think you have to respect and admire them for that.”\n\nAt a rugby match together on November 22, 2008. Getty Images\n\nGetty Images\n\nAccording to The Sun, Davy and Harry met in Cape Town during Harry's gap year; Davy studied law then and ended up going to Leeds University so she could be closer to him. She attended several events with Harry, including Prince Charles' 60th birthday. She met the Queen at a wedding and was also invited to his brother Prince William and Kate Middleton's wedding despite she and Harry not dating at the time. Vanity Fair reports that Harry thought inviting Davy and Bonas to his wedding was the \"right thing to do,\" a pal told the outlet—despite and because of their past.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/chelsy-prince-harry-1527094246.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/chelsy-prince-harry-1527094246.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "keywords": [], "authors": ["Alyssa Bailey", "News", "Strategy Editor", "Alyssa Bailey Is The News", "Strategy Editor At Elle.Com", "Where She Oversees Coverage Of Celebrities", "Royals", "Particularly Meghan Markle", "Kate Middleton ."], "canonical_link": "https://www.elle.com/culture/celebrities/a20886044/prince-harry-ex-chelsy-davy-final-phone-call-before-royal-wedding-report/", "title": "Prince Harry and His Ex Chelsy Davy Reportedly Had a Tearful Final Phone Call Before the Royal Wedding", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "ELLE", "title": "Prince Harry and His Ex Chelsy Davy Had a Tearful Final Phone Call Before the Royal Wedding", "description": "\"Chelsy was quite emotional about it all...\"", "url": "https://www.elle.com/culture/celebrities/a20886044/prince-harry-ex-chelsy-davy-final-phone-call-before-royal-wedding-report/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/chelsy-prince-harry-1527094246.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "modified_time": "2018-05-23 04:57:20", "published_time": "2018-05-23 04:57:00", "section": "Celebrity News 2020", "opinion": "false"}, "twitter": {"site": "@ELLEmagazine", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/chelsy-prince-harry-1527094246.jpg?crop=1.00xw:1.00xh;0,0&resize=640:*"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "title": "Prince Harry and His Ex Chelsy Davy Reportedly Had a Tearful Final Phone Call Before the Royal Wedding", "description": "​Both Prince Harry's major exes, Cressida Bonas and Chelsy Davy​, attended his royal wedding to Meghan Markle last weekend. ​But days before the actual ceremony, Harry and Davy had a final, emotional phone call, Vanity Fair​ reports.", "keywords": "chelsy davy, chelsy davy prince harry, chelsy davy prince harry final phone call, chelsy davy reception snub, prince harry, prince harry ex girlfriend, royal wedding", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/chelsy-prince-harry-1527094246.jpg?crop=0.502xw:1.00xh;0.498xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Culture,culture,celebrities,chelsy davy prince harry final phone call,chelsy davy reception snub,chelsy davy prince harry,prince harry ex girlfriend,chelsy davy,Prince Harry,royal wedding", "sailthru.date": "2018-05-23T16:57:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/chelsy-prince-harry-1527094246.jpg?crop=1.00xw:1.00xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/chelsy-prince-harry-1527094246.jpg?crop=0.502xw:1.00xh;0.498xw,0", "sailthru.socialtitle": "Prince Harry and His Ex Chelsy Davy Had a Tearful Final Phone Call Before the Royal Wedding", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1527022620.0, "source": "https://www.elle.com", "summary": ""}