{"url": "https://www.cheatsheet.com/entertainment/bachelor-in-paradise-the-1-thing-corinne-olympios-wants-you-to-know-about-her-friendship-with-demario-jackson.html/", "text": "Bachelor Nation was taken by surprise when Corinne Olympios and DeMario Jackson publicly reconciled during the studio taping of Bachelor in Paradise. The two hadn’t spoken to each other prior to this interview, so we really didn’t know what to expect.\n\nWhat we did know at the time was that filming halted earlier in Season 4 of Paradise, due to a potentially nonconsensual encounter between Olympios and Jackson. After thorough investigation, Warner Bros. deemed Jackson clear of any misconduct. Many cast members came out in support of both parties involved, but Olympios and Jackson both voiced their difficulties in moving on from the controversy.\n\nWe’re happy to see that Olympios and Jackson seem to be helping each other get back to normal life, as the two have formed a new friendship. Unsurprisingly, their time spent together has sparked numerous rumors and backlash. Olympios wants to set the record straight on the details on their friendship and, most importantly, wants everyone to “get over it.”\n\nThey were photographed in Disneyland together\n\nDeMario Jackson and Corinne Olympios were spotted together recently. | ABC DeMario Jackson and Corinne Olympios were spotted together recently. | ABC\n\nThe rumors started when Olympios and Jackson were seen spending time together in Disneyland in September 2017. The two were holding hands and smiling while walking around the park, clearly trying to put their controversy behind them.\n\nThey had to have expected an outburst of attention, but Olympios wasn’t too happy with some of the assumptions being made.\n\nThey aren’t dating\n\nCorinne Olympios set the rumors straight. | Giphy Corinne Olympios set the rumors straight. | Giphy\n\nYou better believe that if you spread false information about Olympios, she’ll have something to say about it. TMZ published a story about their time at Disneyland, claiming Olympios and Jackson were hooking up. Olympios quickly took to Instagram live to shut those rumors down.\n\nOlympios started off her venting session by noting, “I have something to say about this TMZ story. To those photographers following me around Disney yesterday, you can go f*ck yourselves.” She asserted, “DeMario and I had a tough summer so leave us the f*ck alone. You guys are f*cking assh*les. We’re friends, so get over it.”\n\nShe also sat down with ET to officially set the record straight. Even though she and Jackson were seen holding hands, she stated, “DeMario and I are close friends. We are not dating. We were hanging out with a group at Disneyland, and I have no problem holding hands with any of my friends.”\n\nJackson has come out about their friendship, too\n\nDeMario Jackson has spoken about his friendship with Corinne Olympios. | E! News DeMario Jackson has spoken about his friendship with Corinne Olympios. | E! News\n\nJackson is clearly on the same page, as he’s also been spreading the message that they’re just friends.\n\nHe’s had nothing but good things to say about Olympios, including, “I have the utmost respect for her, nothing but love for her. She’s back home right now and next week we’re going out, we’re having fun. She’s my homie, straight-up homie.”\n\nTheir friendship is real\n\nCorinne Olympios and DeMario Jackson have defended their friendship. | ABC Corinne Olympios and DeMario Jackson have defended their friendship. | ABC\n\nAnother rumor has been circulating around their friendship, indicating that it’s all for show. Some just can’t seem to deal with a controversy having a happy ending, so Jackson addressed those speculations while speaking to reporters at Amber Rose’s third annual SlutWalk.\n\nJackson expressed, “It was one of those things that people want us not to be friends. They want to paint a particular narrative. Even now the narrative is they’re friends now. It’s like, ‘Oh, it’s fake.’ It’s always you’re damned if you do, you’re damned if you don’t.”\n\nThis isn’t the first time they’ve hung out as friends\n\nCorinne Olympios and DeMario Jackson have hung out several times post-scandal. | Jerod Harris/Getty Images Corinne Olympios and DeMario Jackson have hung out several times post-scandal. | Jerod Harris/Getty Images\n\nIt’s no surprise that Olympios and Jackson have formed a tight bond. Even though they didn’t speak to one another until their interview on Paradise, they went through this scandal together. On Aug. 31, 2017, only two days after their reconciliation aired, photographers captured them at at SBE’s Nightingale Plaza in Los Angeles. They were all smiles, and Olympios even gave Jackson a friendly kiss on the cheek.\n\nAfter their first spotting, Olympios told ET, “We’re friends. We’re hanging out. He picked me up from the airport, we went to dinner. We’re cool. Really cool.”\n\nThey were seen again in Hollywood on Sept. 20, but this time for dinner at TAO. Outside of the restaurant, photographers asked if Olympios and Jackson were dating. Olympios’ response? “We’re friends.”\n\nShe never blamed Jackson for the controversy\n\nEven during their initial reunion, Olympios claimed they “never had bad blood.” This didn’t necessarily seem true when Olympios released a statement during the time of the scandal, which stated, “I am a victim.”\n\nOlympios has since clarified her message, in that she was not a victim of Jackson, but rather a victim of the media. She stated, “I strongly believe he had no bad intentions at all. It was all good. It was unfortunate that no one really knew how intoxicated I actually was at the time. I believe that nobody knew that. It was nobody’s fault.”\n\nOlympios apologized to Jackson\n\nOlympios and Jackson both expressed their hardships in dealing with this controversy. Prior to talking one-on-one with Jackson, Olympios sincerely apologized to Jackson during her Paradise interview.\n\n“I would want to tell him, like listen, I respect you as a human,” she claimed when asked what she would want to say to Jackson. “I have nothing against you. I am so sorry you had to go through this. I know exactly what it feels like … and I wish you all the best and I’m sorry.”\n\nRachel Lindsay isn’t happy about her Bachelor costars befriending Jackson\n\nThese Bachelor friendships are fickle and fleeting…#loyalty — Rachel Lindsay (@TheRachLindsay) September 2, 2017\n\nThough a number of Bachelor cast members stood by Jackson, Rachel Lindsay clearly isn’t too happy about people befriending him. Jackson was a contestant on Lindsay’s season of The Bachelorette, but that all came to an end when it was revealed he was secretly in a relationship with another woman.\n\nLindsay tweeted, “These Bachelor friendships are fickle and fleeting…#loyalty.” She’s seemingly referring to her fellow cast members from Nick Viall’s season of The Bachelor, including Raven Gates, Kristina Schulman, and Whitney Fransway. Gates had posted a photo of the three friends on Instagram, tagging themselves at Avenue Los Angeles. Jackson posted a photo at the same bar with Paradise’s Dean Unglert and Adam Gottschalk, so they were likely all hanging out together.\n\nJackson wrote in response, “Someone said, ‘These bachelor friendships are fickle and fleeting’ and I disagree. These bachelor friendships got me through a dark time and I’m grateful for my brothers, sisters, and bachelor nation.”\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2017/10/corinne-demario-825x580.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/10/Corinne-O-posing-with-one-arm-on-her-hip-640x462.jpg?x62514", "https://media.giphy.com/media/3o84TPtbhMHMM9AeMU/giphy.gif", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2017/05/demariojacksonlaughing-640x300.png?x62514", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2017/05/demariojacksonlaughing-640x300.png", "https://www.cheatsheet.com/wp-content/uploads/2017/10/demario-jackson1.jpg?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2017/05/demariojacksonlaughing-640x300.png", "keywords": [], "authors": ["Chelsea Leary"], "canonical_link": "https://www.cheatsheet.com/entertainment/bachelor-in-paradise-the-1-thing-corinne-olympios-wants-you-to-know-about-her-friendship-with-demario-jackson.html/", "title": "‘Bachelor in Paradise’: The 1 Thing Corinne Olympios Wants You to Know About Her Friendship With DeMario Jackson", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/entertainment/bachelor-in-paradise-the-1-thing-corinne-olympios-wants-you-to-know-about-her-friendship-with-demario-jackson.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "Corinne Olympios and DeMario Jackson have been spotted together after their scandal. Olympios wants to set the record straight about their friendship.", "og": {"locale": "en_US", "type": "article", "title": "‘Bachelor in Paradise’: The 1 Thing Corinne Olympios Wants You to Know About Her Friendship With DeMario Jackson", "description": "Corinne Olympios and DeMario Jackson have been spotted together after their scandal. Olympios wants to set the record straight about their friendship.", "url": "https://www.cheatsheet.com/entertainment/bachelor-in-paradise-the-1-thing-corinne-olympios-wants-you-to-know-about-her-friendship-with-demario-jackson.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2017-12-08T21:41:11-05:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2017/05/demariojacksonlaughing-640x300.png", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2017/05/demariojacksonlaughing-640x300.png"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "scandal", "section": "Entertainment", "published_time": "2017-12-08T21:41:00-05:00", "modified_time": "2017-12-08T21:41:11-05:00"}, "twitter": {"card": "summary_large_image", "description": "Corinne Olympios and DeMario Jackson have been spotted together after their scandal. Olympios wants to set the record straight about their friendship.", "title": "‘Bachelor in Paradise’: The 1 Thing Corinne Olympios Wants You to Know About Her Friendship With DeMario Jackson", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2017/05/demariojacksonlaughing-640x300.png", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": ["https://www.youtube.com/embed/RW0_4NjjmEQ?feature=oembed", "https://www.youtube.com/embed/ktSZ2xv3s1s?feature=oembed"], "publish_date": 1512787260.0, "source": "https://www.cheatsheet.com", "summary": ""}