{"url": "https://en.wikipedia.org/wiki/Super_Bowl_commercials", "text": "The U.S. television broadcast of the Super Bowl – the championship game of the National Football League (NFL) – features many high-profile television commercials, colloquially known as Super Bowl ads. The phenomenon is a result of the game's extremely high viewership and wide demographics: Super Bowl games have frequently been among the United States' most-watched television broadcasts, with Nielsen having estimated that Super Bowl XLIX in 2015 was seen by at least 114.4 million viewers in the United States, surpassing the previous year's Super Bowl as the highest-rated television broadcast in U.S. history. As such, advertisers have typically used commercials during the Super Bowl as a means of building awareness for their products and services among this wide audience, while also trying to generate buzz around the ads themselves so they may receive additional exposure, such as becoming a viral video. Some commercials airing during, or proposed to air during the game, have attracted controversy due to the nature of their content.\n\nSuper Bowl commercials have become a cultural phenomenon of their own alongside the game itself; many viewers only watch the game to see the commercials,[3] national surveys (such as the USA Today Super Bowl Ad Meter) judge which advertisement carried the best viewer response, and CBS has aired yearly specials since 2000 chronicling notable commercials from the game. Super Bowl advertisements have become iconic and well known because of their cinematographic quality, unpredictability, surreal humor, and use of special effects. The use of celebrity cameos has also been common in Super Bowl ads. Several major brands, including Budweiser, Coca-Cola, Doritos, GoDaddy, Master Lock, and Tide have been well known for making repeated appearances during the Super Bowl.\n\nThe prominence of airing a commercial during the Super Bowl has carried an increasingly high price. The average cost of a 30-second commercial during the Super Bowl has ranged from $37,500 at Super Bowl I to around $2.2 million at Super Bowl XXXIV in 2000. By Super Bowl XLIX in 2015, the cost had doubled to around $4.5 million,[4] and by Super Bowl LIV in 2020, the cost had reached $5.6 million for a 30-second slot.[5]\n\nSuper Bowl commercials are largely limited to the United States' broadcast of the game. Complaints about the inability to view the ads are prevalent in Canada, where federal \"simsub\" regulations require pay television providers to replace feeds of programs from U.S. broadcast stations with domestic feeds if they are being broadcast at the same time as a Canadian broadcast station. In 2016, the CRTC, Canada's telecom regulator, enacted a policy from 2017 to 2019 to forbid the use of simsub during the Super Bowl, citing viewer complaints and a belief that these ads were an \"integral part\" of the game; Super Bowl LI was the first game to fall under this policy. The NFL's Canadian rightsholder Bell Media challenged the policy at the federal appeals court, arguing that it violated the Broadcasting Act by singling out a specific program for regulation and devalued its broadcast rights to the game. While the appeals court sided with the CRTC, the Supreme Court of Canada overturned the ruling in December 2019 as a violation of the Broadcasting Act.[6]\n\nBenefits [ edit ]\n\nSuper Bowl games have frequently been among the United States' most watched television broadcasts; Super Bowl XLIX in 2015 set an all-time record for viewership at the game, with an average of 114.4 million viewers according to Nielsen, exceeding a record set the previous year at Super Bowl XLVIII (112.2 million). Of the top twenty television broadcasts in the United States by viewership, only one program—\"Goodbye, Farewell and Amen\", the 1983 series finale of M*A*S*H—was not a Super Bowl, ranking in between Super Bowl XLIII (98.7 million) and XLIV (106.6 million) with 106 million viewers.[7][8][9][10] The game broadcast not only attracts a wide audience, but a diverse audience spanning many demographics and age groups, and women have accounted for at least 40% of Super Bowl viewers. As such, airing a commercial during the Super Bowl can be valuable for advertisers seeking an audience for their products and services.[11][12]\n\nBecause of the overall buzz surrounding them, commercials aired during the Super Bowl receive additional airplay and exposure outside of the game as well, such as during newscasts and morning shows.[3][13] Since 2000, CBS has aired an annual television special prior to the game, Super Bowl’s Greatest Commercials, which showcases notable Super Bowl ads from prior games, and in recent years, has allowed viewers to vote for their favorite Super Bowl ads to be featured during it.[14][15] Many viewers watch the Super Bowl only for the commercials: in 2015, Dish Network went as far as allowing the \"Primetime Anytime\" and \"AutoHop\" features on its Hopper digital video recorder, which automatically records primetime programs from the major networks and trims commercials from the recordings, to function in reverse and allow users to view a recording of the Super Bowl that skips over the game itself and only shows the commercials.[16]\n\nThe popularity of video sharing websites such as YouTube have also allowed Super Bowl advertisements to become viral videos;[3] to take advantage of this, a growing number of advertisers have elected to post previews of their commercial, or even the full-length commercial, online prior to the game.[17] A notable example of this strategy occurred at Super Bowl XLV: on February 2, 2011, four days prior to the game, Volkswagen posted the full version of its Star Wars-themed ad \"The Force\" on YouTube. By Sunday, the ad had already received over 16 million views, and went on to be the most shared Super Bowl advertisement ever.[13][17] Ironically, until Super Bowl 50, official online streams of the Super Bowl provided by U.S. broadcasters did not include all of the commercials from the television broadcast; at Super Bowl XLIX, only 18 advertisers bought ad time within NBC's stream of the game (although NBC did post all of the ads on a Tumblr blog throughout the game).[18] At Super Bowl 50, CBS mandated that each advertiser's purchase cover both the television and digital broadcasts, meaning that for the first time, the online stream of Super Bowl 50 provided by CBS included all national commercials from the television broadcast.[19]\n\nCost [ edit ]\n\nOwing to the large potential audience, the network broadcasting the Super Bowl can also charge a premium on advertising time during the game. A thirty-second commercial at Super Bowl I in 1967 cost US$37,500.[20] By contrast, Super Bowl XLVI set what was then a record for the price of a Super Bowl advertisement, selling 58 spots (including those longer than 30 seconds) during the game, generating $75 million USD for NBC; the most expensive advertisement sold for $5.84 million.[21] Super Bowl XLVII and Super Bowl XLVIII both set the average cost of a 30-second commercial at $4 million.[11][22] Super Bowl XLIX, also broadcast by NBC, surpassed that record with a base price of $4.5 million.[23]\n\nMedia executives projected that the cost of a 30-second commercial could exceed $5 million at Super Bowl 50,[24] a figure that CBS confirmed.[25] That price would serve as a plateau for all three Super Bowls held since then; Fox would match that figure for Super Bowl LI,[26] NBC would slightly exceed for Super Bowl LII[27] with a $5.2 million price tag,[28] and CBS would slightly increase that to $5.25 million for Super Bowl LIII.[28][29] Super Bowl LIV will bring a substantial increase to $5.6 million per advertisement.[30] Super Bowl LI would also, for the first time in the game's history, feature overtime play; four ads were broadcast between the end of regulation and the start of play, including two ads seen earlier in the game, and two ads that were sold for and also seen during the post-game show. While Fox had negotiated ad sales for overtime in the event it were to occur, it is unknown whether the network charged a premium on top of the base cost.[31] In comparison, Sunday Night Football, the flagship primetime game during the regular season, had an average cost of around $700,000 for 30 seconds of time in 2017.[32] The average cost of a 30-second ad during the Super Bowl increased by 87% between 2008 and 2016,[33] before stabilizing since then.[34] Slightly fewer spots were sold for Super Bowl LIII than the previous game, leading to a noted increase in the number of ads aired for network programming (from CBS and CBS All Access in this case) in comparison.[35] Fox was reported to have charged around $5 to $5.6 million for 30 seconds of commercial time at Super Bowl LIV.[36]\n\nThe high cost of purchasing advertising time, on top of the cost of producing the commercial itself, has led to concerns by marketers that the increased sales that can result from a Super Bowl commercial does not recoup the cost of buying the ad time. In the early 2010s, advertisers such as Dr. Pepper Snapple Group, General Motors and Pepsi chose to skip the Super Bowl due to the high costs of advertising—although Pepsi would return in 2013, followed by GM in 2014. As a lower-cost alternative, some advertisers have elected to purchase advertising time during the games' extended pre-game shows (which, during Super Bowl XLVIII, ranged from $100,000 to $2 million), or from individual network affiliates that are broadcasting it.[11][37][38]\n\nAs the 2018 Winter Olympics marked the first time since 1992 that the Winter Olympics and Super Bowl were shown by the same network in a single year, NBC offered advertisers the opportunity to purchase packages of time for their ads covering both Super Bowl LII and the Olympics. NBC stated that doing so would allow advertisers to amortize their expenses through additional airplay during the Olympics.[39]\n\nNotable Super Bowl commercials [ edit ]\n\nMany Super Bowl advertisements have become iconic and well known because of their quality, unpredictability, humor, and use of special effects. In recent years, advertisers have also attempted to stand out from others by producing ads with cinematographic qualities, and ads that channel emotions and real-world issues.[1][40][41] The use of celebrity cameos has also been common in Super Bowl ads, ranging from then-unknown personalities to unexpected combinations of celebrities, such as a 2007 CBS network promo for Late Show that featured David Letterman and Oprah Winfrey—whom Letterman had conflicts with following a joke directed at her during the 67th Academy Awards, and a 2010 sequel that also included Jay Leno (who was slated to return to its competitor, The Tonight Show, following a publicized conflict between NBC and Conan O'Brien).[40][42]\n\nA number of brands, including Budweiser, Coca-Cola, and Master Lock, have been well known for their frequent appearances as advertisers during the Super Bowl.[40][41][43]\n\nEarly advertising [ edit ]\n\nSeveral notable commercials aired during Super Bowl games during the 1970s. In a commercial during Super Bowl IV in 1970, Chicago Bears linebacker Dick Butkus endorsed Prestone, a brand of antifreeze, stating the tagline, \"Because plugging holes is my business.\" The ad marked the first highly successful celebrity endorsement in Super Bowl advertising.[44] In 1973, lotion brand Noxzema aired a commercial starring Farrah Fawcett and quarterback Joe Namath, featuring Namath being literally \"creamed\" by Fawcett. Later in the decade, Fawcett would become better known for her role on the television series Charlie's Angels.[42]\n\nAt Super Bowl XI in 1977, Xerox aired an advertisement entitled \"Monks\"; starring Jack Eagle as Brother Dominic—a monk discovering that he could create copies of a manuscript using a new Xerox photocopier. Y&R New York's CEO Leslie Sims described \"Monks\" as being the \"first viral ad\", explaining that it \"was the first commercial that got people to request to see it again on TV\". To mark its 40th anniversary, a remake of the \"Monks\" ad premiered in January 2017 (although not as a Super Bowl ad), which updated its premise to feature the company's modern product line.[46]\n\nMaster Lock: \"Tough Under Fire\" [ edit ]\n\nAmong the most prominent of campaigns during early Super Bowl games were those of Master Lock. In 1965, the company had first run a television commercial demonstrating the strength of its padlocks, by having a person shoot it with a handgun in a failed attempt to breach it. The campaign was pulled after the company's advertising director, Edson F. Allen, realized the stunt could be imitated by those who were unsure of the commercial's authenticity. By the 1970s, Allen discussed the possibility of reviving the concept, but using a rifle rather than a handgun to make it harder to imitate. The resulting commercial would premiere in 1974 during Super Bowl VIII; despite concerns by the staff of Master Lock and their agency, Campbell Mithun, over the content of the ad, the commercial was well received by the general public.[43][47][48]\n\nWhen Cramer-Krasselt took over as Master Lock's agency later in the year, the company decided to make the gun ads a tradition, and began to produce new ads themed around the concept (including one featuring skeptics of previous editions of the ad, and one showcasing the company's major corporate clients) for future Super Bowls during the subsequent decades (aside from a brief hiatus in 1986 and 1987), and the early 1990s. Allen went as far as describing the ads as an \"event\" that continued to attract media attention after the game. The Super Bowl ads helped improve Master Lock's market share; from 1973 through 1994, sales had increased from $35 million per year to $200 million per year. Master Lock's yearly Super Bowl commercials accounted for nearly all of the company's annual advertising budget.[43][47][49][50]\n\nAt Super Bowl XIV in 1980, Coca-Cola aired an advertisement popularly known as \"Hey Kid, Catch!\", featuring Pittsburgh Steelers All-Pro defensive lineman \"Mean Joe\" Greene being offered a Coca-Cola by a young fan—played by Tommy Okon,[51] drinking it in one sip, and tossing the kid his game-worn jersey as repayment. The advertisement was filmed in 1979 and premiered that October, but did not gain mainstream attention until its airing during Super Bowl XIV. \"Hey Kid, Catch!\" became one of Greene's most famous roles; the ad would win a Clio Award, spawn a made-for-TV movie on NBC entitled The Steeler and the Pittsburgh Kid, and be re-made for other markets with local athletes. In a 2011 poll by Advertising Age, readers named \"Hey Kid, Catch!\" as the best Super Bowl commercial of all-time.[52]\n\nThe ad also became the subject of parodies on television series, such as The Simpsons, and in other ads. At Super Bowl XLIII in 2009, Coca-Cola aired a parody of the ad for its Coca-Cola Zero brand starring Steelers safety Troy Polamalu. Continuing an ongoing theme in the promotion of Coke Zero, the ad was interrupted by a Coca-Cola \"brand manager\" accusing Polamalu of \"stealing\" their commercial; in response, Polamalu tackled him and ripped off his shirt to give to the child.[53][54] In 2012, Procter & Gamble aired a parody of the ad entitled \"Stinky\". The ad saw Greene reprise his role, but having the young fan throw Downy Unstoppables fabric softener to Greene instead of Coca-Cola, and the fan rejecting his jersey because it smelled.[55] In 2016, Joe Greene was reunited with Okon as part of a segment for CBS's Super Bowl's Greatest Commercials special.[51]\n\nCoca-Cola has also used the Super Bowl for other campaigns: in 2009, the company aired new ads as part of its recently introduced Open Happiness campaign.[54] In 2014, the company aired the multiculturalism-themed ad \"It's Beautiful\", which featured scenes of Americans of various races and ethnicities, including the first ever same-sex couple featured in a Super Bowl commercial. However, the ad attracted controversy due to its use of a multilingual rendition of \"America the Beautiful\" as its soundtrack.[56][57] In 2015, the company aired ad entitled \"#makeithappy\"; themed around cyberbullying, the ad featured negative comments directed towards a teen being transformed into positive messages after a technician accidentally spills a bottle of Coca-Cola on a server.[41]\n\n\"1984\", an ad for the Macintosh computer (pictured), has been widely considered the best Super Bowl ad of all-time.\n\nAt Super Bowl XVIII, Apple Computer broadcast an advertisement for its Macintosh computer entitled \"1984\", created by the agency Chiat/Day and directed by Ridley Scott. The advertisement, which incorporated elements inspired by the novel Nineteen Eighty-Four, featured a woman wearing track-and-field clothing (including orange pants and a white shirt branded with an image of the Macintosh) sprinting into a large auditorium and hurling a large hammer into a screen (displaying a large Big Brother-like figure speaking to a massive assembly of drone-like people in the audience), concluding with the message \"On January 24, Apple Computer will introduce Macintosh. And you'll see why 1984 won’t be like '1984.'\" The advertisement received critical acclaim from both viewers and critics alike for helping position the Macintosh as a unique entry into the personal computer market, and is often considered to be one of the best Super Bowl advertisements of all-time.[58][59][60]\n\nThe ad first aired nationally during Super Bowl XVIII. As the agency wanted \"1984\" to be eligible for that year's industry awards, which were only open to ads that aired during 1983, a low-profile premiere of the ad occurred on the Twin Falls, Idaho station KMVT on December 31, 1983 shortly before midnight.[61] Apple attempted to follow up \"1984\" the following year with a new ad entitled \"Lemmings\", to promote its Macintosh Office system. The ad, which featured blindfolded businessmen walking over the edge of a cliff in unison, was criticized for its \"dark\" theme and exaggerated premise. By contrast, \"Lemmings\" has been considered to be one of Apple's worst television advertisements.[62]\n\nBudweiser [ edit ]\n\nThe beer brand Budweiser has long been a Super Bowl fixture. Its parent company Anheuser-Busch held a long-term contract with the NFL that allowed it to buy several slots of air time from the game's broadcaster each year at a steep discount, a contract that ran through Super Bowl 50;[24] the company continues to buy multiple commercials in each game.[63] Budweiser runs several advertising campaigns throughout each game, one of which has traditionally featured its mascots, the Budweiser Clydesdales.[64] The Clydesdales were included in at least one Super Bowl commercial every year from Super Bowl IX in 1975 through Super Bowl LI in 2017.[63] Budweiser's parent company Anheuser-Busch has been the most successful advertiser in the annual Super Bowl Ad Meter survey organized by USA Today, having finished first on the survey fourteen times.[1][2] When USA Today held an \"All-Time Ad Meter\" bracket tournament in 2014, two Budweiser commercials met in the finals; the winner was a 2008 ad spoofing Rocky, which went against its 1999 ad \"Separated at Birth\", which featured a pair of Dalmatian puppies given to two separate owners, but eventually seeing each other again after one became a mascot dog on the Clydesdales' carriage.[65]\n\nAs of 2015, Budweiser had won the survey thirteen times in fifteen years; its 2013 advertisement entitled \"Brotherhood\" focused on the relationship and emotional reunion of a clydesdale with its original trainer three years after leaving to become a Budweiser Clydesdale.[2][66] Prior to the game, Budweiser also invited users to vote via Twitter on a name for the new foal that would be featured in the ad.[64] A 2014 ad entitled \"Puppy Love\" featured a similar reunion between an adopted dog and another Budweiser Clydesdale.[1] Its most recent victory and its third in a row, 2015's \"Lost Dog\", featured a dog being rescued from a wolf by the Clydesdales.[67]\n\nIn 2017, Budweiser broadcast \"Born the Hard Way\", an ad which dramatized Anheuser-Busch co-founder Adolphus Busch's emigration to the United States from Germany to establish the company. The advertisement attracted criticism and a boycott among supporters of U.S. president Donald Trump, due to its pro-immigration themes (especially in the wake of an executive order which briefly restricted entry into the U.S. by residents of several countries with predominant Muslim populations).[68][69][70] Anheuser-Busch denied that the ad was meant to be a political message, as it had been in production for the past year, and that it was meant to \"highlight the ambition of our founder, Adolphus Busch, and his unrelenting pursuit of the American dream.\"[69] Barring a brief appearance, the Clydesdales were not prominently featured during the ad. However, Budweiser's social media outlets promoted \"ClydesdaleCam\", a Facebook live stream of the Clydesdales watching the game in a stable and waiting to see their cameo.[71][72]\n\nIn 2018, Budweiser broadcast \"Stand by You\", an ad which chronicled Anheuser-Busch's disaster relief program of distributing cans of drinking water from its brewery in Cartersville, Georgia. The Clydesdales were, once again, downplayed from its television spots, with the brewery only airing a 5-second bumper in the second quarter to promote its streaming ClydesdaleCam event.[63][73] However, the Clydesdales were featured in several digital-oriented companion campaigns alongside the game, including ClydesdaleCam, a second, web-exclusive ad entitled \"Beer Country\", as well as themed Snapchat filters.[74] The Clydesdales returned for Budweiser's 2019 ad, \"Wind Never Felt Better\", which promoted Anheuser-Busch's commitment to use clean energy, including wind power, as part of production for its products.[75]\n\nBudweiser has introduced other campaigns during the Super Bowl as well. During Super Bowl XXIII, Budweiser aired an episodic series of commercials known as the Bud Bowl—which featured a football game between stop motion-animated beer bottles representing Budweiser and Bud Light, with commentary by Bob Costas and Paul Maguire. Proving popular, the Bud Bowl would return at subsequent Super Bowls; it had become so popular that some viewers actually wagered on the outcome of the Bud Bowl as if it were an actual event.[40][76][77] In 1995, Budweiser introduced the first of a series of ads featuring a group of three frogs named Bud, Weis, and Er, which only croaked their respective names. The Budweiser Frogs became one of the brand's most popular campaigns, and were expanded upon at Super Bowl XXXII with a series of ads focusing on two wise-cracking lizards—Louie and Frankie—who found the frogs annoying and had hired a ferret hitman to try and kill them.[78][79][80][81]\n\nAnheuser-Busch has aired commercials for other beer brands during the game alongside Budweiser and Bud Light, such as Beck's Sapphire and Stella Artois.[82][83][64] At Super Bowl LI, the company re-launched Busch,[84][85] and broadcast a Bud Light ad featuring the ghost of its former dog mascot Spuds MacKenzie.[86][87] Michelob Ultra debuted for Super Bowl LI, with an ad starring actor Chris Pratt.[88] Bud Light extended its medieval-themed advertising campaign (colloquially known as \"Dilly Dilly\") to the Super Bowl in 2018, with the game featuring the debut of \"The Bud Knight\"—the third installment of a \"trilogy\" of ads that led into the game (with the second, \"Ye Olde Pep Talk\", having premiered during the conference championship games but also re-aired during the Super Bowl).[89][90]\n\nAnheuser-Busch made its largest-ever advertising purchase for Super Bowl LIII, with eight ads (one 60-second spot, four 45-second spots, and the remaining being 30-second spots) covering seven products in five brands—including Budweiser, Bud Light, Bon & Viv Spiked Seltzer, Michelob Ultra, and Stella Artois.[82][91] Bud Light's medieval campaign continued into Super Bowl LIII, with an ad attacking its competitors for their use of high fructose corn syrup, and the latter featuring a crossover with the HBO series Game of Thrones.[92][93]\n\nFor Super Bowl LIV, the company only purchased four 60-second spots, with one covering both Bud Light and Bud Light Seltzer.[94]\n\nChrysler [ edit ]\n\nChrysler, and the marques of its current parent company Fiat Chrysler Automobiles, have made repeated appearances during the Super Bowl. From 2011 through 2014, Chrysler became known for running several notable long-form ads;[95] at Super Bowl XLV, Chrysler aired a two-minute long ad entitled \"Born of Fire\" to launch the Chrysler 200 and the company's new slogan \"Imported from Detroit\". The ad featured scenes depicting the history and revitalization of Detroit, as well as local rapper Eminem and his song \"Lose Yourself\". The ad was critically acclaimed, and won a Creative Arts Emmy Award for \"Best Commercial\" in 2011.[96][97][98]\n\nDuring Super Bowl XLVI, Chrysler broadcast \"Halftime in America\", a two-minute long commercial directed by David Gordon Green, written by poet Matthew Dickman and narrated by actor Clint Eastwood. The commercial recounted the automotive industry crisis of 2008–10, set to scenes showing Americans in despair, but then in hope. The narration of the ad equated the emergence from the crisis to the second half of a football game, explaining that \"All that matters now is what’s ahead: how do we come from behind? How do we come together? And how do we win? Detroit’s showing us it can be done. And what’s true about them is true about all of us. This country can’t be knocked out with one punch. We get right back up again, and when we do the world’s gonna hear the roar of our engines.\" The ad was heavily viewed online after the game, receiving over 4 million views on YouTube within 36 hours, but also attracted controversy due to its political overtones.[99]\n\nSuper Bowl XLVII featured an ad for Ram Trucks, which adapted Paul Harvey's 1978 speech \"So God Made a Farmer.\" During Super Bowl 50, the company focused exclusively on its SUV brand Jeep. At Super Bowl LI, the company similarly focused exclusively on Alfa Romeo, as part of a campaign to re-launch the Fiat-owned brand in the United States.[100][101] Super Bowl LII featured two Ram Trucks commercials, the latter featuring an extract from a 1968 speech by Martin Luther King Jr., as well as three Jeep ads.[102][103]\n\nThe Jeep Gladiator was the focus of a spot during Super Bowl LIV, starring actor Bill Murray reprising his role from the film Groundhog Day (appropriately, given the scheduling of that year's game). The ad would win the Super Bowl Ad Meter survey, marking the Jeep marque's first victory.[104][105]\n\nThe Dot-com Super Bowl [ edit ]\n\nSuper Bowl XXXIV (2000) became notable for featuring a large number of commercials from dot-com companies, to the extent that critics dubbed it the \"Dot-com Super Bowl\".[106] With a 30-second ad costing around $2.2 million, 20% of the commercial time sold went to dot-com companies—constituting $44 million of the $130 million spent in total on Super Bowl advertising time that year. Despite their aspirations and the boosts in traffic they received from the ads, all of the publicly held companies which advertised saw their stocks slump after the game as the dot-com bubble began to rapidly deflate. Some of the companies that advertised during the game—including Epidemic Marketing and Pets.com, had become defunct by the end of the year, and at Super Bowl XXXV, only three dot-com companies—E-Trade, HotJobs, and Monster.com—advertised during the game.[107][108]\n\nNotable dot-com ads broadcast during the game included \"If You Leave Me Now\", an ad for Pets.com which introduced the website's iconic sock puppet mascot, a self-proclaimed \"worst commercial on the Super Bowl\" by LifeMinder.com that consisted only of text captions on a yellow background with \"Chopsticks\" playing in the background, and \"Monkey\"—a deliberately nonsensical E-Trade ad that featured a monkey dancing to \"La Cucaracha\", and the tagline \"Well, we just wasted $2,000,000. What are you doing with your money?\"[109][110][111] Electronic Data Systems also aired an ad during the game that featured cowboys who herded cats instead of cows.[40]\n\nDoritos [ edit ]\n\nIn 2006, Doritos began holding a promotion known as Crash the Super Bowl, soliciting viewers to film their own Doritos commercials to possibly be aired during the game. At Super Bowl XLIII in 2009, an additional bonus prize of $1 million was added if any of the winning entries were named #1 on the Super Bowl Ad Meter survey results; Doritos would reach the #1 spot on the survey that year with an ad entitled \"Free Doritos\", created by Joe and Dave Herbert of Batesville, Indiana. The ad featured an office worker attempting to fulfill a prediction that he would receive free Doritos by smashing open a vending machine with a crystal ball.[112]\n\nThe following year, additional prizes of $600,000 and $400,000 were added for reaching second and third place on the poll, plus an additional $1 million bonus for each if three of the ads were to sweep the top three. A 2010 finalist, \"UnderDog\", reached second place on the poll.[112][113][114]\n\nAnother user-submitted Doritos ad, \"The Cowboy Kid\", finished in second place on the Ad Meter survey in 2014, winning $50,000. The contest itself was won by \"Time Machine\"; created by Ryan Thomas Andersen of Arizona and produced on a budget of only $300, the ad featured his son scamming his neighbor into giving him his bag of Doritos by claiming that he had built a time machine that was fueled by them. For winning the contest, Anderson received $1 million and an opportunity to work on set during the production of the film Avengers: Age of Ultron.[1][115]\n\nGoDaddy [ edit ]\n\nThe domain registrar and web hosting company GoDaddy was well known for producing Super Bowl commercials featuring female spokespersons it dubbed \"GoDaddy Girls\", such as professional driver Danica Patrick, and for its 2011 ad, comedian Joan Rivers.[116] Many of the company's planned Super Bowl ads were allegedly rejected by broadcasters due to their risqué subject matter, leading to GoDaddy instead airing a \"teaser\" ad during the game that instructed viewers to watch the uncensored version of the ad on their website.[116]\n\nThe company's first appearance at Super Bowl XXXIX parodied the \"wardrobe malfunction\" that had occurred at last year's halftime show,[117] featuring a woman testifying to Congress about why GoDaddy wanted to advertise during the game, but a strap of her tank top coming undone. The ad was scheduled to air twice, but its second airing was pulled in response to concerns by Fox and the NFL over its content. The following year at Super Bowl XL, thirteen ad concepts were rejected by ABC due to their content.[116][118] In 2008, a GoDaddy ad entitled \"Exposure\" was rejected by Fox for using the word \"beaver\" as a double entendre. In turn, the ad was replaced with one advertising the availability of the ad on GoDaddy's website, attracting two million visits.[119] In October 2013, GoDaddy's chief marketing officer Barb Rechterman announced that the company would no longer air provocative ads during the Super Bowl, explaining that \"our new brand of Super Bowl commercials will make it crystal clear what we do and who we stand for. We may be changing our approach, but as we've always said, we don't care what the critics think. We are all about our customers.\"[117]\n\nGoDaddy's ad in 2015, \"Journey Home\", was controversial for different reasons: it featured a puppy travelling back to its owner after falling out of a pickup truck, only to learn that he had been sold to a new owner using a website built with GoDaddy. The ad was criticized by animal rights groups, who felt that it implied an endorsement of commercial puppy mills. GoDaddy quickly pulled the ad in response to the controversy; GoDaddy CEO Blake Irving explained that the ad's humor had \"clearly missed the mark\". PETA partially praised the ad for portraying the seller as being a \"callous jerk\", but explained that \"The sale of animals online and from pet stores and breeders should be roundly condemned, and it was today. GoDaddy did the right thing by swiftly promoting adoption.\"[120][121]\n\nTide [ edit ]\n\nProcter & Gamble has used the Super Bowl to promote its Tide detergent. Several Tide ads for the Super Bowl have been viewer favorites and award winners, including the \"Talking Stain\" featured a yammering blotch ruining a job interview for Super Bowl XLII, and the \"Miracle Stain\" that summoned acolytes to worship a blemish appearing like Joe Montana for Super Bowl XLVII.[122]\n\nTide aired an episodic three-part ad during Super Bowl LI that starred Fox NFL Sunday co-host Terry Bradshaw, where he discovers a stain on his suit right before going on air from Fox's set at NRG Stadium, prompting him to—as seen in a second commercial later in the game—quickly travel to Jeffrey Tambor's house so he could clean it with Tide. In the conclusion (aired near the end of the game), Bradshaw makes it back to the game, only for his colleague Curt Menefee to spill coffee on his shirt, with Tambor (who is watching from home) refusing to help again. Due to the timely nature of the ad's details, it was filmed over the weeks immediately prior to the Super Bowl, and required P&G's agency to construct a replica of Fox's actual on-field set for the game, and use visual effects to correctly reflect the look of the stadium and the teams participating in the game. The segments were also designed to be plausibly live.[123]\n\nDuring Super Bowl LII, Tide aired a series of commercials starring David Harbour, which presented several types of commercials that viewers often see during the Super Bowl, only to reveal that they are all actually commercials for Tide because all of their clothes are perfectly clean. Some of the commercials included crossovers with ads for other Procter & Gamble products, including a Mr. Clean ad aired during Super Bowl LI, and Old Spice's \"The Man Your Man Could Smell Like\" ad.[124]\n\n\"Small Business Big Game\" [ edit ]\n\nAs a byproduct of the increased cost of ad time at the Super Bowl, financial software company Intuit made its debut at Super Bowl XLVIII by hosting a promotion known as \"Small Business Big Game\", in which small businesses with \"inspiring\" stories competed for a chance to earn a commercial during the Super Bowl funded by Intuit, as decided by user votes. Company CEO Brad D. Smith explained that the promotion was an extension of the company's goals to improve financial lives \"in a way that you'd never imagine going back\", while Ken Wach, senior vice president of marketing for Intuit's Small Business Group, explained that \"normally you're looking at Budweiser ads or Chevy ads, so this was about putting small businesses on the national stage and shining the spotlight on them as heroes of the economy.\"[125]\n\nThe winner of the 2014 edition was GoldieBlox, a toy company with a focus on promoting mechanical engineering to young girls.[125] While the campaign was a success for the winner, resulting in increased prominence and sales, Wach felt that Intuit was not able to \"sustain the momentum as much as we would have liked\". At Super Bowl XLIX, Intuit did not hold the promotion, but still aired an ad for its own TurboTax product.[125] The contest returned in 2015 for Super Bowl 50, and was won by Death Wish Coffee.[126][127]\n\n\"I'm going to Disney World!\" [ edit ]\n\nDisney Parks is known for an advertising campaign associated with the Super Bowl entitled \"What's Next?\", but more popularly known as \"I'm going to Disney World!\". The ads feature a player from the winning team (typically the MVP) responding with the eponymous declaration after being asked what they would do after the game. These ads typically premiere on the day after the Super Bowl. The series began following Super Bowl XXI, and first featured Phil Simms of the New York Giants. Disney has reportedly offered players $30,000 if they participate in the commercial and visit a Disney theme park (usually Disney World or Disneyland) afterward, and has extended the campaign to champion players in other sports. At Super Bowl XL (broadcast by corporate sister ABC), Disney aired an in-game commercial themed around the campaign, featuring Pittsburgh Steelers and Seattle Seahawks players rehearsing the line in case they won.[128][129][130]\n\nLocal advertising during the Super Bowl [ edit ]\n\nIn order to dodge the high costs of obtaining national ad time, or to broadcast more regionalized campaigns, some advertisers elect to purchase local advertising time from the individual network affiliates airing the Super Bowl, such as the Church of Scientology—who bought local ad time in major urban markets such as New York City in 2014, and the Bank of Montreal to promote its BMO Harris Bank branches.[131][132] In 2012, Old Milwaukee broadcast a Super Bowl ad starring Will Ferrell; as an extension of the beer's regional campaign with the actor, the ad only aired in the city of North Platte, Nebraska.[133]\n\nIn 2014, several notable local ads were broadcast. The Utah Department of Transportation used the game to broadcast a public service announcement on seat belt usage for its Zero Fatalities campaign, which featured a depiction of a child who had died in a rollover crash because he did not use a seat belt.[134] In Savannah, Georgia, local personal injury lawyer Jamie Casino broadcast a two-minute long advertisement on WTGS, which featured a thriller-styled retelling of how he stopped representing \"cold-hearted villains\" to avenge the 2012 Labor Day shooting death of his brother Michael Biancosino, and Emily Pickels, after a subsequent statement by former police chief Willie Lovett who claimed that there were \"no innocent victims\", culminating with Casino digging through a grave with a sledgehammer.[135][136] The commercial went viral after the game, with The Independent dubbing it the \"most metal\" Super Bowl ad imaginable.[137][138] Tribune Broadcasting used local time on the Fox affiliates it owned to air an extended promo for Salem, a then-upcoming series on sister cable network WGN America.[139]\n\nIn 2015, Newcastle Brown Ale bought time on local NBC stations to air an ad that, as a commentary on the high cost of national Super Bowl advertising time, contained plugs for 37 other products and companies it had recruited in a crowdfunding campaign.[140][141] In Savannah, Georgia, Jamie Casino aired a sequel to his 2014 ad that focused on the \"bullies\" that he had encountered throughout his life.[142]\n\nIn 2016, St. Louis attorney Terry Crouppen aired a local ad in which he criticized Stan Kroenke for his decision to re-locate the St. Louis Rams to Los Angeles.[143][144]\n\nIn 2017, some Canadian companies bought local advertising time from Fox affiliates carried in the country, taking advantage of a new regulatory policy that made the Super Bowl available directly from U.S. stations via local television providers for the first time.[145]\n\nIn 2018, rock musician Alice Cooper appeared in a local ad for Desert Financial Credit Union, which played upon his band's song \"School's Out\" to promote its re-branding from Desert Schools Federal Credit Union.[146][147] Jamie Casino also returned with a new ad.[148] A local Subaru dealer in Muskegon, Michigan ran a simplistic ad containing only of the logos of the dealership, and the message \"Congratulations Patriots!\"—a \"last minute calculated risk\" based on odds favoring the team, given that the game was actually won by the Philadelphia Eagles.[149]\n\nControversial Super Bowl commercials [ edit ]\n\nA number of Super Bowl commercials have been considered controversial by viewers and critics, or even outright blocked by networks' Standards and Practices departments, because of concerns surrounding their contents. Political advertising and most direct forms of issue-related advertising are usually not aired during the Super Bowl because of equal-time rules or other factors,[150] while the NFL forbids ads for gambling, hard liquor, and banned substances from airing during any of its telecasts.[151][152][153]\n\nAn exception to the lack of major political advertising during the Super Bowl occurred in 2020 for Super Bowl LIV, in the lead-up to the 2020 presidential election (with the Iowa caucuses occurring the Monday immediately following the game). The campaigns of president Donald Trump and Democratic Party candidate Michael Bloomberg both bought ad time during the game, paying around $10 million each.[154] Due to concerns from other advertisers over their commercials being aired in proximity to the campaign ads, Fox reportedly agreed to insulate these two ads by only scheduling promos for network programming to air alongside them in their respective breaks.[155]\n\nJust For Feet: \"Kenyan Mission\" [ edit ]\n\nAt Super Bowl XXXIII, footwear retailer Just For Feet aired its first Super Bowl ad. In the commercial, a barefoot Kenyan runner is tracked by a group of Caucasian men in a Humvee. The runner is offered drug-laced water which knocks him unconscious; when he wakes up, the runner discovers that the men had given him Nike shoes. The runner rejects the shoes and attempts to shake them off whilst running away.[156]\n\nThe ad was widely criticized for its derogatory premise; Bob Garfield described the commercial as being \"neo-colonialist\", \"culturally imperialist\", and \"probably racist\", while Chuck McBride, creative director of Nike's agency Wieden+Kennedy, stated that he \"couldn't believe that they had done this.\" Just For Feet had spent $7 million on the ad, including $1.7 million for the time, and the rest on production and promotional costs. Despite its concerns about its content, Just For Feet relied on the expertise of their hired agency, Saatchi & Saatchi, because they assured that the ad was their best work. Just For Feet CEO Harold Ruttenberg explained to Salon that \"we took out advertisements. We gave away more than $1 million of product. Then the ad runs. And you would not believe the deluge of comments made about this company. I couldn't sleep for a solid month. And it's all because of these guys who said they knew everything.\"[156]\n\nJust For Feet filed a $10 million lawsuit against Saatchi & Saatchi for malpractice, alleging that the agency was damaging its reputation and goodwill through its \"appallingly unacceptable and shockingly unprofessional performance\", which ran \"contrary to the deepest held principles of Just for Feet, which has always sought to promote racial harmony, finds racism abhorrent, and condemns drug use.\" Just for Feet filed for chapter 11 bankruptcy in November 1999, and the lawsuit was dropped. It was later found that the company had been engaging in accounting fraud.[156][157][158][159]\n\nGeneral Motors: \"Robot\" [ edit ]\n\nAt Super Bowl XLI, General Motors aired a 60-second ad entitled \"Robot\", which was meant to promote the powertrain warranty it offered for its vehicles. Themed around an \"obsession\" with quality, the ad depicted an assembly line robot being fired for dropping a screw. After attempting several alternative careers, the robot is depicted killing itself by rolling off the edge of a bridge into a river.[160] The sequence is interrupted to reveal that the events were just a dream, and that the robot had not been fired at all. Although ranking in ninth place on the Adbowl survey, \"Robot\" received criticism for its glamorization of suicide; the American Foundation for Suicide Prevention (AFSP) was a notable critic of the spot, as well as the National Alliance on Mental Illness (NAMI) and other suicide prevention groups. The AFSP stated that \"the ad, in its carelessness, portrays suicide as a viable option when someone fails or loses their job.\"[161][162] Some critics also interpreted the ad's thematics as being in poor taste, as GM had laid off 35,000 factory workers in the previous year.[162][163]\n\nA GM spokesperson defended the commercial as being \"a story of GM's commitment to quality\", and stated that this was the \"predominant impression\" by those who had previewed it. GM pulled the original version of the ad from its YouTube page, and removed the suicide scene from future airings.[162][163]\n\nFocus on the Family pro-life ad [ edit ]\n\nAt Super Bowl XLIV, the non-profit evangelical organization Focus on the Family aired an advertisement featuring then-Florida Gators quarterback Tim Tebow and his mother, Pam. Prior to becoming pregnant with Tim, and while serving as Baptist missionaries in the Philippines, Pam had contracted amoebic dysentery and fell into a coma. She discovered she was pregnant while recovering. Because of the medications used to treat her, the fetus experienced a severe placental abruption.[164] Doctors expected a stillbirth and recommended an abortion. The Tebows decided against it, citing their strong faith.[164] In the ad, Pam described Tim as a \"miracle baby\" who \"almost didn't make it into this world\", and remarked that \"with all our family's been through, we have to be tough\"—after which she was tackled by Tim. The ad itself made no reference to abortion or Christianity, and directed viewers to the organization's website.[165][166]\n\nThe then-unseen ad drew criticism from some women's rights groups, who asked CBS to pull the ad because they felt it would be divisive. Planned Parenthood released a video response of its own featuring fellow NFL player Sean James.[167][168] The claim that Tebow's family chose not to perform an abortion was also widely criticized; as abortion is illegal in the Philippines, critics felt that it was implausible that a doctor would recommend the procedure in the first place.[166][169] CBS's decision to run the ad was also criticized for deviating from its past policy of rejecting issue and advocacy-based commercials during the Super Bowl, including those by left leaning or perceived left leaning groups such as PETA, MoveOn.org and the United Church of Christ (which wanted to run an ad that was pro-same-sex marriage). However, CBS stated that \"we have for some time moderated our approach to advocacy submissions after it became apparent that our stance did not reflect public sentiment or industry norms on the issue.\"[170]\n\nAshley Madison and ManCrunch [ edit ]\n\nAvid Life Media, an operator of online dating services, has had two Super Bowl ads rejected by broadcasters. In 2009, NBC rejected an ad for the extramarital dating site Ashley Madison, which featured the tagline \"Who Are You Doing After the Game?\", from appearing during Super Bowl XLIII.[171] Avid Life Media's CEO Noel Biderman felt the rejection was \"ridiculous\", noting an apparent double standard of allowing advertisements for alcoholic beverages to air during NFL games despite the number of deaths attributed to them. Biderman considered the NFL demographic to be a core audience of the site, and promised to \"find a way to let them know about the existence of this service.\"[171]\n\nThe following year at Super Bowl XLIV, an advertisement for Ashley Madison's sister site ManCrunch—a dating website for homosexual relationships—was rejected by CBS. The ad featured two male football fans reaching into the same bowl of chips, and after a brief pause, passionately kissing and dry humping each other, much to the surprise of another man present. Company spokesperson Elissa Buchter considered the rejection to be discrimination, by contending that CBS would not have objected to the ad had it featured a kiss between a man and a woman, and acknowledging the frequent airplay of advertisements for erectile dysfunction medications on U.S. television as a double standard. Fellow spokesperson Dominic Friesen stated that the company was \"very disappointed\" of CBS's decision, noting that the network had allowed the aforementioned Focus on the Family ad to air during the game.[172][173] A New York Post writer felt that their ad was \"no more racy than nearly any beer commercial not starring the Budweiser Clydesdales\".[174]\n\nAvid Life was also accused of ambush marketing by critics, who argued that the company was intentionally submitting ads that would get rejected by broadcasters and receive free publicity from the ensuing controversy, thus removing the need to actually buy ad time during the game. However, the company denied these claims, and indicated that it did have serious intentions to purchase ad time during the game if its commercials were accepted.[172][173] In an article posted following the 2015 security breach of Ashley Madison, a former CBS standards & practices employee stated that the ManCrunch ad had actually been rejected for its use of NFL trademarks, and not because of its content.[175]\n\nPETA [ edit ]\n\nAnimal rights activist organization People for the Ethical Treatment of Animals, known for its salacious and shocking publicity stunts, has routinely submitted Super Bowl ads that have been rejected. Most of the advertisements have been explicitly sexual in nature. In 2018, PETA submitted a blasphemous advertisement instead, with a priest (portrayed by James Cromwell) telling a meat industry executive that he could not be forgiven for the sins of what PETA claimed were deceptive advertisements, even if he confessed. NBC expressed willingness to air the 2018 advertisement on the condition that the organization would buy additional ads during the 2018 Winter Olympics, which would have doubled the price; PETA refused and accused the network of price gouging.[176] For the 2020 advertisement, PETA claimed (without evidence) that Fox rejected their advertisement because of pressure from the NFL; the advertisement that year depicted animals imitating Colin Kaepernick's national anthem protests.[177]\n\nRandall Terry anti-abortion ad [ edit ]\n\nIn 2012, Randall Terry attempted to use a provision in Federal Communications Commission policies requiring \"reasonable access\" to local advertising time for political candidates within 45 days of an election or primary, to force several NBC stations to air a graphic anti-abortion attack ad during Super Bowl XLVI that featured images of blood-covered fetuses. Following a complaint by the Chicago-based NBC-owned station WMAQ, the FCC ruled that Terry could not expect reasonable access to advertising time during the Super Bowl because of the magnitude of the event and the limited amount of local advertising time available. Furthermore, it was also found that Terry did not show enough evidence that he was a bona fide candidate eligible to receive ad time in the first place.[178][179]\n\nChrysler: \"Halftime in America\" [ edit ]\n\nChrysler's Super Bowl XLVI ad \"Halftime in America\" was controversial due to its political overtones, especially as it came during the lead-up to the 2012 U.S. presidential election. Critics interpreted the ad as being in support of re-electing Barack Obama, suggesting that the metaphor of \"halftime in America\" symbolized the performance of Obama's first four-year term as president going into his re-election campaign, and noting Obama had supported George W. Bush's bailout of Chrysler whilst acting as a Democratic senator.[180] It was also noted that the commercial's narrator Clint Eastwood had made statements against the bailouts in 2011, had stated that he \"couldn’t recall ever voting for a Democratic presidential candidate\", and that he was a supporter of Republican candidate John McCain during the 2008 campaign. Eastwood would later appear as a surprise guest at the 2012 Republican National Convention in support of nominee Mitt Romney, addressing an empty chair meant to represent Obama.[99][181][182]\n\nSodaStream [ edit ]\n\nIn 2013, SodaStream submitted a Super Bowl advertisement directed by Alex Bogusky, which featured a pair of Coca-Cola and Pepsi deliverymen finding their bottles exploding and disappearing when another person uses the SodaStream to make their own beverages; representing a disruption of the soft drink market. The ad was rejected by CBS for its direct attacks towards the two rival companies.[183] A Forbes writer expressed concern that the network may have had intentionally shown protectionism towards the two soft drink companies (who have been long-time Super Bowl advertisers), and drew comparisons to a recent incident where the CBS-owned technology news site CNET was controversially forced by its parent company to block Dish Network's Hopper with Sling digital video recorder from being considered Best in Show at CES 2013 because the broadcaster was in active litigation over an automatic commercial skipping feature on the device.[184][185][186]\n\nAn older SodaStream commercial was shown in its place, which also featured exploding pop bottles in a similar fashion, but with no direct references to any other brand;[183] ironically, this particular ad had been banned in the United Kingdom by Clearcast for being considered \"a denigration of the bottled drinks market.\"[187]\n\nAnother SodaStream ad featuring Scarlett Johansson was produced for and aired during Super Bowl XLVIII in 2014; the supposed rejection of an initial version for containing the line \"Sorry, Coke and Pepsi\" was overshadowed by growing controversies around the company's use of a factory that was located in an Israeli settlement on the West Bank.[188][189]\n\nIn 2014, Coca-Cola aired a Super Bowl advertisement entitled \"It's Beautiful\"; themed around multiculturalism, the ad featured scenes depicting Americans of various ethnicities, along with a same-sex couple—the first to ever appear in a Super Bowl ad, set to a rendition of the patriotic hymn \"America The Beautiful\" with lyrics sung in multiple languages.[56][190]\n\nThe ad was divisive, with users taking to Twitter under the hashtag \"#SpeakAmerican\" to discuss their views and opinions on its content: those against the ad argued that per the melting pot principle, Coca-Cola should not have used languages other than English, the most common language of the country, to promote its products to ethnic minorities, and former Republican Congressman Allen West stated that \"If we cannot be proud enough as a country to sing 'America the Beautiful' in English in a commercial during the Super Bowl, by a company as American as they come—doggone we are on the road to perdition.\" By contrast, others praised the ad for celebrating the diversity of American people. Guardian writer Jill Filipovic noted that the company had been increasingly targeting minorities, such as Latino Americans (who are more likely to be heavy drinkers of soft drinks because of their low cost) and drew comparisons to the marketing of cigarettes to women, but that \"before we applaud Coke's advertising diversity, we should ask: do we really want Coke to diversify?\"[56][57][190]\n\nThe commercial was re-aired prior to kickoff at Super Bowl LI, eliciting similar criticism.[191]\n\nNationwide Insurance: \"Boy\" [ edit ]\n\nAt Super Bowl XLIX in 2015, after an eight-year hiatus, Nationwide Insurance returned to the game with two new advertisements. The second of these advertisements, \"Boy\" (also commonly referred to as \"Make Safe Happen\"),[192] featured a child explaining that he couldn't grow up because he had already died—followed by scenes of an overflowing bathtub (implying drowning), spilled cleaning products (implying poisoning), and a television having fallen off of a wall. The ad was intended to promote Nationwide's child protection campaign Make Safe Happen; operated in partnership with Safe Kids USA and Nationwide Children's Hospital, it aims to draw awareness to deaths caused by preventable household accidents.[193][194][195]\n\nViewers and critics acknowledged that the subject matter of \"Boy\" was a major contrast to other, upbeat and comedic ads broadcast during Super Bowl XLIX (including Nationwide's second ad, \"Invisible Mindy\"). Reception towards the ad was overwhelmingly negative; viewers criticized the company via social media for its decision to broadcast an ad dealing with such subject matter during the Super Bowl, Amobee estimated only 12% of reactions to the ad on Twitter were positive, and it ranked near the bottom of the USA Today Ad Meter results. Nationwide CMO Matthew Jauchius defended the ad, noting that the negative response was \"a little stronger than we anticipated\", and that \"Boy\" was intended to \"begin a dialogue to make safe happen for children everywhere.\"[196][197][198] Jauchius later exited Nationwide two months after the advertisement aired.[199]\n\n84 Lumber: \"The Journey\" [ edit ]\n\nBuilding supply company 84 Lumber debuted at Super Bowl LI with \"The Journey\"; the ad depicted a mother and daughter migrating from Mexico to the United States border, only to discover that a wall had been built on it. However, after the daughter presented a handmade version of the U.S. flag that she had made with pieces of fabric collected along the way, the two discover a giant door in the wall. The ending of the ad is accompanied by the tagline \"The will to succeed is always welcome here.\"[200][201][202]\n\nThe original version of the ad was rejected by Fox, as they believed that the border wall imagery was too politically sensitive in the wake of Donald Trump's presidency, as his campaign promises included a plan to build a wall across the entire southern border. The company's agency stated that it intended to present an edited version of the ad during the game, which would direct users to watch the full, 6-minute short film on 84 Lumber's website.[200][203][204][205] The company reported that its website received a total of over 6 million visits in the hour following the airing, and received over 300,000 requests in a minute after the ad aired, causing it to crash.[200]\n\nGNC: \"Courage to Change\" [ edit ]\n\nOn January 31, 2017, it was reported that an advertisement for the health store chain GNC had been rejected by the NFL for broadcast during Super Bowl LI. The ad had been rejected due to the company's inclusion on a list of \"prohibited companies\" issued by the NFL Players Association; a small number of GNC's products contain DHEA and Synephrine, which are performance-enhancing substances banned by the NFL. Inclusion on this list prohibits NFL players from promoting or endorsing the company. NFL policies do not allow advertising for “dietary or nutritional supplements that contain ingredients other than vitamins and minerals, energy drinks, or any prohibited substance”. Advertisements for health stores are not banned, provided that they do not reference such products. GNC's advertisement featured motivational themes as part of a larger \"Courage to Change\" marketing campaign, and did not make any references to specific products sold by the chain.[206][151][152]\n\nOn February 2, 2017, it was reported that GNC had threatened to sue Fox over the rejection. The letter of intent stated that the contents of GNC's commercial had been \"expressly approved\" twice by Fox, and that the broadcaster did not inform GNC that ads broadcast during the Super Bowl were subject to approval by the NFL or any league policies. The company stated that Fox had \"induced GNC to spend millions of dollars in production costs and in the development of a national, coordinated marketing and rebranding campaign centered around this advertisement.\"[207][206]\n\nRam Trucks: \"Built to Serve\" [ edit ]\n\nIn 2018 at Super Bowl LII, Fiat Chrysler Automobiles marque Ram Trucks aired a commercial entitled \"Built to Serve\", as one of two Ram ads during the game. It featured an extract from the \"Drum Major Instinct\" sermon given by Martin Luther King Jr. on February 4, 1968 (exactly 50 years prior), wherein King explained the virtues of serving others. The speech was, in turn, set to footage of people using their Ram vehicles to help others.[208][209]\n\nThe ad was widely criticized for using the words of MLK to promote a product. It was also pointed out that King had, ironically, criticized the advertising industry during the same sermon as being \"gentlemen of massive verbal persuasion\", explaining that \"in order to be a man of distinction, you must drink this whiskey. In order to make your neighbors envious, you must drive this type of car. In order to be lovely to love you must wear this kind of lipstick or this kind of perfume. And you know, before you know it, you're just buying that stuff.\" William B. Wachtel, co-founder of the Drum Major Institute, stated that \"In a twist of irony, one of the specific evils Dr. King condemned was the exploitation of the drum major instinct by advertisers, particularly car advertisers\".[210][208][209] Current Affairs posted a parody of the commercial on YouTube, overdubbing the original audio with this section of the speech.[211][212]\n\nUse of the speech was approved by Intellectual Properties Management, the exclusive commercial licensor of King's estate. A representative of the organization stated that they approved the ad because its overall message \"embodied Dr. King's philosophy that true greatness is achieved by serving others.\"[209][102][210][208] Although the King Center distanced itself from the ad by stating that it was not responsible for its licensing, it was pointed out that Intellectual Properties Management was based within the facilities of the King Center to begin with, and thus had close ties to the family. Los Angeles Times columnist Michael Hiltzik argued that King's rights should be managed by a larger group of historians and scholars through an \"open and transparent\" process, rather than just his close family, \"so at least we don't have a situation where some corporation drapes itself in King's preacherly robes while the estate issues fatuous excuses that a TV commercial embodies 'Dr. King's philosophy'.\"[213][212]\n\nInternationally [ edit ]\n\nThe Super Bowl commercials are generally limited to the American television broadcast of the game. This prevents international viewers from watching the game with these often iconic commercials. Online postings of the commercials on sites such as YouTube have partially alleviated the issue,[214][215] along with the airing of some of the commercials during local television newscasts in other countries, while NBC posted the Super Bowl XLIX commercials on a Tumblr blog as they aired during the game for the benefit of its U.S. online stream (which did not contain all of the same ads as the television feed).[18]\n\nComplaints about the U.S. Super Bowl ads are common in Canada; although U.S. network affiliates are widely available on pay television providers in the country, \"simultaneous substitution\" regulations give Canadian television networks the right to request that a U.S. feed of a program be replaced with its Canadian counterpart on these providers if it is airing a program in simulcast with a U.S. network. This rule is intended to protect the investments of Canadian broadcasters in exclusive domestic broadcast rights, and also protect Canadian advertisers who had purchased their own advertising time on the Canadian network. As a result, most American Super Bowl ads are effectively \"blacked out\" by the Canadian broadcaster.[214][215][216] Members of Parliament Bob Nault and Wayne Easter have stated that the Canadian Radio-television and Telecommunications Commission (CRTC), Canada's telecom regulator, has only received around 100 specific complaints about Super Bowl ads in relation to the simsub rules.[217]\n\nSome U.S.-based advertisers, particularly PepsiCo and Anheuser-Busch (via its Canadian subsidiary Labatt), do buy ad time during the Canadian broadcast on CTV, owned by Bell Media—the broadcasting subsidiary of Canadian telecommunications firm BCE and the current rightsholder of the game, to air at least some of their American commercials, but many Canadian advertisers simply re-air ads from their regular rotation, or air the same ad multiple times over the course of the game, neither of which is typical during the U.S. network broadcast.[215] Reasons cited by Canadian advertisers for these practices include the additional talent and post-production fees that would be required to broadcast the American ads in Canada, and the perceived lower \"cultural resonance\" of the game for Canadian viewers as opposed to Americans.[215] As such, and because Canada's population is approximately a tenth of the United States', advertising time costs a fraction of the price to air an ad on the U.S. broadcast: prices ranged between $170,000 to $200,000 for a 30-second slot on CTV's telecast of Super Bowl XLIX.[131][218]\n\nOn the other hand, in the 2010s, there were a growing number of Super Bowl ads produced specifically for the Canadian broadcast: Hyundai's Canadian subsidiary began airing its own Super Bowl ads in 2010,[219] and Budweiser produced the hockey-themed \"Flash Fans\" to air during the Canadian broadcast of Super Bowl XLVI. The following year, two Canadian companies—BlackBerry and Gildan Activewear, made their debut as U.S. Super Bowl advertisers; their ads were also broadcast in Canada alongside those by McDonald's Canada, who debuted its \"Our Food. Your Questions.\" campaign, Budweiser's internet-connected hockey goal lights, and Hyundai Canada's \"Gaspocalypse\", promoting the Sonata Hybrid.[131] Budweiser expanded its goal light campaign for Super Bowl 50, which featured an ad introducing a 20 foot (6.1 m)-tall goal lamp used as part of a promotional campaign leading towards the 2016 World Cup of Hockey.[220] For Super Bowl LIV in 2020, Budweiser Canada produced a commercial reviving its previous Whassup? campaign from the early-2000s.[221]\n\nFor Super Bowl LIII, Unifor purchased time on the Canadian broadcast to air an attack ad, criticizing General Motors' decision to close the Oshawa Car Assembly plant. On the Friday before the game, Unifor received a letter from GM Canada requesting that the ad be pulled, alleging that it was \"designed intentionally and maliciously to mislead Canadian consumers and forever tarnish GM's reputation with them\".[222]\n\nCanadian simsub ban [ edit ]\n\nOn January 29, 2015, the CRTC announced a proposal to forbid the invocation of simultaneous substitution on the Super Bowl telecast, thus allowing U.S. feeds of the event to co-exist with those of Canadian rightsholders on pay television providers. The decision came as a result of a series of hearings held by the CRTC known as Let's Talk TV, which explored reforms of the Canadian television industry: the Commission cited viewer frustration over the use of simsubs, especially surrounding the Super Bowl, and argued that the commercials were an \"integral part\" of the game due to their cultural significance.[218][223] In March 2015, Bell filed an appeal against this decision, arguing that the move would devalue its exclusive broadcast rights to the game, and violated the Broadcasting Act, which forbids the \"making of regulations singling out a particular program or licensee.\"[224] A report commissioned by Bell estimated that without this lucrative exclusivity, it would lose about US$13.6 million per-year.[225]\n\nIn spite of the complaints and legal action, the CRTC issued an order on August 19, 2016 that officially implemented the new rule. On September 6, 2016, the Federal Court of Appeal dismissed Bell Media's lawsuit for being premature, because it was filed before the CRTC had formally implemented the rules.[226][227] On November 2, 2016, Bell was granted an appeal.[228] In the lead-up to Super Bowl LI (which would be the first game to fall under this policy), a number of stakeholders, including the NFL, Bell Media, local unions. as well as politicians from both Canada and the U.S., called upon the CRTC to reverse the ruling. U.S. senators Marco Rubio and Ron Johnson wrote to an ambassador that the CRTC's decision \"sends a troubling signal about the value Canada places on its largest trading partner, best customer and close friend.\" Bell had also urged prime minister Justin Trudeau to invoke section 26(2) of the Broadcasting Act (which grants the government power to require the broadcasting of programming that is \"of urgent importance to Canadians\", and had only been invoked once before to mandate the broadcast of a major speech by a Prime Minister) to override the CRTC policy and still require that the Super Bowl LI telecast be subject to simsub.[225][229]\n\nCourt action on the CRTC ruling was not taken in time for the game, meaning that Super Bowl LI was the first to be available through Canadian television providers without being subject to simsub.[230] Some Canadian advertisers, such as Leon's and Pizza Pizza, took advantage of the decision by purchasing local ad time from U.S. Fox affiliates carried in Canada, to broadcast commercials aimed at the Canadian audience. The sales manager of Spokane's affiliate KAYU-TV praised the change for helping increase demand for its limited local inventory; the station is carried on cable in the significantly larger Canadian markets of Calgary and Edmonton, Alberta.[145]\n\nNeither Nielsen or Numeris (Canada's main television ratings provider) calculate Canadian viewership of U.S. television channels, so it is unknown exactly how many Canadian viewers watched the game directly from Fox stations rather than CTV.[145] Following the game, it was reported that viewership of Super Bowl LI on CTV, in addition to CTV Two and TSN (which simulcast the game in order to increase the saturation of Bell-owned properties carrying it, and offered an on-air sweepstakes as a publicity stunt to attract viewers), was down by 39% over Super Bowl 50.[230][231][231][232]\n\nOn December 19, 2017, the Federal Court of Appeal dismissed Bell Media's case, ruling that the CRTC's policy was reasonable.[233] Bell Media once again filed for an appeal in January 2018, this time in the Supreme Court of Canada.[234] In December 2019 (prior to Super Bowl LIV) the decision was overturned by the Supreme Court, which ruled that the CRTC's policy overstepped article 9(1)(h) of the Broadcasting Act (which governs must-carry rules) since it \"does not empower the CRTC to impose terms and conditions on the distribution of programming services generally\". The court did not rule on the CRTC's ability to enact policies based on specific programs.[6][235]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/71/Budweiser_Clydesdales_Boston.jpg/200px-Budweiser_Clydesdales_Boston.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/Tim_Tebow_Denver_Sports_Authority_Field_2012-01-01.jpg/170px-Tim_Tebow_Denver_Sports_Authority_Field_2012-01-01.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Super_Bowl_XLVII_Kick_Off.jpg/220px-Super_Bowl_XLVII_Kick_Off.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Macintosh_128k_transparency.png/170px-Macintosh_128k_transparency.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/71/Budweiser_Clydesdales_Boston.jpg/1200px-Budweiser_Clydesdales_Boston.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/71/Budweiser_Clydesdales_Boston.jpg/1200px-Budweiser_Clydesdales_Boston.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Super_Bowl_commercials", "title": "Super Bowl commercials", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/71/Budweiser_Clydesdales_Boston.jpg/1200px-Budweiser_Clydesdales_Boston.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}