{"url": "https://www.slashfilm.com/stranger-things-season-2-clip/", "text": "How does Eleven return? Why does she have a perm? And why did she look so angry in the latest trailer for Stranger Things season 2? These are all questions that will likely be answered when Netflix’s ’80s-inspired hit returns in late October (I’m mostly curious about the perm), but you find out the answer to the first question in this new clip, which was released at the U.K.’s MCM Comic-Con.\n\nIntroduced by a p0st-perm Millie Bobby Brown, the new clip from the second season of Stranger Things depicts a confused, pre-perm Eleven as she uses her powers to escape from the Upside Down, which is where she presumably landed after exploding the Demagorgon and saving the town of Hawkins, Indiana, in the season 1 finale.\n\nWatch the New Stranger Things Season 2 Clip\n\nHere we go! @milliebbrown introduces world exclusive, never before seen footage from @Stranger_Things 2! pic.twitter.com/ibaEkLNr9l — MCM Comic Con (@MCMComicCon) October 16, 2017\n\nAll the elements of the portal between the Upside Down and Hawkins are familiar: the red, glowing light, the placenta-like material of the opening, and the hand reaching out, a shot we’d seen before in the trailers (and now we know the context).\n\nNot to be fixated on the perm…but I’m going to be fixated on the perm. We see that Eleven’s hair is still shorn close to her head when she escapes the Upside Down, so it’s soon after the events of the season 1 finale. Mike (Finn Wolfhard), Dustin (Gaten Matarazzo), Lucas (Caleb McLaughlin) mourned Eleven, assuming she had been blown to bits like the Demagorgon, but Sheriff Hopper (David Harbour) seemed to hold out hope that Eleven had lived, leaving her favorite Eggo waffles in the forest.\n\nIn the most recent trailer, we saw Eleven open the box of Eggos, grab them, and run — so she’s supposedly been living out in the woods for enough time for her to grow her hair and get a perm. (Yes, I realize it’s probably not a perm canonically, that’s just how Eleven’s hair grows. But those are some tight curls!)\n\nHere’s the synopsis of Stranger Things season 2:\n\nStranger Things 2 is set a year after Will’s return, and everything seems back to normal… but a darkness lurks just beneath the surface, threatening all of Hawkins. It’s 1984 and the citizens of Hawkins, Indiana are still reeling from the horrors of the demagorgon and the secrets of Hawkins Lab. Will Byers has been rescued from the Upside Down but a bigger, sinister entity still threatens those who survived.\n\nSeason 1 cast members Winona Ryder, David Harbour, Finn Wolfhard, Millie Bobby Brown, Gaten Matarazzo, Caleb McLaughlin, Natalia Dyer, Charlie Heaton, and Joe Keery are all returning for the second season. New cast members include Sean Astin, Paul Reiser and Sadie Sink.\n\nStranger Things season 2 will premiere on Netflix on October 27, 2017.", "images": ["https://www.slashfilm.com/siteimages/pm-comments.jpg", "https://d13ezvd6yrslxm.cloudfront.net/authors/43.jpg", "https://sstatic1.histats.com/0.gif?1648144&101", "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/stranger-things-clip-700x346.png", "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/stranger-things-clip.png"], "top_img": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/stranger-things-clip.png", "keywords": [], "authors": ["Hoai-Tran Bui"], "canonical_link": "https://www.slashfilm.com/stranger-things-season-2-clip/", "title": "Stranger Things Season 2 Clip: Eleven Escapes the Upside Down", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 254451208349115}, "description": "A new Stranger Things season 2 clip reveals how Eleven escapes the Upside Down after she gets trapped there when she destroyed the Demagorgon in the finale.", "news_keywords": "millie bobby brown, stranger things, movies, film, tv", "original-source": "https://www.slashfilm.com/stranger-things-season-2-clip/", "og": {"locale": "en_US", "type": "article", "title": "Stranger Things Season 2 Clip: Eleven Escapes the Upside Down", "description": "A new Stranger Things season 2 clip reveals how Eleven escapes the Upside Down after she gets trapped there when she destroyed the Demagorgon in the finale.", "url": "https://www.slashfilm.com/stranger-things-season-2-clip/", "site_name": "/Film", "updated_time": "2017-10-16T08:10:07-07:00", "image": {"identifier": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/stranger-things-clip.png", "secure_url": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/stranger-things-clip.png", "width": 1440, "height": 712}}, "article": {"publisher": "https://www.facebook.com/slashfilm", "tag": "Stranger Things", "section": "Horror", "published_time": "2017-10-16T08:30:40-07:00", "modified_time": "2017-10-16T08:10:07-07:00"}, "twitter": {"card": "summary_large_image", "description": "A new Stranger Things season 2 clip reveals how Eleven escapes the Upside Down after she gets trapped there when she destroyed the Demagorgon in the finale.", "title": "Stranger Things Season 2 Clip: Eleven Escapes the Upside Down", "site": "@slashfilm", "image": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/stranger-things-clip.png", "creator": "@slashfilm"}, "msapplication-TileImage": "https://d13ezvd6yrslxm.cloudfront.net/wp/wp-content/images/cropped-ZZ46A5EC75-270x270.jpg"}, "movies": [], "publish_date": 1508167840.0, "source": "https://www.slashfilm.com", "summary": ""}