{"url": "https://en.wikipedia.org/wiki/60th_Annual_Grammy_Awards", "text": "The 60th Annual Grammy Awards ceremony was held on January 28, 2018. The CBS network broadcast the show live from Madison Square Garden in New York City. The show was moved to January to avoid coinciding with the 2018 Winter Olympics in Pyeongchang, as was the case in 2010 and 2014.[2] James Corden returned as host.[3]\n\nThe ceremony recognizes the best recordings, compositions and artists of the eligibility year, which ran from October 1, 2016, to September 30, 2017. The nominations were announced on November 28, 2017. The \"pre-telecast\" ceremony (officially named The Premiere Ceremony) was held on the same day prior to the main ceremony.[4][5]\n\nBruno Mars was nominated for six awards and won all six on the night.[6][7]\n\nPerformers [ edit ]\n\nPremiere ceremony [ edit ]\n\nMain ceremony [ edit ]\n\nPresenters [ edit ]\n\nNominations and winners [ edit ]\n\nNominees list adapted from the Recording Academy's website.[14][15]\n\nGeneral [ edit ]\n\nPop [ edit ]\n\nDance/Electronic Music [ edit ]\n\nBest Dance Recording\n\nBest Dance/Electronic Album\n\nContemporary Instrumental Music [ edit ]\n\nBest Contemporary Instrumental Album\n\nRock [ edit ]\n\nAlternative [ edit ]\n\nBest Alternative Music Album\n\nBest R&B Performance\n\nBest Traditional R&B Performance\n\nBest R&B Song\n\nBest Urban Contemporary Album\n\nBest R&B Album\n\nRap [ edit ]\n\nBest Rap Song\n\nBest Rap Album\n\nCountry [ edit ]\n\nBest Country Solo Performance\n\nBest Country Duo/Group Performance\n\nBest Country Song\n\nBest Country Album\n\nNew Age [ edit ]\n\nBest New Age Album\n\nJazz [ edit ]\n\nBest Improvised Jazz Solo\n\nBest Jazz Vocal Album\n\nBest Jazz Instrumental Album\n\nBest Large Jazz Ensemble Album\n\nBringin' It – Christian McBride Big Band\n\nMONK'estra Vol. 2 – John Beasley\n\n– John Beasley Jigsaw – Alan Ferber Big Band\n\n– Alan Ferber Big Band Homecoming – Vince Mendoza & WDR Big Band Cologne\n\n– Vince Mendoza & WDR Big Band Cologne Whispers on the Wind – Chuck Owen and the Jazz Surge\n\nBest Latin Jazz Album\n\nJazz Tango – Pablo Ziegler Trio\n\nHybrido – From Rio to Wayne Shorter – Antonio Adolfo\n\n– Antonio Adolfo Oddara – Jane Bunnett & Maqueque\n\n– Jane Bunnett & Maqueque Outra Coisa – The Music of Moacir Santos – Anat Cohen & Marcello Gonçalves\n\n– Anat Cohen & Marcello Gonçalves Típico – Miguel Zenón\n\nGospel/Contemporary Christian Music [ edit ]\n\nBest Gospel Performance/Song\n\nBest Contemporary Christian Music Performance/Song\n\nBest Gospel Album\n\nBest Contemporary Christian Music Album\n\nBest Roots Gospel Album\n\nLatin [ edit ]\n\nAmerican Roots [ edit ]\n\nReggae [ edit ]\n\nWorld Music [ edit ]\n\nChildren [ edit ]\n\nSpoken Word [ edit ]\n\nBest Spoken Word Album (includes Poetry, Audio Books and Storytelling)\n\nComedy [ edit ]\n\nMusical Theatre [ edit ]\n\nMusic for Visual Media [ edit ]\n\nComposing [ edit ]\n\nBest Instrumental Composition\n\nArranging [ edit ]\n\nBest Arrangement, Instrumental or A Cappella\n\n\"Escapades for Alto Saxophone and Orchestra\" from Catch Me If You Can John Williams, arranger (John Williams)\n\n\"Ugly Beauty\"/\"Pannonica\" John Beasley, arranger (John Beasley)\n\n\"All Hat, No Saddle\" Chuck Owen, arranger (Chuck Owen and the Jazz Surge)\n\n\"Home Free (For Peter Joe)\" Nate Smith, arranger (Nate Smith)\n\n\"White Christmas\" Chris Walden, arranger (Herb Alpert)\n\n\n\nBest Arrangement, Instruments and Vocals\n\nPackaging [ edit ]\n\nNotes [ edit ]\n\nBest Album Notes\n\nLive at the Whisky a Go Go: The Complete Recordings Lynell George, album notes writer (Otis Redding)\n\nArthur Q. Smith: The Trouble with the Truth Wayne Bledsoe & Bradley Reeves, album notes writers (Various Artists)\n\nBig Bend Killing: The Appalachian Ballad Tradition Ted Olson, album notes writer (Various Artists)\n\nThe Complete Piano Works of Scott Joplin Bryan S. Wright, album notes writer (Richard Dowling)\n\nEdouard-Léon Scott De Martinville, Inventor of Sound Recording: A Bicentennial Tribute David Giovannoni, album notes writer (Various Artists)\n\nWashington Phillips and His Manzarene Dreams Michael Corcoran, album notes writer (Washington Phillips)\n\n\n\nHistorical [ edit ]\n\nBest Historical Album\n\nLeonard Bernstein – The Composer Robert Russ, compilation producer; Martin Kistner & Andreas K. Meyer, mastering engineers (Leonard Bernstein)\n\nBobo Yeye: Belle Epoque in Upper Volta Jon Kirby, Florent Mazzoleni, Rob Sevier & Ken Shipley, compilation producers; Jeff Lipton & Maria Rice, mastering engineers (Various Artists)\n\nGlenn Gould – The Goldberg Variations – The Complete Unreleased Recording Sessions June 1955 Robert Russ, compilation producer; Matthias Erb, Martin Kistner & Andreas K. Meyer, mastering engineers (Glenn Gould)\n\nSweet as Broken Dates: Lost Somali Tapes from the Horn of Africa Nicolas Sheikholeslami & Vik Sohonie, compilation producers; Michael Graves, mastering engineer (Various Artists)\n\nWashington Phillips and His Manzarene Dreams Michael Corcoran, April G. Ledbetter & Steven Lance Ledbetter, compilation producers; Michael Graves, mastering engineer (Washington Phillips)\n\n\n\nEngineered Album [ edit ]\n\nProducer [ edit ]\n\nRemixer [ edit ]\n\nSurround Sound [ edit ]\n\nClassical [ edit ]\n\nCrazy Girl Crazy – Music by Gershwin, Berg & Berio Barbara Hannigan\n\nBach & Telemann: Sacred Cantatas Philippe Jarousky, soloist; Petra Müllejans, conductor\n\nGods & Monsters Nicholas Phan, soloist; Myra Huang, accompanist\n\nIn War & Peace – Harmony Through Music Joyce DiDonato, soloist; Maxim Emelyanychev, conductor\n\nSviridov: Russia Cast Adrift Dmitri Hvorostovsky, soloist; Constantine Orbelian, conductor\n\n\n\nHigdon: All Things Majestic, Viola Concerto & Oboe Concerto Giancarlo Guerrero, conductor; Tim Handley, producer\n\nBarbara Alexandre Tharaud, conductor; Cécile Lenoir, producer\n\nKurtág: Complete Works for Ensemble & Choir Reinbert de Leeuw, conductor; Guido Tichelman, producer\n\nLes Routes de l'Esclavage Jordi Savall, conductor; Benjamin Bletton, producer\n\nMademoiselle: Première Audience – Unknown Music of Nadia Boulanger Lucy Mauro, pianist and producer\n\n\n\nMusic Video/Film [ edit ]\n\nSpecial Merit Awards [ edit ]\n\nTony Agnello\n\nRichard Factor\n\nMusic Educator Award [ edit ]\n\nMelissa Salguero (of P.S. 48 Joseph R. Drake in Hunts Point, Bronx)[16]\n\nGrammy Hall of Fame inductions [ edit ]\n\nIn Memoriam [ edit ]\n\nMultiple nominations and awards [ edit ]\n\nThe following received multiple nominations:\n\nTwo:\n\nThe following received multiple awards:\n\nChanges [ edit ]\n\nIn June 2017, the Grammy organization announced a few minor changes to the voting and awarding process.[17]\n\nAs of 2018, voting members will cast their votes online rather than by paper ballot. This transition will provide greater flexibility for touring artists, eliminate the possibility of invalid ballots, and protect further against fraudulent voting.\n\nAll music creators, including songwriters, producers, engineers, mixers, mastering engineers and featured artists, which are credited with at least 33 percent or more playing time on the winning album will be eligible to receive a Grammy in the Album of the Year category. This is the first time songwriters are recognized in this category.\n\nFrom this year on, Nominations Review Committees will be created and implemented for the Rap, Contemporary Instrumental, and New Age Fields.\n\nFrom this year, the definition of Album is expanded in Classical, Dance, And Jazz Fields. To be eligible for Grammy consideration, an album must comprise a minimum total playing time of 15 minutes with at least five distinct tracks or a minimum total playing time of 30 minutes with no minimum track requirement.\n\nAn exception on the rule of only one version of a song allowed to enter in the Grammy Awards nomination process will be made in the Best Song Written for Visual Media category, allowing the film version of a track to be entered in the category, even if a different version of the track is submitted in other categories. In the Best Compilation Soundtrack for Visual Media category, eligibility guidelines have been amended to require soundtrack albums for a documentary or biopic to contain 51 percent or more of newly recorded music.\n\nNew York as a Host City [ edit ]\n\nThe 60th Annual Grammy Awards marked the first time since 2003 that the ceremony was held in New York City. The Staples Center in Los Angeles had been the home of the Grammys since 2000. The 2003 ceremony was also held at New York City's Madison Square Garden. The fifteen-year gap between the 2003 and 2018 Grammys in New York marked the longest period of time New York went without hosting the awards.\n\nWith the main telecast being held at Madison Square Garden, the premiere ceremony (also known as the Pre-Telecast) was held at the Hulu Theater.\n\nThe MusiCares Person of the Year tribute is typically held at the Los Angeles Convention Center two days prior to the Grammys, but since the 2018 Grammy Awards were held in New York, the MusiCares tribute was held at Radio City Music Hall.\n\nControversy and cost overruns [ edit ]\n\nHosting the Grammy Awards in New York City resulted in the Grammy Awards costing more to organize as costs associated with hosting it in Los Angeles are significantly less. The awards cost $8 million more to host in New York City. The host committee that the city assembled failed to raise the money that they had initially promised. The MusiCares Person of the Year tribute which the Barclays Center (which is operated by AEG) was hoping to host ended up being held at Radio City Music Hall, which is owned by The Madison Square Garden Company. MusiCares funds which were intended for charitable purposes were instead used to pay for the $8 million cost overruns associated with hosting the Grammys in New York City.[18][19]\n\nDana Tomarken, the former Executive VP of MusiCares claims that Recording Academy President Neil Portnow directed these funds away from MusiCares to pay for the cost-overruns. Dana Tomarken had been negotiating a deal to have the MusiCares Person of the Year tribute to Fleetwood Mac to be held at the Barclays Center, but Portnow decided to have it at Radio City Music Hall, without consulting Tomarken. Irving Azoff who heads Azoff MSG Entertainment (which is affiliated with The Madison Square Garden Company) informed her of this change rather than Portnow consulting her first. Tomarken has since made a claim of wrongful termination.[20][21] On June 5, 2018, an independent investigation was launched to examine the claims made by Dana Tomarken. The investigation will examine the MusiCares Person of the Year tribute as well as sexual harassment allegations.[22] In May 2019, Tomarken claimed she was fired because she pushed back against the academy's \"boys club\". The academy allegedly tried to keep Tomarken's allegations from being fully made public. She also claimed that she struggled to find a suitable venue in New York for the MusiCares Person of the Year tribute to Fleetwood Mac. The Barclays Center offered up an acceptable deal, but Irving Azoff of the Madison Square Garden Company prevented the event from being held there. By having it at Radio City instead, the event was not a traditional VIP dinner, nor did it have a silent auction. This then prevented the event from turning a profit.[23]\n\nOn June 4, 2018, the mayor's office weighed in on the controversy, saying their position was always to be \"venue neutral\" and denied any involvement in the venue controversy. The Barclays Center notified City Hall of their interest in being involved with Grammy week and Julie Menin (the New York City Commissioner for the Mayor's Office of Media and Entertainment) passed that information along to Grammy organizers.[24]\n\nRatings [ edit ]\n\nThe show was moved to January to avoid competing with the 2018 Winter Olympics in Pyeongchang, as was the case in 2010 and 2014. Viewership for the ceremony dropped 24% compared to the previous year, obtaining the smallest audience in the show's history in the key demographic.[citation needed]", "images": ["https://upload.wikimedia.org/wikipedia/en/e/ee/60th_Annual_Grammys.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/e/ee/60th_Annual_Grammys.png/220px-60th_Annual_Grammys.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/e/ee/60th_Annual_Grammys.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/60th_Annual_Grammy_Awards", "title": "60th Annual Grammy Awards", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/e/ee/60th_Annual_Grammys.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}