{"url": "https://fashionmagazine.com/culture/meghan-markle-prince-harry-royal-rules/", "text": "Photography via Twitter/@kensingtonroyal\n\nCan You Spot the Royal Protocol Meghan Markle Broke at the British Fashion Awards?\n\nPrince Harry has always been a royal renegade. When he was 17, the red-headed prince was taken to a rehab centre after he admitted he had smoked marijuana and illegally drank alcoholic beverages. When he was 27, TMZ released naked pictures of the royal, who was reportedly playing strip billiards in a Las Vegas hotel suite. For over two decades, Harry has been rewriting the royal rule book — and in the process, became known to the world as the fun and charming prince. (No offence, Will.)\n\nAnd now, Harry has found the perfect partner-in-crime. With American-actress Meghan Markle on his arm, the British Monarchy is receiving the modern treatment it so desperately needs. From pantyhose to PDA, we have an ongoing list tracking every time that the Duke and Duchess of Sussex stray from royal protocol:\n\nMeghan paints her nails burgundy\n\nOn our roundup of weird royal facts, it’s listed that Queen Elizabeth has been wearing the same $8 nail polish for nearly 30 years. It’s a nearly-sheer, light pink polish — Essie’s “Ballet Slippers” to be exact — and according to the brand’s website, in 1989 Queen Elizabeth’s hairdresser sent the company a letter requesting a bottle of “the only colour Her Majesty would wear.”\n\nIt’s not just the only colour she’ll wear—it’s the only colour she’ll tolerate in Buckingham Palace. According to OK! magazine, there is a rule in place stating that coloured nail polish does not meet royal standards and is considered “vulgar.”\n\nPhotography via Twitter/@kensingtonroyal\n\nWhen Meghan Markle made a surprise appearance at the British Fashion Awards to present her wedding dress designer, Clare Waight Keller, the British Womenswear Designer of the Year award, all eyes were on her pregnancy glow. As she cupped the growing royal baby in her black Givenchy gown, royal rule followers were quick to question: is that… dark nail polish on the Duchess of Sussex’s fingers? Maybe the burgundy hue is an act of royal rebellion, maybe it’s some mystical lighting mishap, or maybe, she just thought it was a seasonally appropriate winter nail colour. Either way, we plan on copping the look this Christmas.\n\nMeghan closes her own door\n\nWhen Meghan Markle arrived at London’s Royal Academy for her first solo engagement as Duchess of Sussex, she made a small gesture of independence that shook the Internet. Without her prince on her arm, Markle rolled up in a fancy black car in a fancy black Givenchy dress. And then, she did a thing that (apparently) few royals have done before: she shut the car door.\n\nVideo: #duchessofsussex arrives at the RA. A princess who still takes the time to shut her car door. Well done Meghan! pic.twitter.com/kJZXctr8AH — Emily Andrews (@byEmilyAndrews) September 25, 2018\n\nDoesn’t really seem worthy of a headline, does it. But according to Twitter—where this earth-shattering news was the top trending story—it’s almost totally unheard of for an on-duty royal to nudge a car door closed. Is this further evidence that she is a down-the-earth princess? Because if is, Kate Middleton deserves some props too.\n\nMeghan has an opinion about abortion\n\nGreat to chat with Meghan Markle, Duchess Of Sussex, about Repeal and the importance of her feminist activism. So important to have people in her position championing women’s rights. Total sounder! pic.twitter.com/Vjdquo45CP — Una Mullally (@UnaMullally) July 10, 2018\n\nIt’s totally okay for royals to have political opinions—as long as they don’t publicly share them. As part of their offical royal tour of England, Meghan Markle and Prince Harry attended a fancy garden party in Dublin. At the event, Markle struck up conversation with a few pro-choice activists and politicians who supported Ireland’s recent abortion referendum.\n\nOne feminist journalist tweeted about her positive interaction with the feminist Duchess, while senator Catherine Noone tweeted: “The Duchess and I had a chat about the recent referendum result — she watched with interest and was pleased to see the result.” The Irish politician realized the epic mistake she’d made, and quickly deleted the tweet, sending out instead: “I should say she seemed pleased — she was interested and very measured, not political at all.” She later deleted the second tweet too.\n\nMarkle is a vocal feminist, so we probably could’ve predicted her stance on women’s reproductive rights. (And secretly, we hope this is a rule she keeps on breaking.)\n\nMeghan wears a sleeveless dress to her first Trooping the Colour\n\nPhotography via Max Mumby/Indigo/Getty Images\n\nMeghan Markle made her Buckingham balcony debut on June 9 in celebration of Queen Elizabeth’s birthday. The of-the-shoulder silhouette of her pale pink, princess-worthy outfit from designer Carolina Herrera was, in fact, not so princess worthy after all. Tabloids were quick to call out the Duchess of Sussex’s dress as a break from unspoken royal protocol, with Page Six claiming: “fashion tradition usually dictates that Royal women do not wear off-shoulder or other more revealing styles.”\n\nFor the past seven years, Kate Middleton has worn dresses with sleeves that reach past the elbow, People notes, as did Princess Diana when she attended the festivities. But let’s not get our pantyhose—which Meghan Markle is wearing now!— in a twist, fashion rules were made to be broken.\n\nMeghan’s coat of arms does not include her family name\n\nWith the tiara and the title also comes other cool royal perks, like your very own emblem. Now that she’s officially a member of the British monarchy, the Duchess of Sussex has received a personalized coat of arms. Traditionally, the symbolic gift goes to the father of the bride ahead of the royal wedding—Kate Middleton’s coat of arms not only reflects the Middleton family, but also her mother Carole’s maiden name (Goldsmith). With the newest addition to the family, however, the palace has decided to bestow the honour on only Markle herself.\n\nA Coat of Arms has been created for The Duchess of Sussex: https://t.co/mJb3mqZfaZ pic.twitter.com/0EgbiS29Rb — Kensington Palace (@KensingtonRoyal) May 25, 2018\n\nThe coat of arms, however, does pay homage to Markle’s roots. The custom design includes a blue background (the Pacific Ocean) and two golden rays (sunshine), which Kensington Palace says is representative of the Duchess’ home state of California.\n\nA two ring royal wedding ceremony\n\nUsually, royal men don’t sport wedding bands after they marry. Harry’s grandfather, father and brother have all opted to follow this tradition by not wearing a ring after they wed their respective wives. However, Markle and Harry have chosen to break this tradition, exchanging rings in the ceremony that they will continue to wear. This signifies equality in the marriage and is a modern step for the monarchy.\n\nMeghan wore a crossbody bag\n\nThe princess-to-be arrived at Edinburgh Castle on February 13, 2018 wearing an appropriately chic and seemingly inoffensive outfit: Burberry coat, Veronica Beard pants, Birks rings and a Strathberry bag. But it’s not what Markle was wearing that broke protocol, per se, it was how she was wearing it.\n\nPhotography via Max Mumby/Indigo/Getty Images\n\nGASP! A crossbody! What a shockingly common and un-royal — AKA comfortable and practical — way to carry one’s lipgloss and cellphone.\n\nAccording to royal expert William Hanson, royals always carry a clutch as a means to avoid shaking hands. “It is protocol that you do not extend your hand to any member of the royal family (blood royal or those who have married into the family) unless their hand extends first,” Hanson told the Daily Mail. “The Duchess of Cambridge may well prefer not to shake hands with certain people—but there are other ways to achieve this, as used by the Queen and other members of the royal family, [rather] than opting for a clutch over a bag with a strap.”\n\nChristmas with the Queen\n\nAfter weeks of rumours, Kensington Palace officially confirmed last December what we all were wishing for: an un-wed Meghan Markle would be spending Christmas with her prince. Markle’s invitation was, of course, a break from royal tradition, with Markle being not yet being married into the monarchy. But it seems with Prince Harry, rules don’t apply, because a palace spokesperson told AP that “you can expect to see the Duke and Duchess of Cambridge, Prince Harry and Ms. Markle at Sandringham on Christmas Day.”\n\nMeghan ignored the pantyhose policy\n\nThe royal family has an unspoken policy about wearing pantyhose in public. It’s not a style-code that’s set in stone, per say, but it’s a tradition that’s long been upheld by Queen Elizabeth, Kate Middleton and the ruling ladies that came before them.\n\nPhotography by Samir Hussein/Samir Hussein/WireImage\n\nUntil now! When Meghan Markle stepped out with Prince Harry for their official engagement photocall, the world ogled every inch of the American actress’ outfit. The Internet went wild for Markle’s snow white overcoat by LINE the Label and her opal earrings from Birks, but royal watchers were quick to note the one thing she wasn’t wearing: pantyhose.\n\nThey’re tied the knot in May\n\nThere’s nothing better than a spring wedding, right? WRONG. It turns out, a marriage in May would not have been approved by the Prince’s great-great-great granny, Queen Victoria. The late, great monarch believed it was unlucky to marry in the fifth month of the calendar year, buying into the superstitious rhyme: “Marry in May, and rue the day.”\n\nMeghan’s been married before\n\nBefore hooking up with Harry, Meghan was in a long-term relationship with producer Trevor Engelson. They Hollywood powercouple married in 2011, after seven years of dating, and divorced in August of 2013. Now, Engelson is making a show about a man who has to share custody of his child after his ex-wife marries into the British monarchy. According to Deadline, this is the plot: “Divorce is hard. Sharing custody is harder. Sharing custody with the British Royal family when your wife marries a prince, in the unforgiving spotlight of London’s tabloid media, is next level.” GROSS.\n\nPhotography by Amanda Edwards/Getty Images\n\nPreviously, members of the Royal Family have not been allowed to marry divorcees. As you may recall — from history books, or from season one of The Crown — Princess Margaret had to break off her relationship with Peter Townsend because he was divorced, and Edward VIII abdicated from the throne in order to marry American socialite Wallis Simpson. But it’s not that big of a deal anymore: Prince Harry and Prince William’s father, Prince Charles, married fellow divorcee Camilla, Duchess of Cornwall, in a civil ceremony in 2005.\n\nThis means that Prince Harry will be the first royal family member to have a church wedding with a divorcee. In 2002, the Church of England agreed that divorced people could remarry in church — with the discretion of the priest, of course. After all, it’s only 2017.\n\nMeghan isn’t Anglican\n\nFor centuries, it was forbidden for royals to marry a Roman Catholic. However in 2015, an amendment to the Act of Settlement of 1701 made that allowed British royals to have an interfaith marriage. Markle has never *actually* discussed her religious affiliations openly, though it has been widely reported that her father is Jewish and she attended an all-girls Catholic high school in Los Angeles.\n\nBefore her Windsor Castle wedding to Prince Harry, Meghan will be baptized and confirmed in the Church of England. By completing these religious sacraments, Markle honours Queen Elizabeth, who, as the sovereign, holds the title of “Defender of the Faith and Supreme Governor of the Church of England.”\n\nThey’re all about the PDA\n\nOkay, so calling a hand-holding PDA is a little extreme. But hey, *technically* it is a public display of affection!\n\nPhotography by Chris Jackson/Getty Images\n\nThere are no specific anti-PDA rules, but public displays of affection have previously been avoided by the royal family at official events, due to their position as working representatives of the British monarchy. For example: Prince William and Kate Middleton have been photographed holding hands less than a dozen times in the past 10 years (!!!).\n\nPrince Harry and Meghan Markle have ignored this unspoken rule at pretty much every opportunity. When they made their first public appearance, the couple shared a smooch. During their joint appearance at Toronto’s Invictus Games, they were photographed holding hands. Even when they stepped out together as an engaged couple, Markle and Harry couldn’t keep their hands off of each other. Not that we’re complaining or anything…more PDA-filled moments please!\n\nMeghan’s Vanity Fair cover\n\nIt’s not unprecedented for a royal to grace a magazine cover (after all, Kate Middleton was in British Vogue), but to open up about her private life with Harry pre-engagement was a big shock for royal watchers. Here’s the major takeaway: Prince Harry and Markle are madly in love and they’re not afraid to share it with the world.\n\n“We’re two people who are really happy and in love,” she said. “We were very quietly dating for about six months before it became news, and I was working during that whole time, and the only thing that changed was people’s perception. Nothing about me changed. I’m still the same person that I am, and I’ve never defined myself by my relationship.”", "images": ["https://cdn.fashionmagazine.com/wp-content/uploads/2018/09/DuJIQArX4AAsa0b-1-480x320-c-top.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2018/05/GettyImages-970628184-480x0-c-default.jpg", "https://cdn.fashionmagazine.com/wp-content/themes/sjm-genus/img/dst/logos/logo_st-joseph-cropped.png", "https://cdn.fashionmagazine.com/wp-content/uploads/2020/02/unnamed.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2018/09/DuJIQArX4AAsa0b-1-800x534.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2018/09/DuJIPhQWwAEvSWr-480x0-c-default.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2018/07/001_B_coverLowRes_Thai_FASUM18-260x0-c-default.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2017/12/GettyImages-880237670-480x0-c-default.jpg", "https://cdn.fashionmagazine.com/wp-content/themes/sjm-genus/img/dst/misc/snapchat-qr-code.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2018/01/harry-480x0-c-default.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2018/07/CVR_AUG_FA0818_hi-260x0-c-default.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2017/12/GettyImages-853710046-480x0-c-default.jpg", "https://cdn.fashionmagazine.com/wp-content/uploads/2017/12/meghan-480x0-c-default.jpg", "https://cdn.fashionmagazine.com/wp-content/themes/sjm-genus/img/dst/fashion-logo.svg", "https://www.facebook.com/tr?id=1124567250995889&ev=PageView\r\n&noscript=1"], "top_img": "https://cdn.fashionmagazine.com/wp-content/uploads/2018/09/DuJIQArX4AAsa0b-1-800x534.jpg", "keywords": [], "authors": ["Date December"], "canonical_link": "https://fashionmagazine.com/culture/meghan-markle-prince-harry-royal-rules/", "title": "A Comprehensive List of Royal Rules Broken by Meghan Markle and Prince Harry", "meta_data": {"description": "Just a couple of royal rebels.", "viewport": "width=device-width, initial-scale=1.0", "thumbnail": "https://cdn.fashionmagazine.com/wp-content/uploads/2018/09/DuJIQArX4AAsa0b-1-900x600-c-default.jpg", "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "/mstile-144x144.png", "theme-color": "#ffffff", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "A Comprehensive List of Royal Rules Broken by Meghan Markle and Prince Harry", "description": "Just a couple of royal rebels.", "url": "https://fashionmagazine.com/culture/meghan-markle-prince-harry-royal-rules/", "site_name": "FASHION Magazine", "updated_time": "2020-02-12T18:53:50+00:00", "image": {"identifier": "https://cdn.fashionmagazine.com/wp-content/uploads/2018/09/DuJIQArX4AAsa0b-1-800x534.jpg", "secure_url": "https://cdn.fashionmagazine.com/wp-content/uploads/2018/09/DuJIQArX4AAsa0b-1-800x534.jpg", "width": 800, "height": 534}}, "article": {"tag": "royal rules", "section": "Culture", "published_time": "2018-12-11T15:52:44+00:00", "modified_time": "2020-02-12T18:53:50+00:00"}, "twitter": {"card": "summary_large_image", "description": "Just a couple of royal rebels.", "title": "A Comprehensive List of Royal Rules Broken by Meghan Markle and Prince Harry", "image": "https://cdn.fashionmagazine.com/wp-content/uploads/2018/09/DuJIQArX4AAsa0b-1.jpg"}}, "movies": [], "publish_date": 1544543564.0, "source": "https://fashionmagazine.com", "summary": ""}