{"url": "https://en.wikipedia.org/wiki/Trust_(U.S._TV_series)", "text": "American drama television anthology series\n\nTrust is an American anthology drama television series created by Simon Beaufoy that premiered on March 25, 2018 on FX. The 10-episode first season, written by Beaufoy and directed by Danny Boyle and others, is set in 1973 and recounts the abduction of John Paul Getty III, then-heir to Getty Oil, while he was in Italy.\n\nPremise [ edit ]\n\nTrust follows \"the trials and triumphs of one of America's wealthiest and unhappiest families, the Gettys. Told over multiple installments and spanning the 20th century, the series begins in 1973 with the kidnapping of John Paul Getty III, an heir to the Getty oil fortune, by the Italian Mafia in Rome.\"[1]\n\nCast and characters [ edit ]\n\nMain [ edit ]\n\nActors among the main cast are only credited for those episodes in which they appear.\n\nRecurring [ edit ]\n\nDavid Agranov as J. Ronald Getty, a son of J. Paul Getty\n\nDavid Bamber as Bela Von Block\n\nJohn Schwab as Lang Jeffries\n\nNorbert Leo Butz as Gordon Getty, a son of J. Paul Getty\n\nKiersten Wareing as Cockney Pauline\n\nGuest [ edit ]\n\nEpisodes [ edit ]\n\nNo. Title Directed by Written by Original air date U.S. viewers\n\n(millions) 1 \"The House of Getty\" Danny Boyle Simon Beaufoy March 25, 2018 ( ) 0.796[2] Following the suicide of eldest son George Getty, and disappointed with his other sons, J. Paul Getty is looking for an heir for his hugely successful oil business, the Getty Oil Company. He meets with his rebellious 16-year-old grandson J. Paul Getty III and shows him around his business. While in Italy, J. Paul Getty III gets kidnapped by gangsters led by Primo. 2 \"Lone Star\" Danny Boyle Brian Fillis & Simon Beaufoy April 1, 2018 ( ) 0.736[3] J. Paul Getty dispatches his chief of security, James Fletcher Chace, to Italy to investigate his grandson’s disappearance. To make precautions so that no one else in his family is kidnapped, Getty has bars placed on the windows of his mansion and advises his relatives to hire bodyguards for their own protection. Chace reports the findings of his investigation, but the boy's mother, Gail, is not convinced that the kidnapping is a hoax. 3 \"La Dolce Vita\" Danny Boyle Simon Beaufoy April 8, 2018 ( ) 0.602[4] Prior to his kidnapping, J. Paul Getty III enjoys his time in Italy. In the present, Primo, frustrated that J. Paul Getty refuses to pay ransom for what he considers to be a hoax, takes brutal charge of the kidnapping. 4 \"That's All Folks\" Dawn Shadforth Simon Beaufoy & John Jackson April 15, 2018 ( ) 0.495[5] After asking his uncle, Don Salvatore, to participate, Primo enlists his lawyer cousin (code-named “Fifty”) to be the kidnappers’ representative. Fifty has a no-eye-contact meeting with Gail at a movie theater and gives her a picture of her son posed with the body of one of Primo's dead associates. After receiving a faxed copy of the picture, J. Paul Getty dispatches Chace back to Italy to head up the negotiations. Meanwhile, butler Bullimore becomes friends with the Getty estate’s gardener, Dennis, whom the old man enjoys terrorizing with his dogs. 5 \"Silenzio\" Dawn Shadforth Alice Nutter April 22, 2018 ( ) 0.538[6] To help Don Salvatore, Primo and his uncle Leonardo mobilize the local community and their dogs when their minion Angelo makes off with J. Paul Getty III. Meanwhile, Gail and James await the next part of the captors' demands while J. Paul Getty declines help from people to pay the ransom. 6 \"John, Chapter 11\" Jonathan van Tulleken Simon Beaufoy & Harriet Braun April 29, 2018 ( ) 0.666[7] When a burnt body shows up on the beach, the Getty family fears the worst until Gail does another look at the corpse and finds that it has tied shoelaces which J. Paul Getty III hardly ties. It also has no foot scar which J Paul Getty III obtained when he was younger. It is then revealed that the body is not Little Paul's, but Angelo's. With J. Paul Getty III confirmed to be alive, and being confronted by J. Paul Getty II about what had happened to his previous sons, J. Paul Getty has James arrange a parley with Don Salvatore. 7 \"Kodachrome\" Jonathan van Tulleken Simon Beaufoy & Brian Fillis May 6, 2018 ( ) 0.382[8] In the past, J. Paul Getty does different interactions with his son and grandson like their trip to Italy and J. Paul Getty II working at a gas station owned by Getty Oil. In the present, J. Paul Getty moves ahead with his plans to have the ransom paid. 8 \"In the Name of the Father\" Emanuele Crialese Simon Beaufoy & John Jackson & Alice Nutter May 13, 2018 ( ) 0.567[9] Leonardo celebrates his son Francesco's confirmation with his family and his Italian mob contacts. Displeased that J. Paul Getty cancelled the ransom exchange, Don Salvator and his minions talk about what to do next as Francesco wants to prove himself to Leonardo. 9 \"White Car in a Snowstorm\" Susanna White Alice Nutter May 20, 2018 ( ) 0.544[10] After Francesco follows J. Paul Getty III's advice to cut off his right ear to buy him some time, Don Salvator has the ear delivered to the local newspaper disguised as delivery men due to a postal worker strike. While J. Paul Getty II is hesitant to oversee the ransom exchange, Gail and James do it while following instructions that involve riding a white car, wearing white, having the money in white suitcases and driving in the snowy parts of the mountains until they hear the sound of small rocks hitting their car. 10 \"Consequences\" Susanna White Simon Beaufoy & Alice Nutter May 27, 2018 ( ) 0.546[11] In the aftermath of the rescue, Chace narrates to the viewers what happened to each of the characters. Paul III has recovered in hospital and marries Gisela who bears their son Balthazar Getty. Paul I refuses to talk to his grandson on the telephone. He suffers the loss of Penelope and Belinda, and the poisoning of his dogs. Then has a violent tantrum after learning that the J. Paul Getty Museum has been reviewed as vulgar and brash in the newspapers. Only two of the kidnappers served time in prison while the rest were acquitted due to lack of evidence. After killing Fifty and Don Salvatore, Primo works with Leonardo to construct a sea port on the Tyrrhenian Sea and brings Francesco into the cocaine empire it services. Victoria has Paul II checked into a rehabilitation clinic. Bullimore reunites with Dennis at the Marylebone Cricket Club. Chace introduces himself to a boy named Alex, apparently as the father he has never known.\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nOn March 9, 2016, it was announced that FX had given the production a series order for a first season consisting of ten episodes. The series had been developed at FX due to a \"first look\" deal between Danny Boyle and the network. Boyle is expected to executive produce the series alongside Simon Beaufoy and Christian Colson. Beaufoy is also expected to write the series and Boyle is expected to direct. Production companies involved with the series include FX Productions, Cloud Eight Films, Decibel Films, and Snicket Films Limited.[12] On January 5, 2018, it was announced that the series would premiere on March 25, 2018.[13]\n\nCasting [ edit ]\n\nIn April 2017, it was announced that Donald Sutherland and Hilary Swank had joined the main cast in the roles of J. Paul Getty and Gail Getty, respectively.[14][15] On May 15, 2017, it was reported that Harris Dickinson had been cast in the starring role of J. Paul Getty III.[16] In June 2017, Brendan Fraser and Michael Esper joined the production as a series regulars in the roles of James Fletcher Chace and John Paul Getty II, respectively. Additionally, it was announced that Veronica Echegui had been cast in a recurring role.[17][18] On July 14, 2017, it was announced that Hannah New had joined the series in a recurring capacity.[19]\n\nFilming [ edit ]\n\nThe series began shooting in 2017 in Rome, Italy.[20]\n\nRelease [ edit ]\n\nPromotional poster.\n\nMarketing [ edit ]\n\nOn January 9, 2018, FX released the first official trailer for the series.[1]\n\nControversy [ edit ]\n\nOn March 16, 2018, it was reported that Ariadne Getty, John Paul Getty III's sister, was considering legal action against FX and the producers of the series. Her attorney Martin Singer released a statement calling the series a \"wildly sensationalized false portrayal\" of the Getty family and that \"It is ironic that you have titled your television series Trust. More fitting titles would be Lies or Mistrust, since the defamatory story it tells about the Gettys colluding in the kidnapping is false and misleading.\" In the statement, Singer went on to explain how his client objects to the alleged portrayal of the family as having played a role in the kidnapping themselves and that he considers it to be defamatory to falsely accuse someone of a crime.[21][22][23]\n\nSimon Beaufoy has stated that his decision to depict Getty as complicit in his own kidnapping was justified by his research into the matter, though none of the written biographies explicitly reach that conclusion. He stated that while reading Charles Fox's 2013 biography of Paul III, Uncommon Youth, \"It became clear, reading in between the lines... that he actually kidnapped himself...\"[24] According to his theory, the plot then spiraled out of Paul's control when his grandfather refused to pay, causing several of his captors to sell their interest to a syndicate of more ruthless Mafiosi.[24]\n\nRenewal plans [ edit ]\n\nOn January 5, 2018, the series' producers appeared at the annual Television Critics Association's winter press tour during a panel discussion of the show. Simon Beaufoy spoke about the tentative plans for a potential second season, saying, \"The idea is to go back to the 1930s to discover how John Paul Getty I became this extraordinary person with this huge hole in his soul.\" He went on to add that FX was pleased with how the first season had turned out and that he would be interested in returning for subsequent seasons.[25]\n\nReception [ edit ]\n\nThe first season of Trust has been met with a positive reception from critics. On the review aggregation website Rotten Tomatoes, the first season holds an 80% approval rating with an average rating of 6.51 out of 10, based on 59 reviews. The site's critical consensus reads, \"Donald Sutherland delivers a powerful turn as the titular Getty in Trust, yet another telling of the affluent family's saga.\"[26] Metacritic, which uses a weighted average, assigned the season a score of 67 out of 100 based on 24 critics, indicating \"generally favorable reviews\".[27]\n\nMatt Zoller Seitz, reviewing for the pop-culture website Vulture, called the show a \"decadent true-crime with an acidic sense of humor\" that \"alternates satire, drama, kookiness, and shocking violence.\"[28] USA Today complimented the quality of the casting, noting that \"Sutherland is predictably solid, but Fraser is the surprise, in what's perhaps his big comeback vehicle.\" It was also described as \"zippy and fast-paced,\" with a \"heightened and stylish feeling.\"[29] Brendan Fraser's performance as James Fletcher Chace has also received praise from critics; considering his long hiatus from film acting and retreat from celebrity, his role was welcomed as a successful comeback, with TV Guide humorously declaring it the start of a \"Brenaissance\".[30]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/f/f1/TrustTitleScreen.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f1/TrustTitleScreen.png/250px-TrustTitleScreen.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/5/52/Trust_FX.png/175px-Trust_FX.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/f/f1/TrustTitleScreen.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Trust_(American_TV_series)", "title": "Trust (American TV series)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/f/f1/TrustTitleScreen.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}