{"url": "https://variety.com/2018/tv/news/jersey-shore-revival-family-reunion-mtv-differences-1202745391/", "text": "Nearly a decade ago, the world was introduced to a group of unruly 20-somethings and the term “gym, tan, laundry.”\n\nMore than five years after “Jersey Shore” signed off the air, MTV is reuniting the group, who became worldwide household names as the reality show became a cultural phenomenon, drawing in nearly 9 million viewers per episode at its height.\n\nNicole “Snooki” Polizzi, Jennifer “JWoww” Farley, Mike “The Situation” Sorrentino, Paul “Pauly D” DelVecchio, Deena Nicole Cortese, Vinny Guadagnino, and Ronnie Ortiz-Magro are all back for “Jersey Shore Family Vacation,” the revival of “Jersey Shore” that will follow the escapades of the original cast on a month-long vacation in Miami Beach where they’ll all be living together in the same house, just like old times.\n\n“They were all in a place where they had grown, they had been through so much individually and collectively, so they were in a place where they wanted to reunite,” Nina Diaz, head of unscripted for MTV and VH1, tells Variety of bringing the original cast together. The executive says ever since the series went off the air, the network had hopes to bring back “Jersey Shore” in one way or another. “It’s one of the greatest reality shows of all time and one of the most beloved casts, and for most of us, it ended way too soon,” Diaz adds.\n\nSince “Jersey Shore” ended its run in 2012, MTV has given a spinoff to two of the stars with “Snooki & JWoww,” which ran for four seasons, and late last year, the network premiered an offshoot in “Floribama Shore,” which has already been renewed for a second season. Much has also changed since “Jersey Shore” went off the air — and the current political climate could actually serve the rowdy show in a positive way.\n\n“The timing was exactly right now because of people wanting escapism and really identifying with this idea of taking the time out of your hectic and chaotic and demanding lives to go do something with your friends,” Diaz says, pointing out that audiences are craving an escape in the midst of intense newscasts and constant political headlines. “Viewers are looking for something that just reinforces the basic joys of life and family and friendship and the permission to let loose.”\n\nDiaz also says the millennial MTV audience has grown up with the cast, and like the “Jersey Shore” players who are now married and have their own family, viewers’ lives have changed dramatically, but the desire to have fun is still present. “There are many viewers who are in their late 20s and 30s and juggling all these things, but still wanting to have strong relationships with friends and have experiences together and take a vacation and forget about it all.”\n\n“Jersey Shore Family Reunion” has already been renewed for another season — which will not take place in Miami — and should audiences connect with the cast the same way they did the first time around, MTV is open to many more seasons.\n\n“As long as the viewers are excited and invested in the ‘Jersey Shore’ cast journey, we’re there,” Diaz says.\n\nHere, the cast of “Jersey Shore” talks to Variety about reuniting, what’s different, and what’s not.\n\nWhat was your first reaction when you were approached to do another season of “Jersey Shore?”\n\nSnooki: We told MTV we were ready to come back, and with the help of the fans, they brought us our family vacation. I was super excited to be coming back with the crew. Reality shows rarely get second chances, especially after six years, so we are all truly grateful to be having this experience.\n\nJWoww: We were all really excited when we heard that MTV was bringing it back! We had a group chat saying how much we missed each other so we brought in the executive producer saying we wanted this more than anything and lets make it happen!\n\nThe Situation: I was not hesitant. I’m not sure I believed it was really happening. I had always hoped that they would do a reboot or another season, but it was all a dream.\n\nPauly D: I was excited, but actually didn’t believe it at first because there have been so many talks, but it never actually happened.\n\nRonnie: I always had a feeling like I said about the show coming back just because the love and fans always sticking around and never really fading away. People [are still] always screaming “one shot bro” or “oh yeah, cabs are here!”\n\nDeena: I was super excited. We’ve been wanting to do a reunion season for the last year and could not wait to be together again.\n\nVinny: It’s been long enough that no matter what, I was going to say yes. Getting back together with my friends mixed with the opportunity to bring back TV greatness made the decision a no brainer. I thought somewhere down the line when we were all much older, we would look back on it in some form, but little did I know we would film the exact same way again with the same madness and shenanigans.\n\nWhat’s different this time around?\n\nSnooki: There’s really no difference this time around. Even though we are older, we definitely aren’t wiser. Once we get together, it’s like we’re dysfunctional again.\n\nJWoww: A lot is different and a lot is the same. We have grown up. We have either gotten married and have kids now or are in serious relationships. Our priorities are different now.\n\nThe Situation: It’s so different, but still the same! Everyone is still unapologetically themselves and authentic, but we are all grownup — somewhat. Ronnie [had a baby], Vinnie has a girlfriend, I’m sober 28 months and in a stable healthy relationship, Pauly is single, so there are a lot of variables at play, but when you put us together, you get magic.\n\nPauly D: The girls cook and clean now.\n\nRonnie: This time around, we treated it like a vacation. It was a time to get together as the family we are and get away from our real lives and a chance to let loose.\n\nDeena: We are much closer now then we were years ago. We got close off camera and truly are family now.\n\nVinny: People in the house don’t hook up with each other because obviously mostly everyone is married or in a relationship, but besides that, nothing really changed at all. This was an escape from everyone’s real life, and we jumped right back into partying and went harder than ever. Oh, and Sam [Sammi “Sweetheart” Giancola] didn’t come.\n\nWhat’s the same?\n\nSnooki: We party hard, and we still fight like cats and dogs.\n\nJWoww: We all can still party like we used to — if not even more this time around.\n\nThe Situation: The chemistry, the humor, the drama, the realness.\n\nPauly D: Our chemistry.\n\nRonnie: The dynamic and the chemistry between the cast. It’s almost like we never stopped filming in the first place.\n\nDeena: We are still hot messes and even though we grew as people, we still are the same dysfunctional family we always were.\n\nVinny: Deena getting drunk and falling, Nicole drinking, me and Pauly’s bromance, Mike is still weird, Ronnie is still a meathead, and Jenni still starts drama.\n\nWhat can viewers expect to see in the episodes?\n\nSnooki: Viewers definitely won’t be disappointed with our drunken stay-outs, family drama, and a good time.\n\nJWoww: The dynamic between us all years later — the drama, the fun, and the way we let loose these days.\n\nThe Situation: Everything they have been missing on reality TV the past five years.\n\nPauly D: The same bunch of guidos and guidettes they loved in the other seasons.\n\nRonnie: Viewers can expect everything they loved and got for years in the past — love, hate, comedy, drama, phrases, tanning.\n\nDeena: Drinking, drama, and tons of meatball problems.\n\nVinny: Non-stop comedy, tears, drama, partying, and some major life events that happen in some of our lives.\n\nWhat’s been the biggest change in your life since the original show went off the air?\n\nJWoww: I’m married with two kids now!\n\nThe Situation: 28 months sober, and I’m in a healthy, stable relationship with my college sweetheart.\n\nPauly D: I went from being a local DJ to a world-renowned DJ.\n\nDeena: The biggest change in my life would be getting married to my amazing husband, but unfortunately along this journey, I lost my father. He was one of my biggest supporters, but luckily, my husband was there to pick up me and my mom, and be the rock we needed.\n\nVinny: I’m older and more mature now. I was 21 when I started the show and I am 30 now. I own houses, have real responsibilities. On the show, I am in a relationship. I feel better now than I ever did mentally and physically.\n\nHow has the TV landscape changed since the original show went off the air, and how will the new TV landscape impact the show?\n\nPauly D: TV is different now. A lot of shows are scripted and we are not — we are bringing back the “real” in reality TV.\n\nDeena: I definitely think TV has changed since we’ve been gone and I’m excited for us to bring fun back to TV. We want our show to be everyone’s outlet in this crazy world — for one hour, just sit back, don’t stress and just enjoy life.\n\nVinny: There weren’t multiple platforms for shows to air such as cable, on demand, Hulu, or Netflix. There also weren’t many social media outlets when the show started. We are so excited to now be part of this world where media and feedback is so instantaneous. We had the world talking back then and only Twitter existed. I can’t wait to see this play out with all of the new world’s resources at our fingertips. We are going to be memes, GIFs, and have the whole internet screaming about us once again.\n\nWhen you watch back old episodes of the original show, is there anything you regret?\n\nJWoww: All my decisions led me to where I am now and I have a lot to be thankful for, so I cant really regret anything.\n\nThe Situation: You live and you learn. I wouldn’t change a thing. In order to be old and wise, you must first be young and dumb.\n\nPauly D: No regrets at all. I love watching.\n\nRonnie: You can never live in regret. All you can do is use everything that happens in your life as a lesson. You can only grow if you learn from the mistakes you make.\n\nDeena: I don’t regret it, but it is definitely cringe-worthy [laughing]. That hot mess girl back then is what molded me into the awesome woman I am today.\n\nVinny: No. I was pretty tame. And any mistakes I did make were just learning experiences of a kid in his 20s.\n\nWould you let your kids do reality TV?\n\nSnooki: I prefer my kids to do something else other than reality because you have to be a certain breed to keep up with it, but I will support my children in whatever they put their minds to.\n\nJWoww: In the right setting, yes.\n\nThe Situation: Yes, but I would sit them down and explain the positives and negatives, and let them make the decision themselves.\n\nPauly D: Yes.\n\nRonnie: Of course. We are all going to start our own reality show when our kids are old enough and film them in one of our shore houses [laughing].\n\nDeena: Only if I chaperone them.\n\nVinny: Maybe, it would depends on how much they got paid and how worth it it would be.\n\nPOPULAR VIDEO ON VARIETY", "images": ["https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2018%2Ftv%2Fnews%2Fjersey-shore-revival-family-reunion-mtv-differences-1202745391%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202745391&comment_count=5", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://pmcvariety.files.wordpress.com/2018/04/jersey-shore-family-vacation.jpg?w=1000", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2018/04/jersey-shore-family-vacation.jpg?w=1000", "keywords": [], "authors": ["Elizabeth Wagmeister"], "canonical_link": "https://variety.com/2018/tv/news/jersey-shore-revival-family-reunion-mtv-differences-1202745391/", "title": "How ‘Jersey Shore’ Revival Will Find Its Groove in the Current Political Climate", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "The cast of \"Jersey Shore\" talks to Variety about reuniting, what's different, and what's not.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202745391, "author": "Elizabeth Wagmeister", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-04-05T15:54:37"}, "pmc-tag": "Jersey Shore,Jersey Shore Family Reunion,MTV,Snooki,The Situation", "title": "How ‘Jersey Shore’ Revival Will Find Its Groove in the Current Political Climate", "pageclass": "article", "pmc-vertical": "tv", "pmc-primary-category": "News", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "How ‘Jersey Shore’ Revival Will Find Its Groove in the Current Political Climate", "url": "https://variety.com/2018/tv/news/jersey-shore-revival-family-reunion-mtv-differences-1202745391/", "description": "Nearly a decade ago, the world was introduced to a group of unruly 20-somethings and the term “gym, tan, laundry.” More than five years after “Jersey Shore” signed off the a…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/04/jersey-shore-family-vacation.jpg?w=1000", "width": 1000, "height": 563, "alt": "Jersey Shore Family Vacation"}, "locale": "en_US"}, "article": {"published_time": "2018-04-05T22:54:37+00:00", "modified_time": "2018-04-05T22:56:49+00:00"}, "twitter": {"creator": "@EWagmeister", "site": "@variety", "text": {"title": "How ‘Jersey Shore’ Revival Will Find Its Groove in the Current Political Climate"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2018/04/jersey-shore-family-vacation.jpg?w=1000", "alt": "Jersey Shore Family Vacation"}, "card": "summary_large_image", "title": "How ‘Jersey Shore’ Revival Will Find Its Groove in the Current Political Climate", "description": "The cast of \"Jersey Shore\" talks to Variety about reuniting, what's different, and what's not."}, "author": "Elizabeth Wagmeister", "content_type": "Article", "post_id": 1202745391, "title": "How 'Jersey Shore' Revival Will Find Its Groove in the Current Political Climate", "published_at": "2018-04-05 15:54:37", "image": "https://pmcvariety.files.wordpress.com/2018/04/jersey-shore-family-vacation.jpg?w=1000", "comment_count": 5, "tags": "The Situation", "topics": "News", "appeared_in_print": "No", "body": "Nearly a decade ago, the world was introduced to a group of unruly 20-somethings and the term \"gym, tan, laundry.\"\r\n\r\nMore than five years after \"Jersey Shore\" signed off the air, MTV is reuniting the group, who became worldwide household names as the reality show became a cultural phenomenon, drawing in nearly 9 million viewers per episode at its height.\r\n\r\nNicole \"Snooki\" Polizzi, Jennifer \"JWoww\" Farley, Mike \"The Situation\" Sorrentino, Paul \"Pauly D\" DelVecchio, Deena Nicole Cortese, Vinny Guadagnino, and Ronnie Ortiz-Magro are all back for \"Jersey Shore Family Vacation,\" the revival of \"Jersey Shore\" that will follow the escapades of the original cast on a month-long vacation in Miami Beach where they'll all be living together in the same house, just like old times.\r\n\r\n\"They were all in a place where they had grown, they had been through so much individually and collectively, so they were in a place where they wanted to reunite,\" Nina Diaz, head of unscripted for MTV and VH1, tells Variety of bringing the original cast together. The executive says ever since the series went off the air, the network had hopes to bring back \"Jersey Shore\" in one way or another. \"It's one of the greatest reality shows of all time and one of the most beloved casts, and for most of us, it ended way too soon,\" Diaz adds.\r\n\r\nSince \"Jersey Shore\" ended its run in 2012, MTV has given a spinoff to two of the stars with \"Snooki & JWoww,\" which ran for four seasons, and late last year, the network premiered an offshoot in \"Floribama Shore,\" which has already been renewed for a second season. Much has also changed since \"Jersey Shore\" went off the air -- and the current political climate could actually serve the rowdy show in a positive way.\r\n\r\n\"The timing was exactly right now because of people wanting escapism and really identifying with this idea of taking the time out of your hectic and chaotic and demanding lives to go do something with your friends,\" Diaz says, pointing out that audiences are craving an escape in the midst of intense newscasts and constant political headlines. \"Viewers are looking for something that just reinforces the basic joys of life and family and friendship and the permission to let loose.\"\r\n\r\nDiaz also says the millennial MTV audience has grown up with the cast, and like the \"Jersey Shore\" players who are now married and have their own family, viewers' lives have changed dramatically, but the desire to have fun is still present. \"There are many viewers who are in their late 20s and 30s and juggling all these things, but still wanting to have strong relationships with friends and have experiences together and take a vacation and forget about it all.\"\r\n\r\n\"Jersey Shore Family Reunion\" has already been renewed for another season -- which will not take place in Miami -- and should audiences connect with the cast the same way they did the first time around, MTV is open to many more seasons.\r\n\r\n\"As long as the viewers are excited and invested in the 'Jersey Shore' cast journey, we're there,\" Diaz says.\r\n\r\nHere, the cast of \"Jersey Shore\" talks to Variety about reuniting, what's different, and what's not.\r\n\r\n \r\n\r\nWhat was your first reaction when you were approached to do another season of \"Jersey Shore?\"\r\n\r\nSnooki: We told MTV we were ready to come back, and with the help of the fans, they brought us our family vacation. I was super excited to be coming back with the crew. Reality shows rarely get second chances, especially after six years, so we are all truly grateful to be having this experience.\r\n\r\nJWoww: We were all really excited when we heard that MTV was bringing it back! We had a group chat saying how much we missed each other so we brought in the executive producer saying we wanted this more than anything and lets make it happen!\r\n\r\nThe Situation: I was not hesitant. I'm not sure I believed it was really happening. I had always hoped that they would do a reboot or another season, but it was all a dream.\r\n\r\nPauly D: I was excited, but actually didn't believe it at first because there have been so many talks, but it never actually happened.\r\n\r\nRonnie: I always had a feeling like I said about the show coming back just because the love and fans always sticking around and never really fading away. People [are still] always screaming \"one shot bro\" or \"oh yeah, cabs are here!\"\r\n\r\nDeena: I was super excited. We've been wanting to do a reunion season for the last year and could not wait to be together again.\r\n\r\nVinny: It's been long enough that no matter what, I was going to say yes. Getting back together with my friends mixed with the opportunity to bring back TV greatness made the decision a no brainer. I thought somewhere down the line when we were all much older, we would look back on it in some form, but little did I know we would film the exact same way again with the same madness and shenanigans.\r\n\r\n \r\n\r\nWhat’s different this time around? \r\n\r\nSnooki: There's really no difference this time around. Even though we are older, we definitely aren't wiser. Once we get together, it's like we're dysfunctional again.\r\n\r\nJWoww: A lot is different and a lot is the same. We have grown up. We have either gotten married and have kids now or are in serious relationships. Our priorities are different now. \r\n\r\nThe Situation: It's so different, but still the same! Everyone is still unapologetically themselves and authentic, but we are all grownup -- somewhat. Ronnie [had a baby], Vinnie has a girlfriend, I'm sober 28 months and in a stable healthy relationship, Pauly is single, so there are a lot of variables at play, but when you put us together, you get magic.\r\n\r\nPauly D: The girls cook and clean now.\r\n\r\nRonnie: This time around, we treated it like a vacation. It was a time to get together as the family we are and get away from our real lives and a chance to let loose.\r\n\r\nDeena: We are much closer now then we were years ago. We got close off camera and truly are family now.\r\n\r\nVinny: People in the house don't hook up with each other because obviously mostly everyone is married or in a relationship, but besides that, nothing really changed at all. This was an escape from everyone's real life, and we jumped right back into partying and went harder than ever. Oh, and Sam [Sammi \"Sweetheart\" Giancola] didn’t come.\r\n\r\n \r\n\r\nWhat’s the same?\r\n\r\nSnooki: We party hard, and we still fight like cats and dogs.\r\n\r\nJWoww: We all can still party like we used to -- if not even more this time around.\r\n\r\nThe Situation: The chemistry, the humor, the drama, the realness.\r\n\r\nPauly D: Our chemistry.\r\n\r\nRonnie: The dynamic and the chemistry between the cast. It's almost like we never stopped filming in the first place. \r\n\r\nDeena: We are still hot messes and even though we grew as people, we still are the same dysfunctional family we always were.\r\n\r\nVinny: Deena getting drunk and falling, Nicole drinking, me and Pauly's bromance, Mike is still weird, Ronnie is still a meathead, and Jenni still starts drama.\r\n\r\n \r\n\r\nWhat can viewers expect to see in the episodes?\r\n\r\nSnooki: Viewers definitely won't be disappointed with our drunken stay-outs, family drama, and a good time.\r\n\r\nJWoww: The dynamic between us all years later -- the drama, the fun, and the way we let loose these days.\r\n\r\nThe Situation: Everything they have been missing on reality TV the past five years.\r\n\r\nPauly D: The same bunch of guidos and guidettes they loved in the other seasons.\r\n\r\nRonnie: Viewers can expect everything they loved and got for years in the past -- love, hate, comedy, drama, phrases, tanning.\r\n\r\nDeena: Drinking, drama, and tons of meatball problems.\r\n\r\nVinny: Non-stop comedy, tears, drama, partying, and some major life events that happen in some of our lives.\r\n\r\n \r\n\r\nWhat’s been the biggest change in your life since the original show went off the air?\r\n\r\nJWoww: I'm married with two kids now!\r\n\r\nThe Situation: 28 months sober, and I'm in a healthy, stable relationship with my college sweetheart.\r\n\r\nPauly D: I went from being a local DJ to a world-renowned DJ.\r\n\r\nDeena: The biggest change in my life would be getting married to my amazing husband, but unfortunately along this journey, I lost my father. He was one of my biggest supporters, but luckily, my husband was there to pick up me and my mom, and be the rock we needed.\r\n\r\nVinny: I'm older and more mature now. I was 21 when I started the show and I am 30 now. I own houses, have real responsibilities. On the show, I am in a relationship. I feel better now than I ever did mentally and physically.\r\n\r\n \r\n\r\nHow has the TV landscape changed since the original show went off the air, and how will the new TV landscape impact the show?\r\n\r\nPauly D: TV is different now. A lot of shows are scripted and we are not -- we are bringing back the \"real\" in reality TV.\r\n\r\nDeena: I definitely think TV has changed since we've been gone and I'm excited for us to bring fun back to TV. We want our show to be everyone's outlet in this crazy world -- for one hour, just sit back, don't stress and just enjoy life.\r\n\r\nVinny: There weren't multiple platforms for shows to air such as cable, on demand, Hulu, or Netflix. There also weren't many social media outlets when the show started. We are so excited to now be part of this world where media and feedback is so instantaneous. We had the world talking back then and only Twitter existed. I can't wait to see this play out with all of the new world's resources at our fingertips. We are going to be memes, GIFs, and have the whole internet screaming about us once again.\r\n\r\n \r\n\r\nWhen you watch back old episodes of the original show, is there anything you regret?\r\n\r\nJWoww: All my decisions led me to where I am now and I have a lot to be thankful for, so I cant really regret anything.\r\n\r\nThe Situation: You live and you learn. I wouldn't change a thing. In order to be old and wise, you must first be young and dumb.\r\n\r\nPauly D: No regrets at all. I love watching.\r\n\r\nRonnie: You can never live in regret. All you can do is use everything that happens in your life as a lesson. You can only grow if you learn from the mistakes you make.\r\n\r\nDeena: I don't regret it, but it is definitely cringe-worthy [laughing]. That hot mess girl back then is what molded me into the awesome woman I am today.\r\n\r\nVinny: No. I was pretty tame. And any mistakes I did make were just learning experiences of a kid in his 20s.\r\n\r\n \r\n\r\nWould you let your kids do reality TV?\r\n\r\nSnooki: I prefer my kids to do something else other than reality because you have to be a certain breed to keep up with it, but I will support my children in whatever they put their minds to.\r\n\r\nJWoww: In the right setting, yes.\r\n\r\nThe Situation: Yes, but I would sit them down and explain the positives and negatives, and let them make the decision themselves.\r\n\r\nPauly D: Yes.\r\n\r\nRonnie: Of course. We are all going to start our own reality show when our kids are old enough and film them in one of our shore houses [laughing].\r\n\r\nDeena: Only if I chaperone them.\r\n\r\nVinny: Maybe, it would depends on how much they got paid and how worth it it would be.\r\n\r\n \r\n\r\nPOPULAR VIDEO ON VARIETY", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1522968877.0, "source": "https://variety.com", "summary": ""}