{"url": "dailynewsonline.com/brad-pitt-and-an-unexpected-approach-to-jennifer-aniston.html", "text": "Brad Pitt and Jennifer Aniston returned to make contact on February 11 and since then exchange messages “via Internet” after having ended their relationship in 2005. That reported the magazine US Weekly.\n\nThe American publication ensures that the 53-year-old actor sent a message to former Friends to greet her for her birthday and that since then there has been a dialogue between those who at one time shaped as one of the most solid and attractive couples in the world Of Hollywood.\n\n“They began to speak once he wished her a happy birthday”, they told the publication from their surroundings. “Brad confided in Jen and told him that he was going through some complicated times by the divorce (with Angelina Jolie) and they exchanged some texts in which they recalled their past”, the anonymous source said.\n\nIn this context there is a detail that is relevant: Aniston is married to Justin Theroux, protagonist of the The Leftovers series. And she was enjoying her birthday in Cabo San Lucas, Mexico, when her ex sent the greeting.\n\nThe funny thing was the reaction of Theroux, who is aware of the situation. According to the magazine, “Justin agrees to be friends” and know that “Jen just wants to be nice”.\n\nJen and Brad were married since 2000 to 2005, when she presented the petition for divorce, where argued “irreconcilable differences”.", "images": ["http://dailynewsonline.com/wp-content/plugins/a3-lazy-load/assets/images/lazy_placeholder.gif", "http://dailynewsonline.com/wp-content/uploads/2017/03/brad-and-jennifer.jpg"], "top_img": "http://dailynewsonline.com/wp-content/uploads/2017/03/brad-and-jennifer.jpg", "keywords": [], "authors": ["On", "In"], "canonical_link": "https://dailynewsonline.com/brad-pitt-and-an-unexpected-approach-to-jennifer-aniston.html", "title": "Brad Pitt and an unexpected approach to… Jennifer Aniston! – Daily News Online", "meta_data": {"viewport": "width=device-width, initial-scale=1", "generator": "WordPress 5.4"}, "movies": [], "publish_date": 1488537497.0, "source": "http://dailynewsonline.com", "summary": ""}