{"url": "https://en.wikipedia.org/wiki/Total_Request_Live", "text": "Total Request Live (known commonly as TRL) is an American television program broadcast on MTV that premiered on September 14, 1998. The series features popular music videos played during its countdown, and was also used as a promotion tool by musicians, actors, and other celebrities to promote their newest works to the show's target teen demographic.\n\nDuring the original run of the program, TRL played the ten most requested music videos of the day, as voted by viewers via phone or online. The show generally aired Monday through Thursday for one hour, though the scheduling and length of the show fluctuated over the years. Although TRL was billed as a live show, many episodes were actually pre-recorded. Due to declining ratings, and the larger secular decline of music-based television in favor of online services, MTV would announce the cancellation of TRL on September 15, 2008.[1] The special three-hour finale episode, Total Finale Live, aired on November 16, 2008.[2]\n\nLess than a decade later, TRL would be revived on October 2, 2017.[3] In 2019, the show aired Saturday mornings at 10am ET as TRL Top 10.\n\nHistory [ edit ]\n\nOrigin [ edit ]\n\nTotal Request Live originated from several pre-existing programs on MTV. Dial MTV, the first video request show on the network, had aired from 1986 to 1996. In 1997, MTV launched two new shows that became the predecessors of TRL: Total Request, a revival of the Dial MTV concept hosted by Carson Daly, and MTV Live, which was hosted by Toby Amies and featured live performances and interviews from musical artists.\n\nTotal Request was more subdued than MTV Live, as Daly introduced music videos from an empty, dimly lit set. As the show progressed and gained more momentum with viewers tuning in, it was soon added to the list of daytime programming during MTV's Summer Share in Seaside Heights, New Jersey. The countdown would prove to be one of the most watched and most interactive shows in recent MTV history, demonstrating that it had potential to become an even larger success by combining with the element of live television.\n\nOriginal Run (1998-2008) [ edit ]\n\nCarson Daly era [ edit ]\n\nIn Fall 1998, MTV producers merged the real-time aspect of MTV Live with the fan-controlled countdown power of Total Request into Total Request Live. The program made its debut from MTV Studios on September 14, 1998. The show then grew to become MTV's unofficial flagship program.\n\nThe original host of TRL, Carson Daly, brought popularity to the show. The widely known abbreviation of TRL was adopted as the official title of the show in February 1999, after Daly and Dave Holmes began using the abbreviation on-air regularly. In the years following, the program was rarely referred to by its complete title. The show's countdown started off successfully while receiving hundreds of votes for Original Favorite Stars such as Hanson, Aaliyah, Eminem, Christina Aguilera, Britney Spears, Korn, 'N Sync, and Backstreet Boys.[4]\n\nTRL spent its first year developing a cult-type following.[5] In the fall of 1999, a live studio audience was added to the show. By spring 2000, the countdown reached its peak, becoming a very recognizable pop culture icon in its first two years of existence. A weekend edition of the show known as TRL Weekend, with a countdown consisting an average of the week's Top 10, aired for a short time in 2000.[citation needed]\n\nIn 2001, the popularity of TRL was at such a level that it spawned a country music spin-off, CMT Most Wanted Live, on sister network CMT, until 2004.[citation needed]\n\nSome evolutionary changes were made to TRL throughout the next couple of years. The show received a new set and on-screen graphics for the debut of the fall 2001 season. A year later, on October 23, 2002, TRL celebrated its 1,000th episode. The number-one video on that day was \"Dirrty\" by Christina Aguilera. Also throughout the year of 2002, original host Carson Daly would be seen gradually less and less.[citation needed] The show had near-daily segments from MTV News correspondents reporting on the latest in national or entertainment and music news from inside the studio.\n\nPost-Carson Daly era [ edit ]\n\nIn 2003, the next generation of TRL was ushered in as Carson Daly officially stepped down as host.[6] He left the show to host his own talk show, NBC's Last Call with Carson Daly, which premiered a year earlier. Following Daly stepping down, a revolving door of VJs hosted TRL, including Damien Fahey, Hilarie Burton, Vanessa Minnillo, Quddus, La La Vasquez, and Susie Castillo. Some of these VJs made their debut on the show in earlier years, so they already had the opportunity to host the show on days in which Daly was not present.\n\nSome changes were made to TRL's voting process in 2005. The show previously allowed anyone to vote online multiple times, but as part of these changes, only registered members on MTV.com could vote online. Additionally, a limit of one vote per day was added. Then, on July 10, 2006, MTV announced that votes would no longer be taken by phone, ending the legacy of the \"DIAL MTV\" phone number, which had been in use for voting on MTV since the premiere of the countdown show Dial MTV in the mid-1980s.\n\nTRL's studios in Times Square in 2006. s studios in Times Square in 2006.\n\nIn September 2006, TRL reached its eighth anniversary and, at that point, it was the longest-running live program that MTV had ever produced. It is also the third-longest-running program of all time in the network's history, following behind The Real World, which has aired for the past 21 years, and 120 Minutes, which aired for 17 years. Around this time, TRL began airing officially on just four days a week (Monday through Thursday), as opposed to all five weekdays.\n\nOn November 2, 2006, TRL debuted what was billed as the first-ever hip hop public service announcement on global warming. The three-minute piece, titled \"Trees\", warned about deforestation and the dangers of global warming. The video corresponded with MTV's social campaign, Break the Addiction, as part of think MTV.\n\nThe hosts of TRL in 2008 were Damien Fahey and Lyndsey Rodrigues. Additionally, Stephen Colletti, former cast member on Laguna Beach, has appeared on TRL as host numerous times. The rest of the VJs are or have been working on separate projects. La La Vasquez went on to go work on her debut rap album[citation needed]. Hilarie Burton left TRL in 2004, after joining the cast of The WB/CW's One Tree Hill, playing Peyton Sawyer. Quddus hosted from 2001 to 2006. He left to move to California to be a host of TV One Access.[7]\n\nOn May 22, 2007, TRL celebrated its 2000th episode, showing highlights from the past 2000 episodes, and a special countdown of ten of the most successful videos to ever appear on the show. Justin Timberlake's \"Cry Me a River\" topped the special countdown.\n\nThe end of TRL [ edit ]\n\nIn 2007, rumors began circulating stating that the ratings-challenged music video countdown show was to be canceled. In early 2007, an average of 373,000 viewers regularly watched the program.[8] New York Daily News were one of the first to publish this rumor. In February 2007, MTV said the rumor was unfounded and claimed TRL will continue to air for the foreseeable future.\n\nThe producers of TRL experimented with web-based viewer interaction throughout the 2006–2007 season, showing viral videos, allowing viewers to send feedback on a video via internet forums and webcams, along with a heavy emphasis on MTV's since discontinued Overdrive video portal. However, MTV still secretly planned to cancel the show and replace one with even more emphasis on viewer interaction, named YouRL (a homophone of URL.)[9]\n\nConsequently, in July 2007, it was reported that YouRL was not received well by test audiences and that the concept of YouRL has been abandoned for the time being. Total Request Live proceeded with a new season as usual on September 4, marking the tenth season of the show.[10]\n\nTRL logo in 2008. logo in 2008.\n\nOn September 15, 2008 it was announced that TRL would be shut down. The final regular weekday episode aired on November 13, 2008 with guest Seth Green and The All-American Rejects. The Rejects spent the entire episode assisting in the tear down of the set which was a theme for the episode. At the end of the episode, Lindsey and Damien cooperatively added the last step in the demolition process by shutting down all the lights. Preceding was a montage of cast and crew members saying their goodbyes by waving to the camera.\n\nA three-hour special marking the end of the show aired on November 16, 2008.[1] Several artists made appearances, including Ludacris, Snoop Dogg, Nelly, Beyoncé, 50 Cent, Fall Out Boy, Backstreet Boys, Justin Timberlake, Kid Rock, JC Chasez, Christina Aguilera, Travis Barker, Taylor Swift, Hilary Duff, Eminem, and Korn's Jonathan Davis.[11] Former host Carson Daly described the media atmosphere after his departure from TRL, in an interview with TV Guide: \"MySpace was sold. Social networking took off. Technology went crazy. The whole tectonic shift of mass media. There were a lot of reasons why TRL became kind of a different show after I left. I don't necessarily think it had anything to with me leaving as much as it had to do with the changing landscape.\"[12]\n\nThe last music video to be played on TRL (during the final episode) was \"...Baby One More Time\" by Britney Spears, being the video that made number one on the countdown of the most iconic videos of all time. As the show did its final countdown of all-time videos, her now-iconic first hit, \"... Baby One More Time\", emerged as the top video, and played as the credits of the show ran for the final time. [1].\n\nFinal top 10 [ edit ]\n\nTRL chose the top ten most iconic videos and aired them as their final countdown.[13]\n\nRevivals (2014-2016) [ edit ]\n\nOn June 25, 2014, MTV announced that they would bring back Total Request Live for a one-off special edition on July 2, presented by MTV personality Sway with recording artist Ariana Grande, who performed her single \"Problem\" and premiered her song \"Break Free\", as well as having her hip hop knowledge tested in a \"Hip Hop Mix Up\" game. The special was titled Total Ariana Live and was broadcast from MTV's Times Square studio in front of a live audience. Grande called it \"a huge honor\" to bring back TRL.[14] The episode drew an average of 456,000 viewers.[15]\n\nOn September 27, 2016, as part of MTV's Elect This campaign, the network revived the program for a one-hour live special called Total Registration Live.[16] It was simulcast on MTV's website, app, Facebook and YouTube pages, and ElectThis.com. It was hosted by Nessa and featured performances by Ty Dolla $ign from his politically motivated mixtape Campaign. Kendall Jenner appeared in Times Square on behalf of Rock the Vote, and Ana Marie Cox and Jamil Smith from MTV News appeared on-air for segments. There were other appearances by Joss Whedon, Camila Cabello, Vic Mensa, Natalia Dyer, and Mack Wilds. Stories of millennials who have been activists were spotlighted.\n\n2017 revival logo\n\nReturn (2017-present) [ edit ]\n\nOn July 30, 2017, MTV announced that the network would revive TRL.[3]\n\nSince January 22, 2018, TRL was halved from a full hour to only a half-hour per day. The program then went on a hiatus until April 23, 2018.[17] Jackson left the show in 2018.\n\nIn February 2018, a half-hour late-night edition of TRL, Total Request LateNight was launched. The show airs Monday and Tuesday at 11 PM. MTV announced plans to expand the show to three nights in the summer and four nights by the end of the year, but this never materialized.[18]\n\nOn April 23, 2018, MTV launched a pre-recorded, hour-long daily morning edition of TRL titled Total Request AM. The show aired at 8am and was hosted by Sway. Vinny from Jersey Shore was brought on as host for the week and the first guests were boy band PrettyMuch. The program featured the return of a top ten countdown focusing on a specific playlist (Monday Motivation being the first countdown).[18]\n\n2019 saw another retooling and name change as TRL Top 10, which featured hosts Sway, Kevan Kenney and Jamila Mustafa. An off-shoot of the program, Fresh Out Fridays, aired for several weeks on MTV2 and covered everything new in music, pop culture, and fashion. TRL's Fresh Out Fridays aired a \"Playlist Of The Decade\" special on December 18, 2019 on MTV, which covered the top 10 videos and pop culture moments of the 2010s. TRL has yet to return in 2020, but Fresh Out Fridays returned on February 7, 2020 on MTV as Fresh Out Live. Unlike its half-hour MTV2 predecessor, Fresh Out Live has a runtime of around eight minutes. Starting Saturday, February 8, 2020, MTV airs a weekly one-hour block of music videos at 8AM ET under the name Fresh Out Playlist. This is the only block of long-form music videos MTV plays on its flagship channel.\n\nTotal Request AM logo logo\n\nImpact [ edit ]\n\nTRL is widely viewed as the show that launched the careers of many artists from the late 1990s and early 2000s. The show was featured as a main plot point in the movie Drake & Josh Go Hollywood, produced by sister network Nickelodeon.\n\nBoy bands [ edit ]\n\nEven though clean-cut boy bands like Backstreet Boys and NSYNC reached success before TRL began in the fall of 1998, both groups only reached their commercial peaks after their videos were seen on TRL. In 1999, the Backstreet Boys' second LP, Millennium, achieved the highest first week sales ever from an LP at the time.\n\nNSYNC also appeared on TRL in 2000, when their second LP, No Strings Attached, topped the Backstreet Boys' first week sales. Once again, the large number of fans in attendance closed down the streets of Times Square. Throughout most of 1998, 1999, and 2000, videos by the Backstreet Boys and *NSYNC would claim the top position on the countdown.\n\nPop princesses [ edit ]\n\nPop singers like Britney Spears, Christina Aguilera, and Jessica Simpson all made their music debuts on TRL as well. Britney and Christina became regulars on the show and would often appear as a guest. Simpson would not enjoy the same type of success until two years later, when she released the \"Irresistible\" video, which reached number two on the countdown. Mandy Moore saw success on the show with her debut single's \"Candy\" in 1999 and \"I Wanna Be with You\", but did not score her first number-one video until her 2002 single \"Crush\" which she also performed on the show.\n\nJessica Simpson's younger sister Ashlee Simpson is another pop princess that has had some success on TRL with her first music video \"Pieces of Me\" in 2004. Ashlee Simpson had three videos in the number one and one close to retirement. She would go on to score a number of number one videos on the show.\n\nThe artist with the most retirees videos is pop princess Britney Spears with 13 videos retired, an honorary retired video (\"I'm a Slave 4 U\") and three videos retired number one.\n\nA pop princess streak occurred in March 2007: The number one and number two spots were women for every show. There was no other month in the history of TRL where every show had a woman at the top spot.[19][20]\n\nRock bands [ edit ]\n\nAlthough best known for featuring pop acts, TRL regularly featured videos and performances from rock bands in genres such as nu metal, pop punk and emo pop. The metal bands Korn and Limp Bizkit were particularly popular on the program in the late 1990s, and often shared airtime with Britney Spears and the Backstreet Boys.[21] In later years, Green Day, Blink-182, My Chemical Romance, Linkin Park, Fall Out Boy and Sum 41 also were successful on the TRL chart.[22]\n\nDisney stars [ edit ]\n\nVanessa Hudgens premiered \"Come Back to Me\", which peaked at number three, and \"Say OK\", which only went to number ten. The Jonas Brothers have had their songs \"Hold On\", and \"SOS\" premiere; \"SOS\" made it on the countdown peaking at number six. \"When You Look Me in the Eyes\" was on the charts for several weeks before peaking at number one, after fans crushed and flooded the TRL site by requesting hundreds of times on March 19, 2008. \"Burnin' Up\" has also made it to the number-one spot on TRL. Ashley Tisdale premiered \"He Said She Said\" on TRL and it reached the number-one spot for sixteen days and these was retrieved at forty days in the countdown, becoming the most successful song for a Disney recording artist in the show. Aly & AJ's videos for \"Rush\", \"Chemicals React\" and \"Potential Breakup Song\" have all been on the countdown with \"Rush\" peaking at number two and \"Chemicals React\" peaking at number four, and \"Potential Breakup Song\" peaking at number five. Miley Cyrus's \"7 Things\" premiered on TRL and reached number four on the show.\n\nVideo game [ edit ]\n\nA PC video game called MTV Total Request Live Trivia was developed by Hypnotix and published by Take-Two Interactive, with a release on August 14, 2001. GameRankings rates it at 53.89% acclaim,[23] with a 48/100 grade from Metacritic.[24]\n\nInternational versions [ edit ]\n\nPast programs [ edit ]\n\nThe first version of TRL outside the US was in Italy. Started on MTV Italy on November 2, 1999, it was hosted by Marco Maccarini and Giorgia Surina, followed by Federico Russo and Carolina Di Domenico. Since the 2005–06 season, Surina returned to TRL with a new co-host, Alessandro Cattelan. After the 2005–06 season, the show was hosted only by Alessandro Cattelan. For the season 2007–08 the show was hosted for the first moment by Alessandro Cattelan and Elena Santarelli, and for the summer the male host was replaced by Carlo Pastore. Later Carlo Pastore was still the main host, but the female host changed to Elisabetta Canalis. Throughout its 8 seasons, TRL was broadcast from Milan, Rome, Venice, Naples, Genoa and Turin. TRL Italy is the longest-running show on MTV Italy: on December 23, 2004, a special two-hour event, \"TRL #1000\", was aired to celebrate the program's 1000th episode. From 2006 to 2012, there was also a program called TRL Awards where the people choose the artist of the year via web or mobile, and in summer 2007 was aired a special weekly-appointement called TRL Extra Live, who famous Italian singers did a mini-concert. The last version of the program was hosted by Brenda Lodigiani, Alessandro Arcodia, Wintana Rezene and Andrea Cadioli, under the name TRL on the Road, and ended on September 24, 2010.\n\nTRL logo used in Italy. logo used in Italy.\n\nMTV România launched the Romanian version of TRL from an Orange concept store on Calea Victoriei (a major commercial avenue in the center of Bucharest) on January 23, 2006. [30] The show aired two times a week, on Tuesday and Wednesday. The graphic was similar to that of the Italian version. The show has closed during 2009.\n\nfrom an Orange concept store on Calea Victoriei (a major commercial avenue in the center of Bucharest) on January 23, 2006. The show aired two times a week, on Tuesday and Wednesday. The graphic was similar to that of the Italian version. The show has closed during 2009. The British version, known as TRL UK , was hosted by Dave Berry, Alex Zane, Jo Good, and Maxine Akhtar. It was broadcast live from MTV Networks Europe Studios in Camden, London, then moving to Leicester Square in London from second series. Following the second series' broadcast from Leicester Square, the top 10 countdown was removed from the show. The second series finished at the end of 2005 and the show never returned to air.\n\n, was hosted by Dave Berry, Alex Zane, Jo Good, and Maxine Akhtar. It was broadcast live from MTV Networks Europe Studios in Camden, London, then moving to Leicester Square in London from second series. Following the second series' broadcast from Leicester Square, the top 10 countdown was removed from the show. The second series finished at the end of 2005 and the show never returned to air. The Australian version of TRL began as a weekend show, but then began aired live Monday through Friday. It was hosted by Maz Compton, Lyndsey Rodrigues, Nathan Sapsford, and Jason Robert Dundas. In early 2006, it returned to airing only on Friday evenings. The show was cancelled at the end of 2006 and was replaced by \"The Lair\". A revival of TRL returned in 2019. It is hosted by Ash London, Angus O'Loughlin, Flex Mami, and Lisa Hamilton.\n\nbegan as a weekend show, but then began aired live Monday through Friday. It was hosted by Maz Compton, Lyndsey Rodrigues, Nathan Sapsford, and Jason Robert Dundas. In early 2006, it returned to airing only on Friday evenings. The show was cancelled at the end of 2006 and was replaced by \"The Lair\". A revival of returned in 2019. It is hosted by Ash London, Angus O'Loughlin, Flex Mami, and Lisa Hamilton. After a Polish version of TRL was unsuccessful, MTV Poland decided to launch a new chart show based on TRL ' s structure titled RMF MAXXX Hits , which aired from Monday to Saturday at 2 p.m.\n\nwas unsuccessful, MTV Poland decided to launch a new chart show based on s structure titled , which aired from Monday to Saturday at 2 p.m. MTV France has launched the French version ( Ton Request Live ) of the American show on January 24, 2007. The format was different from the original concept: there wasn't the countdown with the 10 favourite videos and in every episode there was a movie's mini-documentaries entitled \" TRL en Movies \". The show closed after only an episode on January 25, 2007 and it has cancelled from the schedule of MTV France.\n\n) of the American show on January 24, 2007. The format was different from the original concept: there wasn't the countdown with the 10 favourite videos and in every episode there was a movie's mini-documentaries entitled \" \". The show closed after only an episode on January 25, 2007 and it has cancelled from the schedule of MTV France. The German version of TRL was very successful throughout Europe (after Italy), and it was known as Total Request Live Germany . TRL Germany had the highest television ratings of all the TRL versions in Europe. The show was hosted by Joko Winterscheidt and Mirjam Weichselbraun or Patrice Bouédibéla from Tuesday to Friday from 4:30 to 5:30 pm, and it was divided in four versions: Urban TRL (hip hop music), Rock TRL (rock music), regular TRL (various genres), and TRL XXL (special live guest). It was replaced with MTV Home in summer 2009.\n\nwas very successful throughout Europe (after Italy), and it was known as . had the highest television ratings of all the versions in Europe. The show was hosted by Joko Winterscheidt and Mirjam Weichselbraun or Patrice Bouédibéla from Tuesday to Friday from 4:30 to 5:30 pm, and it was divided in four versions: (hip hop music), (rock music), regular (various genres), and (special live guest). It was replaced with in summer 2009. In Brazil, MTV aired a show similar to TRL known as Disk MTV. This program was created before TRL, existing since the launch of MTV Brasil in 1990, and has never changed its format as a top ten request show over the years. It aired weekdays from 6:00 to 7:00 pm. On December 29, 2006, MTV Brasil aired the last Disk MTV episode. It had a week-long special about the best videos of its sixteen-year run; the last video shown in the program was Nirvana's \"Smells Like Teen Spirit\". The show was cut due to the decision of network of not airing music videos on its 2007 schedule, claiming that videos are something that can be viewed online on their Overdrive website.\n\nSimilar programs [ edit ]\n\nSee also [ edit ]\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/2/25/Trltitlescreen.jpg/170px-Trltitlescreen.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/MTV_Logo_2010.svg/150px-MTV_Logo_2010.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Star_full.svg/11px-Star_full.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/2/2e/Trl-top-ten-logo.jpg/250px-Trl-top-ten-logo.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/TRL_studios_in_Times_Square_in_2006.jpg/220px-TRL_studios_in_Times_Square_in_2006.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/92/Trl_titlecard.jpg/220px-Trl_titlecard.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/0/01/Trl-am-logo.jpg/220px-Trl-am-logo.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Star_empty.svg/11px-Star_empty.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/03/Mtv-trl-logo-2017.png/220px-Mtv-trl-logo-2017.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/2/2e/Trl-top-ten-logo.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/2/2e/Trl-top-ten-logo.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Total_Request_Live", "title": "Total Request Live", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/2/2e/Trl-top-ten-logo.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}