{"url": "people.com/tv/hoda-kotb-keeps-in-touch-matt-lauer/", "text": "Matt Lauer may no longer be a part of the Today show family, but he still stays in touch with his former colleagues on the morning news program.\n\n“Yeah, we keep in touch with him,” Hoda Kotb, who replaced Lauer as co-anchor alongside Savannah Guthrie, told The Hollywood Reporter for its 35 Most Powerful People in New York Media 2018 issue.\n\nGet push notifications with news, features and more.\n\nImage zoom Peter Kramer/NBC/NBC NewsWire/Getty\n\n“I mean look, this is one of those complex situations,” admitted Kotb, 53, who received a congratulatory text from Lauer when she was named co-anchor in early January. “I’ve known him since I started working at NBC [in 1998]. When I was sick with breast cancer, he was the first to call. He helps and helped in ways that … you know, he was incredible in that way.”\n\nThough Kotb has fond memories of Lauer, 60, she isn’t discounting the stories of the women who came forward and accused the previous NBC anchor of sexual misconduct.\n\n“There is that Matt and then there’s the Matt that the accusers speak of. And those accusers’ voices matter and that story matters and it’s … (to Savannah Guthrie) It’s still tough, right?” Kotb said in the THR interview to Guthrie, who affirmed: “Yes.”\n\nIt’s been five months since Lauer parted ways with the show at the end of November after the network received a “detailed complaint from a colleague about inappropriate sexual behavior,” with reason to believe “this may not have been an isolated incident.” Women have also anonymously accused him of sexual harassment and assault in reports published by Variety and The New York Times.\n\nWant to keep up on the latest from PEOPLE? Sign up for our daily newsletter to get our best stories of the day delivered straight to your inbox.\n\nFollowing his firing, which was announced live on Today by Guthrie and Kotb, Lauer addressed the original allegations in a statement.\n\n“There are no words to express my sorrow and regret for the pain I have caused others by words and actions,” he said, in part. “To the people I have hurt, I am truly sorry. As I am writing this, I realize the depth of the damage and disappointment I have left behind at home and at NBC.”\n\nSpeaking with PEOPLE following Lauer’s exit, Guthrie, 46, and Kotb opened up about sharing the sobering news with the world.\n\n“I think you could see from the moment that the news happened that our hearts were broken, and in lots of ways, they still are,” Guthrie said. “That feeling was shared through our whole newsroom and our whole Today show staff, because it sounds like cliché or a promo line, but it happens to be true: We are family, and we do love each other, and families do go through hard times, and when that happens in good families, you just get closer. You pull together and you focus on the foundation and what keeps you together. I think that’s what we’ve all been trying to do. And for me, I just am trying to get comfortable with how complicated the feelings around all of it are, and it is complicated. And just trying to have love and compassion for everyone concerned.”\n\nImage zoom Tyler Essary/Getty\n\nThe duo also spoke about Lauer, whom they are continuing to support and only want the best for.\n\n“We know he’s working on his family, we know that for sure. Of course our hearts go out to the brave women who have told their stories,” Guthrie said.\n\n“What we are experiencing and processing now is how to honor and remain a true friend to someone even in spite of learning things that are deeply disturbing,” she added. “And we are trying to navigate that path with integrity.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F16%2Fmaps-2-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fhoda-kotb-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F04%2Flauer-last-day.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fhoda-kotb-4.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fhoda-kotb-4.jpg", "keywords": [], "authors": ["Natalie Stone"], "canonical_link": "https://people.com/tv/hoda-kotb-keeps-in-touch-matt-lauer/", "title": "Hoda Kotb Says She Still 'Keeps in Touch' with Matt Lauer After His Today Show Firing", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Hoda Kotb,Matt Lauer,News,Savannah Guthrie,Today,TV", "news_keywords": "Hoda Kotb,Matt Lauer,News,Savannah Guthrie,Today,TV", "description": "\"We keep in touch with him,\" Hoda Kotb said about her former Today show colleague, Matt Lauer", "og": {"title": "Hoda Kotb Says She Still 'Keeps in Touch' with Matt Lauer After His Today Show Firing", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/hoda-kotb-keeps-in-touch-matt-lauer/", "description": "Matt Lauer may no longer be a part of the Today show family, but he still stays in touch with his former colleagues on the&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fhoda-kotb-4.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/hoda-kotb-keeps-in-touch-matt-lauer/", "description": "\"We keep in touch with him,\" Hoda Kotb said about her former Today show colleague, Matt Lauer", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fhoda-kotb-4.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/hoda-kotb-keeps-in-touch-matt-lauer/", "title": "Hoda Kotb Says She Still 'Keeps in Touch' with Matt Lauer After His Today Show Firing", "description": "\"We keep in touch with him,\" Hoda Kotb said about her former Today show colleague, Matt Lauer", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F01%2Fhoda-kotb-4.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}