{"url": "https://www.etonline.com/tv/221882_exclusive_ravens_home_wardrobe_tour", "text": "Oh snap! Raven Baxter is back.\n\n“Raven has not changed,” Raven-Symone tells ET. “I think Raven Baxter is still that fun, kooky, crazy, down for whatever, here for friends girl. But now, she has kids. So, she’s a lot more [about] teaching them to be just as crazy as her, in a loving way.”\n\nRaven-Symone, 31, returns to Disney Channel on Friday with Raven’s Home, a sequel series to her hit, That’s So Raven, which stopped airing new episodes a decade ago.\n\n“Oye, I thought it was longer,” she jokes. “I feel like it was about 15 to 20 [years] … I had never seen a show born from the ground up, as I've seen Raven’s Home grow. So, it's a little bit like, 'Wow!’ I stepped outside of my body for a second, and this is actually happening.”\n\n\n\nWATCH: The Raven’s Home Theme Song Is Here -- Get a First Listen!\n\nET caught up with the star on set of the reboot, which finds Raven, her twin children, her best friend, Chelsea, and Chelsea’s son all living together in an apartment.\n\nEXCLUSIVE: Why Raven-Symone and Anneliese van der Pol Call 'Raven's Home' Their 'Dream Come True' This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\n“I have always wanted to be a mother,” the star shares. “I’m still looking forward to that day when I can. But I was talking to my mom -- she came to visit me on the set for the first two weeks -- and she was like, ‘You’re acting more like a dad. Like, be nicer.’ I’m like, ‘Uh. Let’s go people.’ I’m trying my hardest to be as motherly as I can. But we also have a job to do. So, it’s a little bit of momager-ing I guess.”\n\n“This is still a job,” she adds. “We’re having fun, but we have a job to do and we have to get this show on the road.”\n\nYes, this time Raven has another title beyond “star.” She’s also the series’ executive producer.\n\n“Sometimes [I’m the boss],” she jokes. “Not all the time.”\n\n\n\nWATCH: Raven-Symone Reveals Why Now Was the Right Time to Reboot That’s So Raven\n\n\n\nRaven’s Home reunites Raven with her That’s So Raven co-star Anneliese van der Pol, who returns as Chelsea.\n\n“It's just a dream come true,” Raven says. “An utter dream.”\n\n“We had talked about working together maybe four years after That's So Raven happened,” she admits. “We both were like 'This has to happen. This has to happen. We need a job. We've got bills.'”\n\nAnneliese confesses her favorite part of the whole experience has been working with Raven again.\n\n“I mean, she's so talented, and that's so obvious, but I don't know if I've worked with somebody opposite, comedically, that I thought was so good,” Anneliese tells ET. “Just watching her, and being entertained by her, but also to work with her? It's nice to have that back and get into our rhythm.\n\n“It's like [we] never left,” she says. “I don't know. I can't explain that feeling. It's almost as if, after you do a show, you take a bow. It feels like that, without taking the bow. It's so gratifying.”\n\nRaven’s reaction: “That’s awesome.”\n\n“I don’t even know what to compare it with,” she confesses. “For me, it’s like eating a biscuit with gravy.”\n\n“It feels natural,” Anneliese says. “It feels good. It feels very fulfilling.”\n\n\n\nWATCH: Get a Hilarious First Look at Raven’s Home\n\nBoth ladies say there’s a lot to look forward to on the show, for fans both old and new.\n\n'Raven's Home' Star Anneliese van der Pol Says Chelsea Still Isn't 'With It' After All These Years This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\n“I'm most excited for the fans of That’s So Raven to see how Chelsea and Raven have interacted [over the years],” Raven teases. “There's this funny through storyline that we don't really dive into, we always touch on, and I think they'll appreciate what Raven and Chelsea did between the years of That's So Raven and Raven's Home.”\n\n“What we did on our summer breaks,” she explains. “How we were in college. You don't see them. You missed it, but we allude to it so many different times in the sense of, ‘We run a submarine one summer.’ What were we doing there? You have to watch to find out. I love that.”\n\n“I'm really happy for [That’s So Raven] fans to see Raven and Chelsea [as] two women leading this household, raising their children in a different kind of family dynamic,” Anneliese shares. “I think that's something that they'll want to see with their children. Especially mothers.”\n\n\n\nRaven’s Home premieres Friday night on Disney Channel after the debut of the channel’s latest original movie, Descendants 2.\n\nCheck out the videos above to see more from Raven and Anneliese -- including an exclusive tour of their characters’ closets -- then, watch the one below to learn more about Raven’s Home from the kids of the show, Issac Brown, Navia Robinson, Sky Katz and Jason Maybaum.", "images": ["https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-07/1280_et_thatsoraven_071917.jpg?itok=VmKWRVAm"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-07/1280_et_thatsoraven_071917.jpg?itok=VmKWRVAm", "keywords": [], "authors": ["Brice Sander"], "canonical_link": "https://www.etonline.com/tv/221882_exclusive_ravens_home_wardrobe_tour", "title": "EXCLUSIVE: Raven-Symone Calls 'Raven's Home' a Dream -- Why Playing a Mom Has Her Thinking About Becoming One!", "meta_data": {"article": {"opinion": "false"}, "title": "EXCLUSIVE: Raven-Symone Calls 'Raven's Home' a Dream -- Why Playing a Mom Has Her Thinking About Becoming One! | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/tv/221882_exclusive_ravens_home_wardrobe_tour", "title": "EXCLUSIVE: Raven-Symone Calls 'Raven's Home' a Dream -- Why Playing a Mom Has Her Thinking About Becoming One!", "description": "Plus, get an exclusive tour of the show's wardrobe department!", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-07/1280_et_thatsoraven_071917.jpg?itok=VmKWRVAm", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "Plus, get an exclusive tour of the show's wardrobe department!", "title": "EXCLUSIVE: Raven-Symone Calls 'Raven's Home' a Dream -- Why Playing a Mom Has Her Thinking About Becoming One!", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Brice Sander", "url": "https://www.etonline.com/tv/221882_exclusive_ravens_home_wardrobe_tour", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-07/1280_et_thatsoraven_071917.jpg?itok=VmKWRVAm"}, "description": "Plus, get an exclusive tour of the show's wardrobe department!", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "TV, Raven Symone", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}