{"url": "https://www.elitedaily.com/p/margot-robbies-reaction-to-her-oscars-nomination-for-i-tonya-is-adorable-7991448", "text": "HAVE YOU GUYS SEEN I TONYA? It. Is. So. Good. I freaking love it. I was, like, 5 years old or something when the real Tonya Harding did her first triple axle, but watching Margot Robbie do a pretend triple axle for this incredible film was the next best thing. Her performance definitely gained the attention of The Academy, and Margot Robbie's reaction to her Oscars nomination for her role as Tonya Harding is the best thing I've seen all week.\n\nThe bio-pic plotline follows the infamous scandal between Olympic figure skaters Tonya Harding and Nancy Kerrigan. Harding was a rough around the edges, self-proclaimed \"red neck\" who fought her way to the 1994 Olympics. Her biggest competitor was Nancy Kerrigan, who was renowned far and wide as \"America's sweetheart.\" During this time, Harding's ex-husband Jeff Gillooly and Harding's bodyguard Shawn Eckhardt hired a man to attack Kerrigan in hopes of breaking her leg so she would be unable to compete. Ultimately, they bruised Kerrigan badly, but she continued on to win the silver medal in the Olympics. Harding took eighth place, and was ultimately banned from the U.S. Figure Skating Association for life thanks to her involvement in the attack.\n\nThat's the gist, but my God, is Harding's personal life so much more complicated.\n\nRobbie totally stepped up to the plate (and then some) to play this intricate, complicated, weirdly funny, and profoundly impactful character. The Australian actress trained for months on the ice skating rink, and nailed Harding's blue-collar accent with incredible ease. Robbie's performance is a full-on triumph.\n\nHere's just a very small taste of Robbie's work in the I, Tonya trailer.\n\nMovieclips Trailers on YouTube\n\nYES, YES, YES.\n\nNow, she's riding her ice skates all the way to the Oscars. Robbie is nominated for Leading Actress in a Motion Picture, and she seems pretty freaking jazzed about it. Actually, it's her first Oscar nomination ever.\n\nRobbie's brother, Cameron, shared a video on social media showing his sister celebrating the good news. It's seriously so fun to watch.\n\nHe understandably captioned the video with excited gibberish. Later, he shared a photo hugging his sister with the caption,\n\nThere’s nothing I could say that articulates how proud I am of this one #whatamoment#academyawardnomaninee!\n\nNot for nothing, Robbie is up against some pretty fierce competition. The other nominees in her category include Sally Hawkins from The Shape Of Water, Frances McDormand from Three Billboards Outside of Ebbing, Missouri, Saoirse Ronan from Lady Bird, and Meryl Freaking Streep for her work in The Post.\n\nI do not envy The Academy on this one.\n\nFor Robbie, this nomination must be total validation for a job well done. She shared a little bit of her acting process with Rolling Stones and how she worked to embody Harding's \"spirit.\" She said,\n\nWe deal with a lot of class issues and the scrutiny from the media. I wanted it to feel like the world was bearing down on her ... I wanted her shoulders rounded, her head to be stooped. I wanted her to always be on the defense – and whenever she was sitting to be sitting forward, waiting for validation, like she was waiting for a skating score... I watched for about six months every single thing, every bit of skating, every bit of interview, every documentary, I played it [on] my iPod at night ... I had her face, like, painted on the inside of my eyelids and her voice just constantly in my head.\n\nVivien Killilea/Getty Images Entertainment/Getty Images\n\nTune in to see if Robbie takes home the gold (GET IT? Like, the Olympics, but also the Oscars?) on Sunday, Mar. 4, on ABC!\n\nCheck out the entire Gen Why series and other videos on Facebook and the Bustle app across Apple TV, Roku, and Amazon Fire TV.", "images": ["https://imgix.bustle.com/uploads/getty/2018/1/23/b048466e-cc4e-40b7-86d2-b1bd6b2c5d05-getty-909073086.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2018/1/23/b048466e-cc4e-40b7-86d2-b1bd6b2c5d05-getty-909073086.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.elitedaily.com/uploads/getty/2018/1/23/4f9c04ca-a997-4c5b-aa5a-f62d8693d48b-getty-886810014.jpg?w=610&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/4/3f06e7b7-354f-4411-88de-b61a00bfa2ea-getty-1206171453.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2020/4/6/299d5919-9fcd-4317-a0a6-d65830cb8d32-6af69330-4a1b-4557-bcf0-e95026e679d0-getty-1207397869.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2020/4/1/0180fbc3-a9d4-4667-946e-21075e2df4f4-1118full-harry-potter-the-sorcerers-stone-screenshot.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/1/23/b048466e-cc4e-40b7-86d2-b1bd6b2c5d05-getty-909073086.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/margot-robbies-reaction-to-her-oscars-nomination-for-i-tonya-is-adorable-7991448", "title": "Margot Robbie's Reaction To Her Oscars Nomination For 'I, Tonya' Is Adorable", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/margot-robbies-reaction-to-her-oscars-nomination-for-i-tonya-is-adorable-7991448", "type": "article", "title": "Margot Robbie Got Her First Oscars Nom & The Video Of Her Celebrating Is Amazing", "description": "HAVE YOU GUYS SEEN I TONYA? It. Is. So. Good. I freaking love it. I was, like, 5 years old or something when the real Tonya Harding did her first triple axle, but watching Margot Robbie do a pretend triple axle for this incredible film was the next…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/1/23/b048466e-cc4e-40b7-86d2-b1bd6b2c5d05-getty-909073086.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "HAVE YOU GUYS SEEN I TONYA? It. Is. So. Good. I freaking love it. I was, like, 5 years old or something when the real Tonya Harding did her first triple axle, but watching Margot Robbie do a pretend triple axle for this incredible film was the next…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}