{"url": "https://en.wikipedia.org/wiki/Maluma_(singer)", "text": "Colombian reggaeton singer\n\nLondoño and the second or maternal family name is Arias. This article uses Spanish naming customs : the first or paternal family name isand the second or maternal family name is\n\nJuan Luis Londoño Arias (born 28 January 1994), known professionally as Maluma, is a Colombian singer, songwriter, and actor signed to Sony Music Colombia, Sony Latin and Fox Music.[1] Born and raised in Medellín, he developed an interest in music at a young age, and began recording songs at age 16. He released his debut album, Magia, a year later in 2012. However, his breakthrough album was 2015's Pretty Boy, Dirty Boy, which led to successful collaborations with several artists. He released F.A.M.E. in 2018, to further commercial success. He followed it up with 11:11, released the next year.\n\nMaluma has several singles that have charted within the top 10 on Billboard Hot Latin Songs, including \"Felices los 4\", \"Borró Cassette\", \"El Perdedor\" and \"Corazón\". He has worked with several international artists such as Thalía, Shakira, Ricky Martin, Anitta and Madonna. His collaborative efforts \"Chantaje\" with Shakira and \"Medellín\" with Madonna have reached the top of the Hot Latin Songs, as well as the top spot on the Dance Club Songs chart with the latter. He has won a Latin Grammy Award, two Latin American Music Awards, and been nominated for a Grammy Award for Best Latin Pop Album. Musically, Maluma's songs have been described as reggaeton, Latin trap, and pop.\n\nCareer [ edit ]\n\n2010–2013: Beginnings and breakthrough [ edit ]\n\nMaluma began his musical career in 2010, recording singles. After \"Farandulera\" became a radio hit, Sony Music and its subsidiary label Sony Music Colombia decided to sign the singer to record his first studio album.[2] The label then launched the next single, \"Loco\", which was inspired by \"rampant and uncontrolled love\".\n\nIn 2012, Maluma released his first studio album, titled Magia.[3] The video for the single \"Obsesión\" was filmed at the Antioquia Department Railway Station and featured Colombian model Lina Posada, who had previously appeared in the music video for the song \"Taboo\" (2011) by Don Omar. So far the video has more than 185 million views on YouTube. Other singles released from the album include \"Miss Independent\" and \"Pasarla Bien\", with \"Miss Independent\" reaching number two on the Colombian National-Report songs chart, becoming his first top five song on the chart.[4][5] Maluma was also nominated for a 2012 Shock Award as \"Best New Artist\".[1][6] The final two singles from his debut album, \"Primer Amor\" and \"Miss Independent\"; the latter was accompanied with a music video, recorded in Medellín, gathering 48 million views on YouTube.[7]\n\nMaluma performing in Bogotá , Colombia in 2014.\n\nIn 2013, \"La Temperatura\", featuring Puerto Rican singer Eli Palacios, was released as the first single from his upcoming mixtape, PB.DB The Mixtape; the song reached number seven on the National-Report charts. It also became his first single to enter the US charts for the Latin audience by Billboard; it reached number 25 on the Tropical Songs chart, number 8 on the Latin Pop Airplay songs chart, number 24 on the Billboard Hot Latin Songs chart and number 4 on the Latin Rhythm Airplay songs chart.[8][9]\n\n2014–2018: Pretty Boy, Dirty Boy and F.A.M.E. [ edit ]\n\nMaluma performing during the Festival de Viña del Mar 2017 in Chile\n\nIn 2014, he released the music videos for the singles \"La Curiosidad\", \"Carnaval\" and \"Addicted\".[10][11][12] He also collaborated with singer Elvis Crespo, on the theme song \"Olé Brazil\" recorded for the 2014 FIFA World Cup. On 16 July 2014, Maluma appeared at the 2014 Premios Juventud, where he performed \"La Temperatura\". That same month, the singer was confirmed as a judge/coach on Caracol Television's The Voice Kids, alongside Fanny Lu and Andrés Cepeda. In August, he made his debut as a host at the inaugural awards Kids' Choice Awards Colombia of 2014.\n\nIn early 2015, Maluma released the mixtape PB.DB The Mixtape, a compilation of various singles.[13] His second album Pretty Boy, Dirty Boy was released in late 2015, containing elements of reggaeton, pop and urban music.[14] The singles \"Borró Cassette\", \"El Perdedor\" and \"Sin Contrato\" entered the top 10 on Billboard Hot Latin Songs.[15]\n\nIn April of that year he performed at the newly named Riccardo Silva Stadium for the inaugural match of the new NASL soccer team The Miami FC.[16][17] He then embarked on The Pretty Boy, Dirty Boy World Tour in May 2016.[18]\n\nIn 2017, his hit single \"Felices los 4\" became his fifth top 5 on the Hot Latin Songs chart,[19] followed by \"Corazón\", which also reached the top 5 on the chart. The music videos for both singles have over 1 billion views on YouTube. He also released the short film X, which featured his songs \"GPS\" featuring French Montana, \"Vitamina\" featuring Arcángel and \"23\".[20]\n\nMaluma recorded the Spanish version of \"Colors\", one of the theme songs of the 2018 FIFA World Cup, and performed in English by Jason Derulo.[21] Maluma returned to the Riccardo Silva Stadium in Miami to record the video,[22] one of a growing number of artists using the city to shoot music videos.[23] Maluma's third studio album F.A.M.E. was released on 18 May 2018. In an interview he expressed its name means \"Faith, Alma [Soul in Spanish], Music & Essence\". He worked with producers Jay Cash, Vinylz and collaborators Daddy Yankee, Prince Royce and Jason Derulo on the album.[24][25] He performed \"Felices los 4\" at the 2018 MTV Video Music Awards.[26] With \"Mala Mia\", he topped the Latin Airplay, Latin Pop Songs and Latin Rhythm Airplay charts for the second time in the year, following \"Clandestino\".[27]\n\nIn 2019, Maluma collaborated with American singer-songwriter Madonna, appearing on the songs \"Medellín\" and \"Bitch I'm Loca\" from her album Madame X.[28] On April it was announced that Maluma will star in Marry Me alongside Jennifer Lopez.[29]\n\nOn 17 May 2019, Maluma released his fourth studio album 11:11, supported by the singles \"HP\", \"11 PM\", \"Instinto Natural\" with Sech and \"No Se Me Quita\" with Ricky Martin.[30] Another collaboration with Madonna, \"Soltera\", appeared on the album.[28] To promote the album, Maluma embarked on the 11:11 World Tour, with concerts around the world between May 2019 and September 2020.\n\nOn 26 September 2019, he collaborated with Colombian singer J Balvin on his single \"Qué Pena\".\n\nArtistry [ edit ]\n\nMaluma possesses the vocal range of a tenor.[31][32][33][34][35] He has cited Héctor Lavoe, Justin Timberlake and Michael Jackson as his main musical influences.[2][36] Maluma defines his music as \"urban pop\".[37][38] A Billboard editor wrote, \"Maluma’s brand of reggaetón syncs nicely with his image, managing to be both romantic and raw. His sound represents an evolution of the genre.\"[2] In a 2016 interview, he stated:\n\nI grew up with this genre [reggaeton] that literally became life. It is one of the genres that I sing... I am an urban performer, I sing reggaeton. If you listen to my last album [Pretty Boy, Dirty Boy] there are ballads, mambo, merengue and reggaeton and underground stuff. I like to show the versatility that I have to perform.[39]\n\nPersonal life [ edit ]\n\nMaluma during the world premiere of music video \"Medellin\" on MTV\n\nMaluma was born to Marlli Arias and Luis Londoño and grew up with an older sister, Manuela. He took an early interest in football which he started playing as a toddler through middle school, competing in the lower divisions in the teams Atlético National and Equidad Sports Club. Additionally, he developed a keen interest in music during his early teenage years and was famed as a good singer in his high school. He graduated from Hontaranes School in El Retiro where he was encouraged by many of his friends to enter local singing competitions.[40]\n\nHe got his first musical break when he was fifteen after he composed, together with a close friend, a song titled \"No quiero\"; a year later Juan Parra, his uncle, offered him the opportunity to record it in a studio as his birthday present.[40]\n\nMaluma is Catholic but says he also takes in aspects from other religions.[41]\n\nMaluma's romantic life has been the subject of much speculation which he has kept private for the most part. However, in an interview with Telemundo's Al Rojo Vivo in January 2018 he admitted to being in relationship with Cuban-Croatian model Natalia Barulich.[42] He said of the relationship:\n\nWe have a great time together, we have fun, we love each other, and we also support each other...I think those are the fundamentals. It's the most important thing. Right now, we're dating. We like what we have, I like her company, and she supports me and loves me, so you're all seeing me like never before.[43]\n\nMaluma and Natalia Barulich broke up in 2019.\n\nControversy [ edit ]\n\nOn October 7, 2016, the song \"Cuatro Babys\" featuring Noriel, Bryant Myers, and Juhn has received much controversy over its lyrics, as some consider them to objectify women. A petition was posted on Change.org demanding the removal of the song from digital platforms.[44] Despite this controversy, the popularity of \"Cuatro Babys\" has only risen with the song having gone quadruple Platinum,[citation needed] qualifying how large of a following the Latin trap genre had.[45]\n\nAwards and nominations [ edit ]\n\nIn 2013, Maluma was nominated for several awards, including for MTV Europe Music Award for Best Latin America Central Act at the 2013 MTV EMAs,[46] and the Latin Grammy Award for Best New Artist,[47] as well as a win for \"Best Radio Song\" at the 2013 Shock Awards for \"La Temperatura\".[48] In 2017, Maluma was nominated for two categories at the Billboard Music Awards, including Top Latin Artist.[49] In 2019 he was awarded El Premio ASCAP for Songwriter of the Year.[50]\n\nFilmography [ edit ]\n\nDiscography [ edit ]\n\nTours [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Maluma_en_vivo..JPG/200px-Maluma_en_vivo..JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Maluma_and_Madonna.PNG/220px-Maluma_and_Madonna.PNG", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Maluma_-_Sin_contrato_-_Festival_de_Vi%C3%B1a_del_Mar_2017.jpg/220px-Maluma_-_Sin_contrato_-_Festival_de_Vi%C3%B1a_del_Mar_2017.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Conga.svg/16px-Conga.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/21px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Flag_of_Colombia.svg/24px-Flag_of_Colombia.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Maluma_-_Espa%C3%A7o_das_Am%C3%A9ricas_%2837591053894%29.jpg/220px-Maluma_-_Espa%C3%A7o_das_Am%C3%A9ricas_%2837591053894%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Maluma_-_Espa%C3%A7o_das_Am%C3%A9ricas_%2837591053894%29.jpg/1200px-Maluma_-_Espa%C3%A7o_das_Am%C3%A9ricas_%2837591053894%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Maluma_-_Espa%C3%A7o_das_Am%C3%A9ricas_%2837591053894%29.jpg/1200px-Maluma_-_Espa%C3%A7o_das_Am%C3%A9ricas_%2837591053894%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Maluma_(singer)", "title": "Maluma (singer)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Maluma_-_Espa%C3%A7o_das_Am%C3%A9ricas_%2837591053894%29.jpg/1200px-Maluma_-_Espa%C3%A7o_das_Am%C3%A9ricas_%2837591053894%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}