{"url": "https://www.hollywoodreporter.com/news/tom-brokaw-rips-sensational-accuser-claims-i-was-ambushed-perp-walked-1106418", "text": "The revered NBC News anchor accused of unwanted advances pens a strenuous denial and defense of his legacy.\n\nTom Brokaw, the NBC News anchor who has served as a distinguished anchor emeritus since stepping down as anchor of Nightly News in 2004, penned a blistering rebuttal to accusations that he subjected an underling to unwanted advances in the 1990s, when he was the network's biggest star and she was a 28-year-old just starting out in network news.\n\nIn an email obtained by The Hollywood Reporter and sent to a handful of NBC News colleagues, Brokaw, 78, strenuously denies the detailed account of Linda Vester. \"I am angry, hurt and unmoored from what I thought would be the final passage of my life and career, a mix of written and broadcast journalism, philanthropy and participation in environmental and social causes that have always given extra meaning to my life,\" Brokaw wrote.\n\nThe NBC News fixture, who joined the network in 1966 and anchored Nightly for 22 years, was accused by Vester and a second anonymous woman of harassment in a Washington Post story published on Thursday. Vester also spoke in a video interview with Variety. Brokaw, through NBC, issued a statement of denial to both publications.\n\nBrokaw has been a special correspondent for NBC News. Colleagues there said he was not scheduled to be in the office on Friday. But it's unclear how NBC News will respond to the allegations. The company is nearing the end of an investigation set off by the toppling of Matt Lauer.\n\n\"I am facing a long list of grievances from a former colleague who left NBC News angry that she had failed in her pursuit of stardom. She has unleashed a torrent of unsubstantiated criticism and attacks on me,\" the anchor, currently a special correspondent at the network, stated in his email to colleagues.\n\nBrokaw's email is published in full below:\n\nIt is 4:00 am on the first day of my new life as an accused predator in the universe of American journalism. I was ambushed and then perp walked across the pages of The Washington Post and Variety as an avatar of male misogyny, taken to the guillotine and stripped of any honor and achievement I had earned in more than a half century of journalism and citizenship.\n\nI am angry, hurt and unmoored from what I thought would be the final passage of my life and career, a mix of written and broadcast journalism, philanthropy and participation in environmental and social causes that have always given extra meaning to my life.\n\nInstead I am facing a long list of grievances from a former colleague who left NBC News angry that she had failed in her pursuit of stardom. She has unleashed a torrent of unsubstantiated criticism and attacks on me more than twenty years after I opened the door for her and a new job at Fox news.\n\nLinda Vester was given the run of the Washington Post and Variety to vent her grievances, to complain that I tickled her without permission (you read that right), that I invaded her hotel room, accepted an invitation to her apartment under false pretenses and in general was given a free hand to try to destroy all that I have achieved with my family, my NBC career, my writing and my citizenship.\n\nMy family and friends are stunned and supportive. My NBC colleagues are bewildered that Vester, who had limited success at NBC News, a modest career at Fox and a reputation as a colleague who had trouble with the truth, was suddenly the keeper of the flame of journalistic integrity.\n\nHer big charge: that on two occasions more than 20 years ago I made inappropriate and uninvited appearances in her apartment and in a hotel room. As an eager beginner, Vester, like others in that category, was eager for advice and camaraderie with senior colleagues. She often sought me out for informal meetings, including the one she describes in her New York hotel room. I should not have gone but I emphatically did not verbally and physically attack her and suggest an affair in language right out of pulp fiction.\n\nShe was coy, not frightened, filled with office gossip, including a recent rumor of an affair. As that discussion advanced she often reminded me she was a Catholic and that she was uncomfortable with my presence. So I left, 23 years later, to be stunned by her melodramatic description of the meeting. A year or so later, as I passed through London after covering end of WWII ceremonies in Moscow, I saw her in the office, chatted and agreed to a drink later. (If NY was so traumatic, why a reunion?) She knew a bar but by that late hour it was closed so she suggested her nearby apartment (not, \"Well, no where to go. See you tomorrow\").\n\nAgain, her hospitality was straight forward with lots of pride in her reporting in the Congo and more questions about NY opportunities.\n\nAs I remember, she was at one end of a sofa, I was at the other. It was late and I had been up for 24 hours. As I got up to leave I may have leaned over for a perfunctory goodnight kiss, but my memory is that it happened at the door – on the cheek. No clenching her neck. That move she so vividly describes is NOT WHO I AM. Not in high school, college or thereafter.\n\nShe came to NY and had mixed success on the overnight news. As I remember her try out on TODAY did not go well. Her contract was not renewed.\n\nHere is a part of her story she somehow left out. I think I saw her in the hallways and asked how it was going. She was interested in cable start up and I said I didn't think that was going anywhere. What about Fox, which was just building up? She was interested and followed me to my office where, while she listened in, I called Roger Ailes. He said, \"send her over.\"\n\nShe got the job. I never heard from her or saw her again. I was aware that she became a big fan of Ailes, often praising his considerable broadcasting instincts in public. But when he got in trouble on sexual matters, not a peep from this woman who now describes her self as the keeper of the flame for Me:Too.\n\nI am not a perfect person. I've made mistakes, personally and professionally. But as I write this at dawn on the morning after a drive by shooting by Vester, the Washington Post and Variety, I am stunned by the free ride given a woman with a grudge against NBC News, no distinctive credentials or issue passions while at FOX.\n\nAs a private citizen who married a wealthy man, she has been active in social causes but she came to Me:Too late, portraying herself as a den mother. In the intervening years since we met on those two occasions, she had no reason to worry I could affect her career.\n\nSome of her relatives by marriage are very close friends. She couldn't pick up the phone and say, \"I'd like to talk. I have issues from those two meetings 20 years ago?\" Instead she became a character assassin. Strip away all of the hyperbole and what has she achieved? What was her goal? Hard to believe it wasn't much more Look At Me than Me:Too.\n\nI deeply resent the pain and anger she inflicted on my wife, daughters and granddaughters - all women of considerable success and passion about women's rights which they personify in their daily lives and professions. We'll go on as a family that pursues social justice in medical emergency rooms, corporate offices, social therapy, African women's empowerment and journalism. And no one woman's assault can take that away.\n\nI am proud of who I am as a husband, father, grandfather, journalist and citizen. Vester, the Washington Post and Variety cannot diminish that. But in this one woman piece of sensational claims they are trying.\n\nTom Brokaw\n\nAfter the publication of Brokaw's email, NBC News chairman Andy Lack wrote a memo to staff, below:\n\nDear Colleagues,\n\nAs you have all seen now in reports from last night, there are allegations against Tom Brokaw, made by a former NBC News journalist, which Tom emphatically denies. As we've shown, we take allegations such as these very seriously, and act on them quickly and decisively when the facts dictate.\n\nThe same report included claims against Matt Lauer. As you know, since the week we terminated Matt's employment, NBC Universal has been conducting a review, led by general counsel Kim Harris--who has extensive experience in conducting reviews of this kind--with a team of legal and HR leaders. Kim has advised us that the review is nearing its conclusion, and we will have findings and further steps to share with you as soon as next week.\n\nIn addition to the review--which has included interviews with employees who worked on TODAY and elsewhere in NBC News, and a substantial culture assessment conducted with hundreds of employees--we also have been running mandatory in-person workplace training sessions. Thus far, 1600 employees have been trained, and the feedback from those sessions has been overwhelmingly positive. We expect to have all 2,000 of our employees trained by end of summer.\n\nIf you are one of the many who has participated in interviews, the culture assessment sessions and/or the workplace training sessions, thank you. Your participation, feedback and insights are crucial to this process, as we move forward as an organization.\n\nAnd as we have done regularly over the last few months, and will continue to do frequently, we want to remind you that we encourage all employees to speak up and raise any concerns you have about inappropriate conduct you have experienced or observed. There are multiple avenues available that we have shared with you before, you can also find the details on the intranet NBCNow.\n\nOnce again, our highest priority is to ensure we have a workplace environment where everyone feels safe and protected. We are absolutely committed to making this a reality--there can be no exception.\n\nAs Ever,\n\nAndy", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/2018/04/gettyimages-676856204-h_2018.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/landscape_928x523/2018/04/gettyimages-676856204-h_2018.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71"], "top_img": "https://cdn1.thr.com/sites/default/files/2018/04/gettyimages-676856204-h_2018.jpg", "keywords": [], "authors": ["Marisa Guthrie", "Thrnews Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/news/tom-brokaw-rips-sensational-accuser-claims-i-was-ambushed-perp-walked-1106418", "title": "Tom Brokaw Rips \"Sensational\" Accuser Claims: I Was \"Ambushed and Then Perp Walked\"", "meta_data": {"viewport": "width=device-width", "description": "The revered NBC News anchor accused of unwanted advances pens a strenuous denial and defense of his legacy.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/news/tom-brokaw-rips-sensational-accuser-claims-i-was-ambushed-perp-walked-1106418", "domain": "https://www.hollywoodreporter.com/", "title": "Tom Brokaw Rips \"Sensational\" Accuser Claims: I Was \"Ambushed and Then Perp Walked\"", "description": "The revered NBC News anchor accused of unwanted advances pens a strenuous denial and defense of his legacy.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2018/04/gettyimages-676856204-h_2018.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "Tom Brokaw Rips \"Sensational\" Accuser Claims: I Was \"Ambushed and Then Perp Walked\"", "description": "The revered NBC News anchor accused of unwanted advances pens a strenuous denial and defense of his legacy.", "url": "https://www.hollywoodreporter.com/news/tom-brokaw-rips-sensational-accuser-claims-i-was-ambushed-perp-walked-1106418", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2018/04/gettyimages-676856204-h_2018.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "Tom Brokaw Rips \"Sensational\" Accuser Claims: I Was \"Ambushed and Then Perp Walked\"", "sailthru.description": "The revered NBC News anchor accused of unwanted advances pens a strenuous denial and defense of his legacy.", "sailthru.author": "Marisa Guthrie", "sailthru.vertical": "Television", "sailthru.date": "2018-04-27 10:54:16", "sailthru.tags": "Home,NBC,Tom Brokaw,nsfs"}, "movies": [], "publish_date": 1524797656.0, "source": "https://www.hollywoodreporter.com", "summary": ""}