{"url": "https://www.thehollywoodgossip.com/2017/08/matt-baier-on-amber-portwood-breakup-its-all-my-fault/", "text": "If you're a Teen Mom: OG fan, then by now, you've probably heard the news that Amber Portwood and Matt Baier have broken up.\n\nFans have been hoping these two would part ways pretty much from the day they went public with their relationship, and now that Amber has a new boyfriend, it seems it's safe to say she and Matt are well and truly over.\n\nBut while TMOG viewers may be thrilled by the split, Matt is most definitely not.\n\nThe newly single Baier opened up about his split from Amber in a recent interview with E! News:\n\n\"I'm trying to do a lot of work on myself because I realize now the downfall of our relationship was my fault,\" he explained.\n\n\"When you're thrust into the spotlight like that, it can affect you. My mistake was taking our relationship for granted.\"\n\nBaier says the high-profile nature of the relationship was part of the problem (which is odd, because he never would have met Amber if she weren't on TV), but he also accepts responsibility for being a less-than-stellar partner:\n\n\"What I've learned from this is you have to do the work,\" he told the outlet.\n\n\"You have to make the person you're with feel loved every single day. I forgot to do that and now I'm paying the price.\"\n\nMatt says he's full of regrets over the way his relationship played out, and if given a second chance, he would change everything about the way he behaved.\n\n\"If I got a do-over,\" he said, \"I would do everything differently. I should have listened to her more.\"\n\nThe couple was filming a new season of the We TV reality series Marriage Boot Camp at the time of their split.\n\nMatt left the set ahead of schedule and took off for Vegas - where he's apparently been living ever since.\n\n\"I went to Vegas to get my head around the split. Ultimately, my hope was to get a place where Amber could come visit me and we could work on our issues. Obviously, that didn't happen.\"\n\nBut despite the fact that Amber is in a new relationship, Matt is still hopeful that she'll find her way back to him:\n\n\"I'll hold out hope for a reconciliation. But if nothing else, I hope we can stay friends,\" Baier says.\n\n\"We started off as best friends and that's what I miss the most from her—her friendship. To not have that is painful. When something happens, my natural instinct still is to call her and tell her everything. She was my family.\"\n\nAs though that's not depressing enough, Baier concluded the info with some insights into his day-to-day life post-Amber:\n\n\"I've been making a living through my [poker] winnings,\" he says.\n\n\"That said, I'm not really enjoying it. This isn't the life I want to live.\"\n\nYeesh. Matt may not have been the perfect boyfriend, but here's hoping he's able to pull himself out of what sounds like a pretty considerable funk.\n\nWatch Teen Mom: OG online to relive Matt and Amber's tumultuous relationship.", "images": ["https://www.thehollywoodgossip.com/assets/logo-white-beee066818238b0eb075767349f71cae.png", "https://the-hollywood-gossip-res.cloudinary.com/iu/s--km155pah--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1498575769/matt-baier-reacts.png"], "top_img": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--km155pah--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1498575769/matt-baier-reacts.png", "keywords": [], "authors": ["Tyler Johnson"], "canonical_link": "https://www.thehollywoodgossip.com/2017/08/matt-baier-on-amber-portwood-breakup-its-all-my-fault/", "title": "Matt Baier on Amber Portwood Breakup: It's All My Fault!", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 277650442346327}, "og": {"site_name": "The Hollywood Gossip", "type": "article", "url": "https://www.thehollywoodgossip.com/2017/08/matt-baier-on-amber-portwood-breakup-its-all-my-fault/", "title": "Matt Baier on Amber Portwood Breakup: It's All My Fault!", "description": "Matt Baier and Amber Portwood are officially dunz-o. Now, Baier is speaking out about the split for the first.", "image": {"identifier": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--FHn9-eO4--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1364527222/gary-shirley-and-amber.png", "type": "image/png", "width": 520, "height": 253}}, "article": {"published_time": "2017-08-18T12:09:02-04:00", "modified_time": "2017-08-18T12:08:56-04:00", "tag": "Celebrity Gossip", "author": "Tyler Johnson"}, "twitter": {"site": "thgossip", "card": "summary_large_image", "title": "Matt Baier on Amber Portwood Breakup: It's All My Fault!", "description": "Matt Baier and Amber Portwood are officially dunz-o. Now, Baier is speaking out about the split for the first.", "image": {"src": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--km155pah--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1498575769/matt-baier-reacts.png"}}, "description": "Matt Baier and Amber Portwood are officially dunz-o. Now, Baier is speaking out about the split for the first."}, "movies": [], "publish_date": 1503072542.0, "source": "https://www.thehollywoodgossip.com", "summary": ""}