{"url": "http://www.arabnews.com/node/1104606/art-culture", "text": "Kid Fourteen’s new album explores ‘real-life’ love\n\nBEIRUT: “There’s what I call a Disney version of love,” Khodor Ellaik (aka Kid Fourteen) declares with a smirk. “And then there’s real life, where love has a lot more to do with pain and the complexities of oneself.”\n\nStarting out around 10 years ago as a punk/no-wave artist with local outfit Beirut Scum Scene, the Lebanese singer, composer and producer has since taken the road less traveled by most of his rock-oriented peers. And one need look no further than his latest studio effort under the Kid Fourteen solo moniker — the beguilingly titled “Love” — for proof of his near-universal disregard for convention.\n\nPursuing a concept that started off as a personal fascination with the notion of love as addressed by Arab literature, Ellaik “slowly shifted into exploring the complexity of human intimacy, and how visceral feelings and vulnerability would sound if all other senses of expression were lost.”\n\nThe result is a sonic rabbit hole of ethereal, synth-drenched landscapes and minimalist electronic beats that provide a fitting aural backdrop for this innovative musician’s refreshingly honest musings on one of life’s most powerful, mystifying emotions.\n\n“I was fascinated by how, in Arab literature, that ‘tingly’ feeling and warmth associated with love are very sparsely talked about,” he says, “and then you’re sucked into your own black hole of emotion.\n\n“Very quickly,” he continues, “you end up with obsession — it’s no longer about pleasure; it’s more like torture.”\n\n“Love” is very much about dealing with those vertiginous vicissitudes of the heart. “Even with my own relationships, it stopped being easy to sort of pinpoint what love is, and I wanted to express that sonically,” Ellaik says.\n\nThe catalyst was the perfect collaborator: “I found the right partner in Dani (Ghassan Arbid, Ellaik’s friend and Berlin-based writer), who helped me back it all up lyrically. He happened, fortunately, to be writing about the same subject,” Ellaik explains.\n\nDespite the obvious depth and aesthetic integrity of the lyrical expression, he opted for a novel creative approach on “Love.” “Almost half the album is instrumental; I wanted to see what happens if I don’t express everything in words,” he says. “I stopped having the need to express things in an in-your-face way and wanted to be out of my comfort zone.”\n\nThe final product took about a year to complete and is something Ellaik seems immensely proud of.\n\n“I wanted this album to be its own universe, and I revisited it enough times to have very few regrets,” he states.\n\nAlmost everything about his approach to the new record is a point of departure from his previous, more guitar-driven work. “I took my time with this one... to work and rework and really try to bring the sounds I heard in my head to life,” Ellaik says. “Technically, it was more of a learning curve — I worked with new machines, didn’t use any guitars...”\n\nBut the DIY, punk ethic that defined his early work is still very much there. Ellaik produced, mixed and mastered the record himself. “It wasn’t planned at first, but then it became an essential element of the process. I started dabbling with mixing and got so deep into it that if I had handed it over to someone else, I wouldn’t even have been able to explain what I wanted,” he says with a laugh.\n\nKid Fourteen performing live. (Image courtesy of Beirut Electro Parade)\n\nEllaik has been called “one of the region’s most forward-thinking musicians” by Egypt’s Scene Noise webzine, and is known for his often-cathartic, emotive live performances. In recent years, he has toured across the Middle East and Europe, and has found that “people can identify with what you’re expressing regardless of their musical taste or background. I would like to think it’s an expression of the human condition, no matter where you are.”\n\nHe believes that in spite of all the challenges of being an indie musician in the Middle East, “It’s as good a place as any; this kind of self-expression is important and is very much a desirable thing, not only in the region, but beyond.”\n\nTo help him fully realize the vision he had for his new album, Ellaik formed the ‘kidsplay’ collective with George Junior Daou (of the Lebanese indie festival Wicker Park) and Amer Hamzeh (of Arabic rock/indie folk duo Al-Mujalak). The goal of the new label has been to “provide the infrastructure and support needed by unique artists, who struggle to find their space within the business.” The trio, who are all musicians, aspire to “help fellow artists reach a global audience”.\n\nThat kind of artistic solidarity has made kidsplay an integral cog in bringing “Love” to life. “We are all creative in our own way, and the guys, like me, have the same frustrations; you end up having this genuine interest and dedication to the project,” Ellaik says.\n\nIn the midst of a global pandemic and a situation that has put the entire world through a uniquely traumatic experience, Kid Fourteen and his collective have had to forgo the traditional promotional tactics when launching the album, which is, so far, only available digitally.\n\nBut Ellaik has plenty of plans moving forward. “I’ll be doing the Maazef platform, hosting a monthly radio show where I play fresh tunes, and I’ll be releasing a collaboration that I did with (LA-based, experimental band) XiuXiu. I love them. They have been a big influence on me.”\n\nKidsplay will also be a focal point for his creative energy, but not in front of a mic. “I want to go into music production for the next few months, helping artists attain the sound that they want,” he says enthusiastically. “Whatever we do right with ‘Love’, we can apply to other artists with their own releases. We’re all in this together, after all.”", "images": ["http://www.arabnews.com/sites/all/themes/narabnews/assets/img/logo.png?sss", "https://www.arabnews.com/sites/default/files/styles/n_670_395/public/main-image/2020/04/18/2067096-1549427393.jpg?itok=bebtL8f0", "https://www.arabnews.com/sites/default/files/styles/n_100_59/public/main-image/2020/04/18/2067001-431602626.png?itok=ifhcx78B", "http://www.arabnews.com/sites/all/themes/narabnews/assets/img/logo.png", "https://www.arabnews.com/sites/default/files/styles/n_360_212/public/main-image/2020/04/03/2043186-1492687111.jpg?itok=vIYOGyCN", "https://collector.effectivemeasure.net/noscript", "https://www.arabnews.com/sites/default/files/styles/n_100_59/public/main-image/2020/04/15/2062756-1251939963.jpg?itok=-rAYF69b", "https://www.arabnews.com/sites/default/files/styles/n_100_59/public/main-image/2020/04/16/2064311-743251771.jpg?itok=_ORrutAk", "https://www.arabnews.com/sites/default/files/styles/n_100_59/public/main-image/2020/04/18/2067096-1549427393.jpg?itok=QNL3NSI4", "https://www.arabnews.com/sites/default/files/styles/n_360_212/public/2017/05/08/907761-1804490872.jpg?itok=cPamaMj0", "http://mena-gmtdmp.mookie1.com/t/v2/learn?tagid=V2_605775&src.rand=[timestamp]", "https://www.arabnews.com/sites/default/files/styles/n_100_59/public/main-image/2020/04/18/2067051-213107197.jpg?itok=MIAjchpZ", "https://www.arabnews.com/sites/default/files/styles/n_100_59/public/main-image/2020/04/18/2067091-1378700412.png?itok=jXFE1Lga", "https://www.arabnews.com/sites/default/files/styles/n_670_395/public/2017/05/25/917756-509347835.jpg?itok=yKBFACKo", "https://www.arabnews.com/sites/default/files/styles/n_100_59/public/main-image/2020/04/14/2061211-1613417089.jpg?itok=m9wPX5UD", "https://www.arabnews.com/sites/default/files/2017/05/25/917756-509347835.jpg", "http://www.arabnews.com/sites/default/files/userimages/445491/photo_by_beirut_electro_parade.jpg", "https://www.arabnews.com/sites/default/files/styles/n_100_59/public/main-image/2020/04/18/2067071-2132061361.jpg?itok=AB8c-Ggn"], "top_img": "https://www.arabnews.com/sites/default/files/2017/05/25/917756-509347835.jpg", "keywords": [], "authors": ["Bojan Preradovic"], "canonical_link": "https://www.arabnews.com/node/1104606/art-culture", "title": "‘I’d never make it in Bollywood,’ Brad Pitt tells Shah Rukh Khan", "meta_data": {"description": "MUMBAI: Brad Pitt told Indian actor Shah Rukh Khan that he doesn’t have the moves to star in Bollywood films as he promoted his new movie “War Machine” in Mumbai on Wednesday. “I wouldn’t make it Bollywood because I can’t dance or sing,” said the American actor during an event with Khan in front of journalists in India’s financial capital. Bollywood Hindi language movies are", "abstract": "Get the latest breaking news and headlines from the largest Arab News website. Get world news, sport news, business news, entertainment, lifestyle, video and photos.", "keywords": "Jubail,Al-Ahsa,Al-Kharj,Taif,Qatif,oil,Dammam,Abha,Asir,Yanbu,islam,jobs,sports,Khalij times,gulf news,saudi gazette,Riyadh,Tabuk,Mecca,Medina,AlMadinah,Jeddah,Makkah,Hail,Mecca,Makkah,Eastern,King Abdullah, jobs in Saudi,work in saudi arabia, umrah,Hajj،عرب نيوز", "rights": "Arab News", "fb": {"app_id": 10250877124, "pages": 10250877124}, "og": {"site_name": "Arab News", "type": "article", "title": "‘I’d never make it in Bollywood,’ Brad Pitt tells Shah Rukh Khan", "url": "https://www.arabnews.com/node/1104606/art-culture", "description": "MUMBAI: Brad Pitt told Indian actor Shah Rukh Khan that he doesn’t have the moves to star in Bollywood films as he promoted his new movie “War Machine” in Mumbai on Wednesday. “I wouldn’t make it Bollywood because I can’t dance or sing,” said the American actor during an event with Khan in front of journalists in India’s financial capital. Bollywood Hindi language movies are renowned for elaborate dance sequences and high-energy songs and Khan responded by telling Pitt he could easily learn.", "updated_time": "2017-05-25T10:27:41+03:00", "image": {"identifier": "https://www.arabnews.com/sites/default/files/2017/05/25/917756-509347835.jpg", "url": "https://www.arabnews.com/sites/default/files/2017/05/25/917756-509347835.jpg"}}, "twitter": {"card": "summary_large_image", "site": {"identifier": "@Arab_News", "id": 69172612}, "creator": {"identifier": "@Arab_News", "id": 69172612}, "title": "‘I’d never make it in Bollywood,’ Brad Pitt tells Shah Rukh Khan", "url": "https://www.arabnews.com/node/1104606/art-culture", "description": "MUMBAI: Brad Pitt told Indian actor Shah Rukh Khan that he doesn’t have the moves to star in Bollywood films as he promoted his new movie “War Machine” in Mumbai on Wednesday. “I wouldn’t make it", "image": "https://www.arabnews.com/sites/default/files/2017/05/25/917756-509347835.jpg"}, "article": {"published_time": "2017-05-25T10:24:19+03:00", "modified_time": "2017-05-25T10:27:41+03:00"}, "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": 1495697059.0, "source": "http://www.arabnews.com", "summary": ""}