{"url": "www.etonline.com/news/217173_peta_murgatroyd_opens_up_about_surprise_pregnancy_and_maksim_chmerkovskiy_reaction", "text": "Peta Murgatroyd is simply glowing!\n\nThe Dancing With the Stars pro and her 4-month old son, Shai, cover the June issue of Fit Pregnancy and Baby, and in her accompanying interview with the magazine, she gets candid about her surprise pregnancy, raising a newborn with fiancé Maksim Chmerkovskiy and returning to the dance competition show just two months after giving birth.\n\n\n\nWATCH: Maksim Chmerkovskiy & Peta Murgatroyd Gush Over Their 'Happy' First Date Night Since Son's Birth\n\n\"Maks and I were so careful, but one night we weren't,\" she explains. \"Days later I had this massive hot flash and I thought, 'I better take a test.' So I did. 'What?! How?!' A tear went down my cheek, because I didn't know what to do. I was thinking, 'Do I go to work? Do I call 100 people?'\"\n\n\"I called Maks, who was in Vegas, and said, 'Well, I'm pregnant.' He thought I was kidding,\" she continues. \"When I told him I wasn't, he said, 'Wow, that's good, babe,' in kind of a monotone. It was really weird! He added, 'I'm in a car full of people. I love you so much. I'll call you back.' He did a few minutes later and he was absolutely thrilled and came straight home to celebrate.\"\n\nFit Pregnancy and Baby\n\nWhile pregnant, Murgatroyd continued to dance (that's her profession, after all!), but admits it wasn't fun -- especially with nausea. She remembers feeling extremely fatigued while rehearsing for season 22 of DWTS with Nyle DiMarco.\n\n\"I'd literally fall asleep on the couch in the studio while I was supposed to be teaching Nyle,\" she recalls. \"Eventually Nyle said, 'I know your secret.' He'd figured it out, because my boobs had grown and Maks was bringing me food every day. But Nyle and I won the season with me eight weeks pregnant!\"\n\nWATCH: 'Dancing With the Stars' Week 8 Dance Recap: Best Lifts, Kicks, Tricks and Flips!\n\nThe 30-year-old dancer confesses she also wasn't a fan of the weight gain, but remained active throughout her pregnancy.\n\n\"I gained about 40 pounds. My thighs got bigger. My boobs got bigger. My butt got ten times bigger,\" she remembers. \"I kept exercising -- light weights, walking on an incline on the treadmill and Pilates. Keeping up my core strength helped me push during the delivery.\"\n\nFit Pregnancy and Baby\n\n\"Hormones mess with your emotions,\" she adds. \"During pregnancy, little things would set me off. I burst into tears because I thought the baby's going-home outfit wasn't the right color. Also, usually I'm obsessed with gourmet cheese. Maks came home with a bag full of it. He was being sweet, but I said, 'I'll puke if you make me eat that.' Instead I went through a pasta phase, eating it with oil and salt at six in the morning.\"\n\nBut all of those things no longer mattered when baby Shai finally arrived at 5:34 a.m. on Jan. 4, 2017, weighing in at 7 pounds 11 ounces.\n\n\"Half the time Maks and I were laughing, half the time we were staring at the monitor. Sometime during the night, my water broke. I pushed for 30 minutes and he was here!\" she says. \"Suddenly my baby was on my chest. Maks and I were in shock for the first 30 seconds. Then Maks started to cry, and then I did too. Shai looked at me, took his first breath and just made a little noise. It was the best day of my life.\"\n\nFit Pregnancy and Baby\n\nWATCH: Peta Murgatroyd Pumps Breastmilk Before ‘DWTS’: ‘My Milkshakes Do Not Bring All the Boys to the Yard’\n\nShortly after welcoming little Shai into the world, the Auckland, New Zealand, native was already thinking about whether she'd return to work and commit to DWTS' current 24th season. She ultimately said yes, and was paired with Bachelor star Nick Viall. The two were sent home during week seven of the competition.\n\n\"I got the call to come back on the show right after Shai was born. I said yes, but after I hung up, I said to Maks, 'I don't think I can do this,'\" she recalls. \"He reassured me. I returned with new agreements -- there'd be a limit to my hours. Even so, much of the time when I [went] to work, I [had] tears in my eyes. Shai gives me this beautiful smile, and all I want to do is stay home for an extra hour. Then I think, 'The sooner I go, the sooner I can get back.' After work, I hurry home.\"\n\n\"When I returned to work I still had 20 to 25 extra pounds on me,\" she continues. \"It was tough. But now, even with ten pounds to go, I feel good. I want to show women you should be proud of where you are. Don't always look into the future, or you'll miss the now. That said, I'd love to have my pre-baby boobs back by my wedding day!\"\n\nFit Pregnancy and Baby\n\nET recently caught up with Murgatroyd and Chmerkovskiy at the 24th Annual Race to Erase MS Gala in Los Angeles, where they opened up about how parenting has been going thus far. The event marked the adorable duo's first official \"date night\" since Shai's arrival.\n\n\n\nWATCH: Maksim Chmerkovskiy & Peta Murgatroyd Talk 'DWTS' Destiny, How Life Has Changed Since Becoming Parents\n\n\"I don't think you can stay the same person,\" Murgatroyd exclaimed. \"I think once you have a baby it changes your whole life, your whole world, in a good way. But there's nothing sexier, there's nothing more beautiful than seeing your man fall in love with your child even more every day. It's the best.\"\n\nHear more from the exclusive interview in the video below!\n\nEXCLUSIVE: Maksim Chmerkovskiy and Peta Murgatroyd On How Life Has Changed Since Baby Shai This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRelated Gallery", "images": ["http://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-05/1280_peta_murgatroyd_shai_103032299_EMBED.jpg?itok=XuxxRuyk", "http://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/eto_clip_90_day_fiance_lisa_usman_041220.jpg?h=f78b8ebb&itok=gLZYbFOX", "http://www.etonline.com/themes/custom/et/img/watch-now.png", "http://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-05/1280_peta_murgatroyd_shai_103032297.jpg?itok=VVkLL-n-", "http://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/johnny_was_face_masks_0.jpg?h=c673cd1c&itok=-MxuZPP5", "http://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-05/1280_peta_murgatroyd_FPB0617COVER.jpg?itok=wGchUq_r", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-05/1280_peta_murgatroyd_shai_103032299.jpg?itok=D7VzfC8Z", "http://www.etonline.com/sites/default/files/styles/970xh/public/images/2017-05/1280_peta_murgatroyd_103032296.jpg?itok=0IijaEys", "http://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2017-05/1280_peta_murgatroyd_shai_103032299.jpg?itok=rSJPkcus", "http://www.etonline.com/sites/default/files/styles/840x470/public/images/2019-12/celebkids_eod.png?h=dc0df84a&itok=ZFPdSjrT"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-05/1280_peta_murgatroyd_shai_103032299.jpg?itok=D7VzfC8Z", "keywords": [], "authors": ["Desiree Murphy"], "canonical_link": "https://www.etonline.com/news/217173_peta_murgatroyd_opens_up_about_surprise_pregnancy_and_maksim_chmerkovskiy_reaction", "title": "Peta Murgatroyd Talks Surprise Pregnancy and Maksim Chmerkovskiy's Reaction: 'He Thought I Was Kidding!'", "meta_data": {"article": {"opinion": "false"}, "title": "Peta Murgatroyd Talks Surprise Pregnancy and Maksim Chmerkovskiy's Reaction: 'He Thought I Was Kidding!' | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/news/217173_peta_murgatroyd_opens_up_about_surprise_pregnancy_and_maksim_chmerkovskiy_reaction", "title": "Peta Murgatroyd Talks Surprise Pregnancy and Maksim Chmerkovskiy's Reaction: 'He Thought I Was Kidding!'", "description": "The 'Dancing With the Stars' pro gets candid on the moment she found out she was expecting.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-05/1280_peta_murgatroyd_shai_103032299.jpg?itok=D7VzfC8Z", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "The 'Dancing With the Stars' pro gets candid on the moment she found out she was expecting.", "title": "Peta Murgatroyd Talks Surprise Pregnancy and Maksim Chmerkovskiy's Reaction: 'He Thought I Was Kidding!'", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Desiree Murphy", "url": "https://www.etonline.com/news/217173_peta_murgatroyd_opens_up_about_surprise_pregnancy_and_maksim_chmerkovskiy_reaction", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2017-05/1280_peta_murgatroyd_shai_103032299.jpg?itok=D7VzfC8Z"}, "description": "The 'Dancing With the Stars' pro gets candid on the moment she found out she was expecting.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, Peta Murgatroyd, Dancing With The Stars, Maksim Chmerkovskiy", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "http://www.etonline.com", "summary": ""}