{"url": "https://en.wikipedia.org/wiki/Law_%26_Order:_Special_Victims_Unit_(season_1)", "text": "Season of television series Law & Order: Special Victims Unit\n\nLaw & Order: Special Victims Unit, an American police procedural television series, premiered on September 20, 1999 on NBC. Created by Dick Wolf, it is the first spin-off of Law & Order and follows the detectives of a fictionalized version of the New York City Police Department's Special Victims Unit, which investigates sexually based offenses. SVU originally aired on Monday nights at 9pm/8c EST, but it was moved to Friday nights at 10pm/9c after the ninth episode. Showrunner Robert Palm felt too disturbed by the subject matter and left after the season's conclusion.[1]\n\nProduction [ edit ]\n\nInspiration for the series came from a 1986 murder in Central Park committed by Robert Emmet Chambers whose strategy in court was to sexualize the victim.[2] The season one episode of Law & Order, \"Kiss the Girls and Make them Die\" is based on this case. Dick Wolf wanted to continue exploring similar themes in a dedicated legal drama and hired Ted Kotcheff and Robert Palm as executive producers of the new series, as well as Jean de Segonzac, the franchise director for Law & Order. Robert Palm was previously an executive producer on Law & Order and was the first person to use the term \"mothership\" to distinguish the original from its spin-offs.[3] This phrase has become popular with fans of the franchise.\n\nUnlike the original Law & Order, filming for SVU began in North Bergen, New Jersey since there was not enough real estate available to get a studio in Manhattan. The production staff were still told to think of the area as being Manhattan.[4] As with Law & Order, writers for the series primarily worked in Los Angeles. However, SVU featured more female writers with the series aiming to bring a \"strong woman's perspective\" to the screen.[3] Writer Dawn DeNoon has mentioned that many of the writing staff were fired during the first season because their scripts were not up to par.[1]\n\nFor the lead roles, Christopher Meloni was cast as Detective Elliot Stabler and Mariska Hargitay was cast as Detective Olivia Benson after they auditioned together.[5] Hargitay, who had to move from Los Angeles to New York when she got the role, said she was able to do this on short notice because she was already planning on moving to New York to pursue a Broadway career.[6] The squad commander role was filled by Dann Florek, who had portrayed Captain Don Cragen for the first three seasons on the original Law & Order and later reprised his role in Exiled: A Law & Order Movie. He joined the cast on the condition that he not be asked to audition.[1] Richard Belzer was cast as Detective John Munch, continuing his role from the series Homicide: Life on the Street. In Belzer's words, he was cast because \"Dick Wolf and Tom Fontana got drunk at a party\".[7] Halfway through the season, Richard Belzer reprised his role of Munch in Homicide: The Movie, which briefly shows his character out on a case in his SVU context in New York. At Belzer's insistence, his character was partnered with Brian Cassidy, who was portrayed by Dean Winters. However, Winters' contractual obligation to the HBO series Oz forced him to leave halfway through the season. Michelle Hurd, who portrayed Detective Monique Jeffries, filled Winters' void for the remainder of the season, and was at that point added to the main credits.\n\nCast [ edit ]\n\nMain cast [ edit ]\n\nRecurring cast [ edit ]\n\nGuest stars [ edit ]\n\nJennifer Esposito played reporter Sarah Logan, a rape victim who is also targeted by a stalker.\n\nThe first season featured the highest number of crossover appearances in SVU. Angie Harmon portrayed her Law & Order character ADA Abbie Carmichael for six episodes. Jerry Orbach (Det. Lennie Briscoe) and his new partner Jesse L. Martin (Det. Ed Green) were shown working together in the third episode. Almost the entire cast of the original series appeared in the crossover episode \"Entitled.\" Another character establishing ties to the original was Detective Ken Briscoe, the nephew of Lennie Briscoe. He was played by Chris Orbach, the son of Jerry Orbach. The younger Orbach later said that he had mixed feelings about his role on the show, as he felt he \"only got the gig because of [his] old man.\"[8] Years after that, he'd admit to friends that he was simply very nervous on set about living up to his dad, and felt out of his depth.\n\nFamily members of both lead detectives appeared in the opening episode. Kathy Stabler, Elliot Stabler's wife, was played by Isabel Gillies. Gillies continued to play Kathy Stabler over the course of the next 11 years either as a guest star or a recurring actress. She recalled that she was in the middle of buying a wedding dress when she got the call to be on SVU.[4] Elizabeth Ashley was cast to play Serena Benson, Olivia's mother. Serena Benson did not appear in SVU again but was mentioned several times. Her character's history of being a rape victim who never got justice—and whose attacker was Olivia's biological father—figures in many later episodes.\n\nAndrew McCarthy guest starred as Randolph Morrow, a sadistic rapist who keeps a sex slave locked in his room.\n\nSome of the earliest revelations about Detective Benson's personal life are found in \"Stalked.\" In this episode, Bruce Kirkpatrick played a rapist who decides to intimidate the detectives once he learns that he is under investigation. An episode dealing with mental illness, \"The Third Guy,\" featured a guest performance by Denis O'Hare. He played an intellectually disabled rapist who elicits differing opinions in the SVU.\n\nThe episode \"Closure\" aired shortly before Detective Brian Cassidy left the Special Victims Unit. However, because of its nonlinear storytelling, it portrayed Cassidy as still working for the unit months later. Despite the continuity error, the producers decided to revisit this episode in the second season owing to the cliffhanger ending and Tracy Pollan's well-received performance as Harper Anderson, a rape victim who becomes obsessed with taking revenge on her attacker. She was nominated for the Primetime Emmy Award for Outstanding Guest Actress in a Drama Series.[9]\n\nReiko Aylesworth was one of the actresses who originally auditioned for the role of Olivia Benson.[5] Instead, she was cast as Assistant District Attorney Erica Alden, whom she played in the last three episodes of the season. In the season's penultimate episode, \"Nocturne,\" Kent Broadhurst played Lawrence Holt, a piano teacher who molests his students. Wilson Jermaine Heredia played Evan, Holt's student and victim, who knows more about Holt's crimes than he lets on.\n\nEpisodes [ edit ]\n\nReferences [ edit ]\n\nBibliography [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/0/03/L%26O_season_1_DVD.jpg/220px-L%26O_season_1_DVD.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Andrew_McCarthy_Shrek_Shankbone_2010_NYC.jpg/150px-Andrew_McCarthy_Shrek_Shankbone_2010_NYC.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/0/03/L%26O_season_1_DVD.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Jennifer_Esposito.jpg/150px-Jennifer_Esposito.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/0/03/L%26O_season_1_DVD.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Law_%26_Order:_Special_Victims_Unit_(season_1)", "title": "Law & Order: Special Victims Unit (season 1)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/0/03/L%26O_season_1_DVD.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}