{"url": "https://www.hollywoodreporter.com/news/olympic-gymnast-mckayla-maroney-alleges-team-doctor-molested-her-1049944", "text": "The two-time medalist posted a lengthy statement on Twitter early Wednesday that detailed the allegations of abuse against Dr. Larry Nassar, who spent three decades working with athletes at USA Gymnastics but now is in jail in Michigan awaiting sentencing after pleading guilty to possession of child pornography.\n\nTwo-time Olympic medalist McKayla Maroney says she was molested for years by a former USA Gymnastics team doctor, abuse she said started in her early teens and continued for the rest of her competitive career.\n\nMaroney posted a lengthy statement on Twitter early Wednesday that detailed the allegations of abuse against Dr. Larry Nassar, who spent three decades working with athletes at USA Gymnastics but now is in jail in Michigan awaiting sentencing after pleading guilty to possession of child pornography. Nassar also is awaiting trial on separate criminal sexual conduct charges and has been sued by more than 125 women alleging abuse.\n\nNassar has pleaded not guilty to the assault charges, and the dozens of civil suits filed in Michigan are currently in mediation.\n\nMaroney, now 21, says the abuse began while she attended a U.S. National team training camp at the Karoyli Ranch in the Sam Houston Forest north of Houston. Maroney was 13 at the time and wrote Nassar told her she was receiving \"medically necessary treatment he had been performing on patients for over 30 years.\" Maroney did not detail Nassar's specific actions.\n\nMaroney, who won a team gold and an individual silver on vault as part of the \"Fierce Five\" U.S. women's team at the 2012 Olympics in London, said Nassar continued to give her \"treatment\" throughout her career. She described Nassar giving her a sleeping pill while the team traveled to Japan for the 2011 world championships. Maroney says Nassar later visited her in her hotel room after the team arrived in Tokyo, where he molested her yet again.\n\n\"I thought I was going to die that night,\" Maroney wrote.\n\nMaroney did not immediately return an interview request from the Associated Press. Attorneys for Nassar had no comment. USA Gymnastics also had no immediate comment.\n\nMaroney says she decided to come forward as part of the \"#MeToo\" movement on social media that arose in the wake of allegations of sexual misconduct against Hollywood mogul Harvey Weinstein.\n\n\"This is happening everywhere,\" Maroney wrote. \"Wherever there is a position of power, there is the potential for abuse. I had a dream to go to the Olympics, and the things I had to endure to get there, were unnecessary and disgusting.\"\n\nMaroney called for change, urging other victims to speak out and demanding organizations \"be held accountable for their inappropriate actions and behavior.\"\n\nMaroney is the highest-profile gymnast yet to come forward claiming she was abused by Nassar. Jamie Dantzscher, a bronze medalist on the 2000 U.S. Olympic team, was part of the initial wave of lawsuits filed against Nassar in 2016. Aly Raisman, who won six medals while serving as the captain of the U.S. women's team in both 2012 and 2016, called for sweeping change at USA Gymnastics in August.\n\nUSA Gymnastics launched an independent review of its policies in the wake of the allegations against Nassar in the summer of 2016 following reporting by the Indianapolis Star that highlighted chronic mishandling of abuse allegations against coaches and staff at some of its more than 3,500 clubs across the country.\n\nIn June, the federation immediately adopted 70 recommendations proffered by Deborah Daniels, a former federal prosecutor who oversaw the review. The new guidelines require member gyms to go to authorities immediately, with Daniels suggesting USA Gymnastics consider withholding membership from clubs that decline to do so. The organization also named Toby Stark, a child welfare advocate, as its director of SafeSport. Part of Stark's mandate is educating members on rules, educational programs, reporting and adjudication services.\n\nUSA Gymnastics had initially agreed to purchase the training facility at the Karolyi Ranch following longtime national team coordinator Martha Karolyi's retirement shortly after the 2016 Olympics ended. The organization has since opted out of that agreement. The organization also fired president Steve Penny in March. A replacement has not been named.\n\nMaroney, who lives in California and officially retired in 2015, encouraged others to speak out.\n\n\"Our silence has given the wrong people power for too long,\" she wrote, \"and it's time to take our power back.\"", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/03/writerimage-thr.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/2017/10/gettyimages-182931758-h_2017.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/landscape_928x523/2017/10/gettyimages-182931758-h_2017.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/10/gettyimages-182931758-h_2017.jpg", "keywords": [], "authors": ["The Associated Press", "Thrnews Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/news/olympic-gymnast-mckayla-maroney-alleges-team-doctor-molested-her-1049944", "title": "Olympic Gymnast McKayla Maroney Alleges Team Doctor Molested Her", "meta_data": {"viewport": "width=device-width", "description": "The two-time medalist posted a lengthy statement on Twitter early Wednesday that detailed the allegations of abuse against Dr. Larry Nassar, who spent three decades working with athletes at USA Gymnastics but now is in jail in Michigan awaiting sentencing after pleading guilty to possession of child pornography.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/news/olympic-gymnast-mckayla-maroney-alleges-team-doctor-molested-her-1049944", "domain": "https://www.hollywoodreporter.com/", "title": "Olympic Gymnast McKayla Maroney Alleges Team Doctor Molested Her", "description": "The two-time medalist posted a lengthy statement on Twitter early Wednesday that detailed the allegations of abuse against Dr. Larry Nassar, who spent three decades working with athletes at USA Gymnastics but now is in jail in Michigan awaiting sentencing after pleading guilty to possession of child pornography.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/10/gettyimages-182931758-h_2017.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "Olympic Gymnast McKayla Maroney Alleges Team Doctor Molested Her", "description": "The two-time medalist posted a lengthy statement on Twitter early Wednesday that detailed the allegations of abuse against Dr. Larry Nassar, who spent three decades working with athletes at USA Gymnastics but now is in jail in Michigan awaiting sentencing after pleading guilty to possession of child pornography.", "url": "https://www.hollywoodreporter.com/news/olympic-gymnast-mckayla-maroney-alleges-team-doctor-molested-her-1049944", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/10/gettyimages-182931758-h_2017.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "Olympic Gymnast McKayla Maroney Alleges Team Doctor Molested Her", "sailthru.description": "The two-time medalist posted a lengthy statement on Twitter early Wednesday that detailed the allegations of abuse against Dr. Larry Nassar, who spent three decades working with athletes at USA Gymnastics but now is in jail in Michigan awaiting sentencing after pleading guilty to possession of child pornography.", "sailthru.author": "the Associated Press", "sailthru.vertical": "Culture", "sailthru.date": "2017-10-18 08:45:20", "sailthru.tags": "Culture,Olympics,Summer Olympics,Summer Olympics 2012,Sports"}, "movies": [], "publish_date": 1508287520.0, "source": "https://www.hollywoodreporter.com", "summary": ""}