{"url": "https://popculture.com/celebrity/2018/04/30/katy-perry-orlando-bloom-roman-colosseum-selfie-dating-again/", "text": "After getting the chance to meet Pope Francis on Saturday, Katy Perry and Orlando Bloom shared a video of themselves cozying up inside the Roman Coliseum on Sunday.\n\n\"Here I am once again at the Roman Colosseum,\" Perry said in a video, which was added to her Instagram stories. \"Just another metaphor for my life online.\"\n\n(Photo: Instagram/@katyperry)\n\nPEOPLE reported on Sunday that the two are back to dating each other exclusively once again.\n\n\"Orlando and Katy are great. They are dating exclusively again and things seem more serious,\" a source told the magazine. \"They are both excited about it and don't want to hide, but at the same time they are trying to keep privacy as well.\"\n\nThe source indicated Bloom was especially happy to be in a relationship again.\n\n\"[Bloom] seems very happy. It's obvious that they both missed each other after their split,\" the source said.\n\n\"Their relationship seems stronger now,\" they continued. \"Orlando got sick of being single. Dating different women is not so alluring to him anymore.\"\n\nThe actor and singer first started dating in 2016, but broke the relationship off in March 2017.\n\n\"Katy pulled the plug,\" a source told E! News at the time. \"It was a few events that happened over the past few months. They both still love each other very much, though, and getting back together could happen once they have some space.\"\n\nPerry is currently starring as a judge on the American Idol revival, alongside country singer Luke Bryan and music legend Lionel Richie.\n\nIn the latest episode, Perry turned plenty of heads while dressing up as Snow White for the Disney-themed round of competition\n\n\"We have our very own princess tonight,\" host Ryan Seacrest said when she first arrived at the judge's table in full costume. \"Katy that is... I'm totally surprised. That is incredible.\"\n\n\"Isn't it all so magical?\" Perry responded, giving her best impression of the character's squeaky voice.\n\n\"Maybe we'll find out whether she has a prince later in the show,\" Seacrest joked.\n\nShe made a similar comment earlier on the American Idol Instagram Story, teasing, \"Maybe you'll meet my prince!\"\n\n\"It's probably not me,\" fellow judge Luke Bryan joked.\n\nThe episode narrowed the field of contestants from 10 to seven, with Ada Fox, Michelle Sussett and Dennis Lorenzo all being eliminated. The final seven includes Maddie Poppe, Jurnee, Cade Foehner, Gabby Barrett, Michael Woodard, Caleb Lee Hutchinson and Catie Turner.", "images": ["https://media.popculture.com/2018/04/katy-perry-orlando-bloom-roman-coliseium-instagram-20033400.jpeg", "https://media.popculture.com/2017/05/default-1.png"], "top_img": "https://media.popculture.com/2017/05/default-1.png", "keywords": [], "authors": [], "canonical_link": "https://popculture.com/celebrity/2018/04/30/katy-perry-orlando-bloom-roman-colosseum-selfie-dating-again/", "title": "Katy Perry and Orlando Bloom Cozy up for Colosseum Selfie in Rome", "meta_data": {"description": "After getting the chance to meet Pope Francis on Saturday, Katy Perry and Orlando Bloom shared a video of themselves cozying up inside the Roman Coliseum on Sunday.'Here I am once again at the Roman Colosseum,' Perry said in a video, which was added to her Instagram stories. 'Just another metaphor [...]", "keywords": "Katy Perry,Orlando Bloom,Celebrity Couples", "news_keywords": "Katy Perry,Orlando Bloom,Celebrity Couples", "twitter": {"card": "summary", "site": "@PopCulture", "creator": "@PopCulture", "title": "Katy Perry and Orlando Bloom Cozy up for Colosseum Selfie in Rome", "description": "After getting the chance to meet Pope Francis on Saturday, Katy Perry and Orlando Bloom shared a [...]", "image": "https://media.popculture.com/2017/05/default-1.png"}, "og": {"title": "Katy Perry and Orlando Bloom Cozy up for Colosseum Selfie in Rome", "type": "article", "url": "https://popculture.com/celebrity/2018/04/30/katy-perry-orlando-bloom-roman-colosseum-selfie-dating-again/", "image": {"identifier": "https://media.popculture.com/2017/05/default-1.png", "width": 640, "height": 320}, "site_name": "Celebrity", "description": "After getting the chance to meet Pope Francis on Saturday, Katy Perry and Orlando Bloom shared a [...]"}, "fb": {"app_id": 398373180287205, "pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1525017600.0, "source": "https://popculture.com", "summary": ""}