{"url": "https://www.self.com/story/chloe-grace-moretz-olive-oil-facewash", "text": "Chloë Grace Moretz has flawless skin, but the 19-year-old actress says it hasn’t always been that way. In an interview with Allure, Moretz says she had bad cystic acne when she was growing up. Now, she says her skin is acne-free thanks to Accutane and a healthy diet, but she points out that having skin problems “was a long, hard, emotional process.”\n\nMoretz says she also works to keep her skin gorgeous thanks to an unorthodox facial cleansing method: She washes her face with olive oil. “I swear my skin is so much clearer because of it,” Moretz tells Allure.\n\nIt sounds weird, but Moretz isn’t the only one on the oil-cleansing bandwagon. Pinterest features several pins on olive oil face wash how-tos.\n\nThe American Academy of Dermatology recommends that people look for a cream or ointment that contains olive or jojoba oil to combat dry skin, but makes no mention of actually cleansing with it. But Gary Goldenberg, M.D., medical director of the Dermatology Faculty Practice at the Icahn School of Medicine at Mount Sinai, tells SELF that there is something to washing your face with olive oil—especially if you have dry skin or eczema. “Olive oil is known to have anti-inflammatory properties,” he says. “It's also a very good moisturizer.” Goldenberg says he has many patients who wash with either olive oil or other natural oils.\n\nFans of oil cleansing—and there are many—say it works by dissolving the oils that are already on your face. Cynthia Bailey, M.D., a diplomat of the American Board of Dermatology and president and CEO of Advanced Skin Care and Dermatology Inc., tells SELF that this is correct. \"Oil will dissolve oily skin residue because like dissolves like,\" she explains. \"If you use moisturizers or makeup that are oil-based, the olive oil will help to remove them.\"\n\nAva Shamban, M.D., a Beverly Hills dermatologist and founder of SKINxFIVE, tells SELF that olive oil is a \"great choice\" of a face wash. \"Using oil will not only remove makeup, but will avoid stripping the skin of natural oils,\" she says. \"Olive oil also has many antioxidants and natural lipids that will replenish lipids that have been lost in sun-damaged, older, or dry skin.\"\n\nWashing your face with olive oil is as simple as it sounds: Apply a warm, moist washcloth to your face for about 20 seconds to heat up what is on your skin, massage the oil into your skin to help dissolve the oil residue (consider washing your hands first!), then remove the oil and dissolved debris with a warm, wet washcloth, Bailey says (you can use the back of the one you were already using or rinse it first).\n\nSince olive oil is moisturizing, you may not even need to use a moisturizer afterward. However, if your skin still feels dry, Goldenberg recommends applying your usual moisturizer.\n\nIf olive oil isn't your thing, other oils can have a similar effect, Goldenberg says. He recommends organic vitamin E to patients who suffer from dry skin. “It’s cheap and very versatile,” he says. Jojoba oil is another good option, he says. (Sebum, the oily secretion of your glands, is most made up of glycerides, free fatty acids, and wax esters, and jojoba oil is mostly made of wax esters and fatty acids—meaning it’s very similar to the natural oil on your skin.) Bailey also recommends almond, apricot, avocado, and coconut oils, which, like olive oil, are \"moderately comedogenic\" (meaning although they can cause breakouts, it's not super likely).\n\nBut Goldenberg says this is not for everyone. “I would not recommend this for patients with oily skin, acne, and those with enlarged pores or acne-prone skin,” he says. The oil can clog pores and actually make these issues worse.\n\nIf this describes your skin, he recommends leaving the olive oil in your kitchen and sticking with a gentle face wash like Cetaphil or Cerave. Of course, it’s always a good idea to talk to your doctor before switching up your skincare routine—especially if you have sensitive skin.\n\nRelated:\n\nYou may also like: How To Do A Metallic Smoky Eye", "images": ["https://media.self.com/photos/581b853b23409a497ffd3cbc/4:3/w_2560%2Cc_limit/chloe-grace-moretz-oil-cleansing.jpg", "https://www.self.com/verso/static/self/assets/logo-reverse.22fddcfca2f2de42711a84ec66a5157a9995d8ab.svg", "https://media.self.com/photos/581b853b23409a497ffd3cbc/2:1/w_1280,c_limit/chloe-grace-moretz-oil-cleansing.jpg", "https://www.self.com/verso/static/self/assets/logo-header.64f3bdc15b1f321829f9f30c7853a1469f469d71.svg", "https://media.self.com/photos/5b881cac9134316166c7782c/1:1/w_90%2Cc_limit/headshot_korin.jpg"], "top_img": "https://media.self.com/photos/581b853b23409a497ffd3cbc/2:1/w_1280,c_limit/chloe-grace-moretz-oil-cleansing.jpg", "keywords": [], "authors": ["Korin Miller", "Korin Mille"], "canonical_link": "https://www.self.com/story/chloe-grace-moretz-olive-oil-facewash", "title": "Chloë Grace Moretz Washes Her Face With Olive Oil, And It's Genius", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Korin Miller", "copyright": "Copyright (c) Condé Nast 2020", "description": "Dermatologists say she's on to something. Here, they discuss why oil cleansing can be great for your skin.", "id": "581b552623409a497ffd3ca1", "keywords": "skin,chloe grace moretz,oil cleansing,news,skin care", "news_keywords": "skin,chloe grace moretz,oil cleansing,news,skin care", "robots": "index, follow", "content-type": "article", "parsely-post-id": "581b552623409a497ffd3ca1", "parsely-metadata": "{\"description\":\"Dermatologists say she's on to something. Here, they discuss why oil cleansing can be great for your skin.\",\"image-16-9\":\"https://media.self.com/photos/581b853b23409a497ffd3cbc/16:9/w_1000,c_limit/chloe-grace-moretz-oil-cleansing.jpg\",\"image-1-1\":\"https://media.self.com/photos/581b853b23409a497ffd3cbc/1:1/w_1000,c_limit/chloe-grace-moretz-oil-cleansing.jpg\"}", "og": {"description": "Dermatologists say she's on to something.", "image": "https://media.self.com/photos/581b853b23409a497ffd3cbc/2:1/w_1280,c_limit/chloe-grace-moretz-oil-cleansing.jpg", "site_name": "SELF", "title": "Chloë Grace Moretz Washes Her Face With Olive Oil To Maintain Her Gorgeous Skin", "type": "article", "url": "https://www.self.com/story/chloe-grace-moretz-olive-oil-facewash"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@SELFmagazine", "description": "Dermatologists say she's on to something.", "domain": "https://www.self.com", "image": {"src": "https://media.self.com/photos/581b853b23409a497ffd3cbc/2:1/w_1280,c_limit/chloe-grace-moretz-oil-cleansing.jpg?mbid=social_retweet"}, "site": "@SELFmagazine", "title": "Chloë Grace Moretz Washes Her Face With Olive Oil To Maintain Her Gorgeous Skin"}, "fb": {"app_id": 169640983205651, "pages": 8908243810}}, "movies": [], "publish_date": null, "source": "https://www.self.com", "summary": ""}