{"url": "https://ew.com/tv/2018/06/22/marvels-luke-cage-boss-breaks-down-chilling-season-2-finale-defends-13-episode-seasons/", "text": "Image zoom David Lee/Netflix; Inset: Steven Ferdman/FilmMagic\n\nMarvel's Luke Cage type TV Show network Netflix genre Comic/Graphic Novel\n\nWarning: The following contains spoilers for season 2 of Marvel's Luke Cage. Read at your own risk!\n\nBy the end of his standalone series' second season, Luke Cage (Mike Colter) is no longer just Harlem's hero, but Harlem's…crime boss?\n\nIn a final, shocking move, Mariah Dillard (Alfre Woodard) left Harlem's Paradise to Luke in her will. After her death, Luke — in an even more shocking move — decided to take it, thinking he'll be able to see criminal goings-on much more clearly from the perch above the club. Yet, in his final scene, he acts just like the crime bosses he hated, even donning a new wardrobe to underline his transformation.\n\nTo figure out what this means for the bulletproof Defender's future, EW chatted with Marvel's Luke Cage showrunner Cheo Hodari Coker, who penned the finale. Below, Coker dives into Luke's decision, how he chose which villains to feature in season 2, and what he thinks of criticisms over the show being too long.\n\nImage zoom David Lee/Netflix\n\nENTERTAINMENT WEEKLY: Is Luke 100 percent comfortable with his choice to take over Harlem's Paradise, to essentially become just like the people he vowed to remove? He can't be, can he?\n\nCHEO HODARI COKER: When we filmed the episode, the script called for Luke to be more reluctant, to reluctantly look out at all that he surveyed. Mike didn't play it like that. To his credit, he refused all notes to play it differently, and he absolutely made the right choice, because it's chilling. If you immediately go from watching episode 13 of season 2 and go back to episode 1 of season 1, it's chilling how much Mike in that three-piece suit looks like Cottonmouth [played by Mahershala Ali].\n\nThe tonal shift can be shocking, but once given power, people kind of show off who they really are. That was what Mariah was trying to say, that you often go in thinking that things are going to be different when it's your administration, but [once you're there] you start making the kinds of decisions that the previous administration made. It's the same lesson that Michael Corleone got [in The Godfather]… So, is my view for Luke Cage, or Luke Corleone, more pessimistic? I would say no, but it's interesting to play with.\n\nYou call him \"Luke Corleone\"; D.W. [Jeremiah Craft] calls him \"Luke Trump\" in an earlier scene. Luke's getting a lot of nicknames that are nothing like \"Harlem's hero.\"\n\nIt's a lesson from [The Wire creator] David Simon. He used season 3 of The Wire to not only talk about a war between two drug organizations in Baltimore, but also to describe the then-current Iraq War… So for us, it's like, are we making an analogy about the Trump administration? Yes, we are, but if you don't get the references, it's okay.\n\nNow the only fear I have is that someone would make the mistake of having the notion that Luke is conservative. God forbid somebody misinterprets that line as us trying to give Trump a shout-out. That's not the case at all. What we're saying is that this place is shaken up by a reformer who has no experience, who thinks that having all power is going to solve things. That's dangerous. That's what D.W. is saying. I think, ultimately, [the comparison] elevates the season.\n\nWhat made you want to end the season on this note? Was there something that compelled you to wrap up the season without the superhero being the moral compass, or even in the right? Why end like this?\n\nBecause I want people to clamor for a season 3. [Laughs] If all is well and everything's great, then, like, I'd rather play Fortnite, you know? [Laughs] I want people to question who Luke Cage is. If season 1 was \"Who is Luke Cage?\" then season 2 is \"This is Luke Cage,\" but then season 3 is \"Who is Luke Cage, really?\"\n\nLet's talk about Mariah, who's murdered by her own daughter, Tilda [Gabrielle Dennis], and departs the show. How did Alfre react to being told she'd be leaving the series?\n\nAt the very beginning of the season, when I told her the Tilda twist, she screamed at the table, \"Oh my God!\" As I talked to her about the things she was going to do, she said, \"Y'all are going to kill me this season, aren't you?\" [Laughs] I said, \"Yeah, we're killing you,\" and she said, \"Alright, when you kill me, just make sure I don't go out like a punk.\" Alfre wanted to go out in a blaze of glory, but I said, \"No one's going to shoot you. It's going to be a lot more emotional than that.\" I love writing for Alfre. She's so playful. She makes for a wonderful villain.\n\nImage zoom Sarah Shatz/Netflix Sarah Shatz/Netflix\n\nSpeaking of villains, I was expecting Diamondback [Erik LaRay Harvey] to show up again after last season's tease. Why not include him at all this season?\n\nHere's the thing: I love Diamondback, and I love Erik LaRay Harvey. It was Erik's audition for Cottonmouth that changed the trajectory of the series. He gave such an incredible Cottonmouth audition that it made us say, \"Okay, we gotta reassess the age of Cottonmouth and, knowing that we have such a strong actor for the back half of the season, let's cast Erik as Diamondback and look for another Cottonmouth.\"\n\nI had always planned on killing Cottonmouth off. That was always going to be the twist. What none of us anticipated was that, while we knew that Mahershala was going to be incredible, we didn't know that people were going to be so emotionally attached to him that they would be pissed at the show for killing him. It was really hard on Erik because, as [Marvel TV head] Jeph Loeb said, \"Mahershala couldn't follow Mahershala.\" [Laughs]\n\nSo it might have been interesting to follow up immediately with Diamondback, but again, that's the thing: There will hopefully be other opportunities to explore different storylines. I'm extremely happy with the one that we have right now.\n\nJust to clarify, your decision not to bring Diamondback back this season was because of the fan reaction?\n\nIt's honestly because of, if you follow the Marvel pattern, it's like, you don't directly follow up with last season's storyline immediately. Look at something like Daredevil: They did [season 2 with] the Punisher and other storylines.\n\nSo that means if you get a third season, we won't see Bushmaster [Mustafa Shakir] return?\n\nI mean, if I tell you everything, why watch season 3? [Laughs]\n\nImage zoom Netflix; Myles Aronowitz/Netflix Netflix; Myles Aronowitz/Netflix\n\nFair enough — but what is the status on season 3?\n\nNetflix likes critical attention and they like their analytics. I think review-wise, we've done pretty well. People seem to like the show except for [Rolling Stone TV critic] Alan Sepinwall, but so be it. I come from hip-hop — meaning that I don't mind if you come at me. In fact, I prefer it. But I prefer that you come at the show with credible critique. Don't say, \"Out of 13 hours, only four weren't a waste of time.\" I really felt that [Vulture writer] Angelica Bastién‘s criticisms of the show last season were so eloquent and so well written that her challenges to us helped the show.\n\nBecause I'm a former critic, I view criticism differently than most do. I can take criticism but if you're going to eviscerate us, be specific. Don't be lazy, because I can tell whether or not you've seen all 13. But to get back to your question: Netflix always likes to take their time to think about things. Do things look good for a season 3? I hope, but it's really going to depend on having enough people watch the show. And I never assume anything, because we're living in an era where Martin Scorsese doesn't get a second season. Anybody can get canceled.\n\nBut because you mentioned Sepinwall's review, in which he talks about how there's not enough story to fill 13 episodes, I do have to ask: What do you think about the season's length? Would you prefer fewer episodes?\n\nNo. Honestly, it's like jazz. In the bebop era, it used to be that you only had three minutes to make a song. But once you were able to not have three minutes and you could do 25 minutes, it changed the nature of jazz composition. It's like John Coltrane and Sonny Rollins — it changes jazz because you could stretch.\n\nNow, if he's saying every episode needs to be a pop single, he can have that Britney Spears s—. You know? Like, he wants Taylor Swift, Britney Spears. We're trying to make Zeppelin records. He's probably the kind of person who thinks that \"Stairway to Heaven\" is a waste of time, you know what I'm saying? Like, God forbid that song meanders, especially as it builds to its climax. He's the kind of person who probably wanted to edit \"Bohemian Rhapsody,\" you know? There will be some people who prefer that stretch and then some people who are like, \"You know what, I like pop.\" And I get it. It's cool. There's literally a million other things you could be doing, but if you like what we're doing, then I want to give the fans who like what we're doing as much as they can take.\n\nIs there anything else you want to add?\n\nI really love the season, and I hope people enjoy it. I know that we could not have tried any harder. I know that we pushed as many buttons as we could, and I'm satisfied that we tried our best. I learned a long time ago as a journalist who covered A Tribe Called Quest and Dr. Dre and a lot of artists that pushed boundaries, that they take creative risks because safe records don't move the needle. Sometimes you have to take the risk that somebody will consider what you're making is noise, but if you don't try it, then nothing will move forward. I'd rather people hate something than just go \"meh.\" I want people to be enthralled by the show and I hope in this second season, we did something enthralling.\n\nMarvel's Luke Cage season 2 is now streaming on Netflix.\n\nRELATED: Get the lowdown on the Emmys with EW's CHASING EMMY podcast <iframe src=\"https://art19.com/shows/508b6f3d-1a85-422c-8899-51c649fa2da5/episodes/37ba9495-b3d4-487a-a347-59eda2c7d55b/embed?theme=light-gray-orange\" scrolling=\"no\" width=\"100%\" height=\"460\" frameborder=\"0\" class=\"\" allowfullscreen=\"\" resize=\"0\" replace_attributes=\"1\" name=\"\"></iframe>ãF÷oNÝs×ÜsÖ÷ã}œiçžñçÚwVŸï\u009dž÷‡›", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F13%2Fbetter-call-saul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2Frhbh-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F09%2Flennykravitz.jpg%3Fw%3D768", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F115093_46282_b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F09%2FHomeland_810_4979_R.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F115093_48676b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F11%2Frolestout.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F17%2FNUP_189932_0195.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2FListen-to-Your-Heart.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F06%2Flukecage2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2018%2F10%2Fcelebrity-binge.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F116494_0767b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-voice-rec.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Frhony.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2067'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2064'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F06%2Flukecage2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F12%2Fsnl.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F06%2Flukecage1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2Fdee-rogan-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F03%2Fgreys-anatomy-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F06%2F0436_tiara_201_unit_02592r-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Fevan-rachel-wood-aaron-paul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-challenge-b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Foutlander-sea5.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F116400_1225b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F06%2F0253_tiara_201_unit_04868r-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2FRVD417d_0162b.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F06%2Flukecage2-2000.jpg", "keywords": [], "authors": ["Shirley Li", "Seija Rankin", "Jodi Walker", "Maureen Lee Lenker", "Andy Hoglund", "Dalton Ross", "Chancellor Agard", "Samantha Highfill", "Sydney Bucksbaum", "James Hibberd"], "canonical_link": "https://ew.com/tv/2018/06/22/marvels-luke-cage-boss-breaks-down-chilling-season-2-finale-defends-13-episode-seasons/", "title": "Marvel's Luke Cage boss breaks down 'chilling' season 2 finale, defends 13-episode seasons", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Cheo Hodari Coker,Marvel,Mike Colter", "news_keywords": "Cheo Hodari Coker,Marvel,Mike Colter", "description": "Showrunner Cheo Hodari Coker insists critics are wrong about the show needing fewer episodes.", "og": {"title": "'Marvel's Luke Cage' boss breaks down 'chilling' season 2 finale, defends 13-episode seasons", "type": "article", "site_name": "EW.com", "url": "https://ew.com/tv/2018/06/22/marvels-luke-cage-boss-breaks-down-chilling-season-2-finale-defends-13-episode-seasons/", "description": "Warning: The following contains spoilers for season 2 of&nbsp;Marvel's Luke Cage. Read at your own risk! By the end of his standalone series' second season,&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F06%2Flukecage2-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://ew.com/tv/2018/06/22/marvels-luke-cage-boss-breaks-down-chilling-season-2-finale-defends-13-episode-seasons/", "description": "Showrunner Cheo Hodari Coker insists critics are wrong about the show needing fewer episodes.", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F06%2Flukecage2-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/tv/2018/06/22/marvels-luke-cage-boss-breaks-down-chilling-season-2-finale-defends-13-episode-seasons/", "title": "'Marvel's Luke Cage' boss breaks down 'chilling' season 2 finale, defends 13-episode seasons", "description": "Showrunner Cheo Hodari Coker insists critics are wrong about the show needing fewer episodes.", "site": "@ew", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F06%2Flukecage2-2000.jpg"}, "fb": {"app_id": 2485718348341688, "pages": 52150999700}, "article": {"opinion": "false"}}, "movies": [], "publish_date": 1529596800.0, "source": "https://ew.com", "summary": ""}