{"url": "https://www.stuff.co.nz/entertainment/film/99885932/sir-peter-jackson-breaks-silence-on-harvey-weinstein", "text": "Sir Peter Jackson and Harvey Weinstein. Jackson says he made a conscious decision to never work with him again.\n\nTwo Hollywood actresses have thanked Sir Peter Jackson for speaking out about Harvey Weinstein and his brother, saying they orchestrated a smear campaign that led to him blacklisting them both.\n\nAshley Judd and Mira Sorvino were responding on Twitter to a Stuff story in which Jackson spoke of the blacklist as a result of the actions of accused sexual predator Weinstein and his brother Bob, describing the pair as \"second-rate Mafia bullies\".\n\nJudd and Sorvino have both publicly claimed Weinstein sexual harassed them, and they both missed out on roles in Jackson's Lord of the Rings films because of what the brothers had said about them.\n\nSUPPLIED Sir Peter Jackson says the Weinstein brothers behaved like \"second-rate Mafia bullies\".\n\nJudd recalled how she was shown \"everything\" about the films and was even asked which role she preferred – then never heard from Jackson or his wife Fran again.\n\nREAD MORE:\n\n* Sir Peter Jackson: Harvey Weinstein made me blacklist stars\n\n* Sir Peter Jackson remains silent on Harvey Weinstein\n\n​* Ashley Judd has accused Harvey Weinstein of sexual harassment as part of a bombshell NYT report\n\n* Full coverage: Harvey Weinstein\n\n* Harvey Weinstein: Why Kate Winslet didn't thank him in her 2009 Oscars speech\n\n* Powerful men preying on young women: It's happened to me, and most other women\n\n﻿﻿\"Peter & Fran had me in - showed me all the creative, the boards, costumes, everything. They asked which [of] the two roles I preferred, and then I abruptly never heard from [them] again. I appreciate the truth coming out. Thank you, Peter,\" Judd wrote.\n\nIn an earlier response to Stuff's story, Judd tweeted: \"I remember this well.\"\n\nSorvino also shared the story on Twitter. \"Just seeing this after I awoke, I burst out crying,\" Sorvino wrote, linking to the interview. \"There it is, confirmation that Harvey Weinstein derailed my career, something I suspected but was unsure. Thank you, Peter Jackson, for being honest. I'm just heartsick.\n\nPeter & Fran had me in - showed me all the creative, the boards, costumes, everything. They asked which if the two roles I preferred, and then I abruptly never heard from hem again. I appreciate the truth coming out. Thank you, Peter. https://t.co/iXKuK6Xqtx — ashley judd (@AshleyJudd) December 15, 2017\n\nThings go from bad to worse for Harvey Weinstein. After The Academy of Motion Picture Arts and Sciences expelled him earlier this month, following allegations that he sexually harassed or assaulted a number of women over the past three decades, he now faces civil action in Britain.\n\nSpeaking to Stuff for the first time since multiple sexual assault allegations emerged against Weinstein, Jackson said he had \"no direct experience or knowledge of the sexual allegations\" against the Hollywood powerbroker, but had earlier made a conscious decision to never work with him again.\n\nWeinstein and Jackson crossed paths in the late 1990s when Jackson was pitching his early plans for The Hobbit and Lord of the Rings films to the Weinstein-led studio Miramax.\n\n\"I recall Miramax telling us they were a nightmare to work with and we should avoid them at all costs. This was probably in 1998,\" Jackson said.\n\nREUTERS Actress Ashley Judd was picked to star in the Lord of the Rings films along with Mira Sorvino, but missed out on the role after the Weinstein brothers intervened.\n\n\"At the time, we had no reason to question what these guys were telling us - but in hindsight, I realise that this was very likely the Miramax smear campaign in full swing.\n\n\"I now suspect we were fed false information about both of these talented women - and as a direct result their names were removed from our casting list.\"\n\nJackson said Weinstein and his brother, Bob, were both particularly difficult to work with.\n\nJust seeing this after I awoke, I burst out crying. There it is, confirmation that Harvey Weinstein derailed my career, something I suspected but was unsure. Thank you Peter Jackson for being honest. I’m just heartsick https://t.co/ljK9NqICbm — Mira Sorvino (@MiraSorvino) December 15, 2017\n\n\"My experience, when Miramax controlled the Lord of the Rings [before New Line took over production of the film], was of Weinstein and his brother behaving like second-rate Mafia bullies. They weren't the type of guys I wanted to work with - so I haven't,\" he said.\n\n\"Although his name had to be on the Lord of the Rings credits for contractual reasons, he was not involved in the movies we ended up making.\"\n\nWeinstein threatened to sack Jackson from the LoTR adaptation if the director didn't follow Weinstein's demands to make the proposed two-part film into one.\n\nHe gave Jackson and his wife Fran Walsh four weeks to find a new studio that would take on the two-part movie.\n\nFinally, New Line took them on and suggested they make the two films into three to match the books.\n\n\"Movie making is much more fun when you work with nice people,\" Jackson said.\n\n\"I vaguely remember bumping into him [Weinstein] at some award show or premiere at the time of their release, but it's been 20 years since my last interaction of any substance with Harvey Weinstein.\"\n\nWhile Heavenly Creatures was a Miramax release, Jackson said the company's only involvement was with its distribution.", "images": ["https://resources.stuff.co.nz/content/dam/images/1/m/d/x/u/a/image.related.StuffLandscapeSixteenByNine.1420x800.1ngwh8.png/1513374583786.jpg", "https://secure-nz.imrworldwide.com/cgi-bin/m?ci=nz-stuff&cg=0&cc=1&ts=noscript"], "top_img": "https://resources.stuff.co.nz/content/dam/images/1/m/d/x/u/a/image.related.StuffLandscapeSixteenByNine.1420x800.1ngwh8.png/1513374583786.jpg", "keywords": [], "authors": ["Dani Mcdonald"], "canonical_link": "https://www.stuff.co.nz/entertainment/film/99885932/sir-peter-jackson-breaks-silence-on-harvey-weinstein", "title": "Ashley Judd, Mira Sorvino thank Peter Jackson for 'being honest' about Weinstein blacklist", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "noarchive", "format-detection": "telephone=no", "fb": {"app_id": 207633159308175, "pages": 21253884267}, "verify-v1": "RazNiYjuvNuEsMeFXxfR9l9cDZIKxcq2VjQZA25CHgM=", "msapplication-config": "/sics-assets/images/favicons/browserconfig.xml", "theme-color": "#ffffff", "description": "Actress says she was shown \"everything\" about the LoTR films. Then nothing but silence.", "source": "Stuff", "og": {"description": "Actress says she was shown \"everything\" about the LoTR films. Then nothing but silence.", "title": "Ashley Judd, Mira Sorvino thank Peter Jackson for 'being honest' about Weinstein blacklist", "url": "https://www.stuff.co.nz/entertainment/film/99885932/sir-peter-jackson-breaks-silence-on-harvey-weinstein", "type": "article", "image": "https://resources.stuff.co.nz/content/dam/images/1/m/d/x/u/a/image.related.StuffLandscapeSixteenByNine.1420x800.1ngwh8.png/1513374583786.jpg", "site_name": "Stuff"}}, "movies": [], "publish_date": null, "source": "https://www.stuff.co.nz", "summary": ""}