{"url": "https://www.cbsnews.com/news/grammys-live-blog-winners-performances-2018-01-28-live-updates/", "text": "Grammys night was huge for Bruno Mars, who won three out of the four major categories (the fourth is best new artist), for \"24K Magic\" and \"That's How I Like It.\" But Jay-Z, who was up for eight awards, was shut out.\n\nJames Corden hosted the 60th Grammy Awards from Madison Square Garden in New York -- the show's first return to New York in 15 years. The Grammys included a very emotional performances by Kesha and Logic, while Kendrick Lamar opened the show with a political set. The star-studded lineup of performers also included Bruno Mars, Cardi B, SZA, Luis Fonsi, Daddy Yankee, U2, Sam Smith and more.\n\nSee the list of winners here.\n\nHere's what took place during the show, as it happened (all times Eastern)\n\n11 p.m.: Bruno Mars wins album of the year\n\nU2 presented Bruno Mars with the award for album of the year. Mars said to the other album of the year nominees, \"You guys are the reason I'm in the studio pulling my hair out, because I know you will only come with top shelf artistry.\"\n\nHe continued and talked about being a 15-year-old performer.\n\n\"Those songs I was singing were written by either Babyface, Jimmy Jam and Terry Lewis or Teddy Riley,\" he said as he explained that those were the artists who got people around the world dancing. \"They are my heroes. They are my teachers and the foundation.\" Mars said he hopes to get everyone in the world dancing.\n\nThat left Jay-Z, the most nominated artist of the night, with eight nods, without a single win.\n\n10:42 p.m.: Recording Academy president Neil Portnow speaks\n\nRecording Academy president Neil Portnow took the stage to talk about the Grammys' 60-year-old legacy, including its education programs. He also talked the Recording Academy's philanthropic organization, MusiCares, which has raised $58 million since its founding in 1989 to help music people with substance abuse, disaster relief and more. He then introduced the Grammys' in memoriam segment, which began with a tribute to Tom Petty by Chris Stapleton and Emmylou Harris. The two played their guitars as they sang Petty's \"Wildflowers.\" A slideshow remembered music stars like Dolores O'Riordan, Chuck Berry, David Cassidy, Fats Domino, Chris Cornell and Chester Bennington.\n\nFittingly, the show transitioned to a performance by Logic, Alessia Cara and Khalid of suicide awareness song \"1-800-273-8255.\" (Cornell and Bennington both died by suicide.) The artists were joined by several people wearing t-shirts that said \"You are not alone\" and \"1-800-273-8255.\" Logic got cut off for a moment as he talked about accepting immigrants and the power of unity, saying, \"Together we can build a not just a better country, but a world that is destined to be united.\"\n\n10:32 p.m.: Bruno Mars wins record of the year\n\nAlicia Keys, who was bare-faced as usual, took the stage to praise her hometown and said, \"I think the Grammys are better in New York.\" She presented the award for record of the year, which went to Bruno Mars for \"24K Magic.\"\n\n\"Look at me pop -- I'm at the Grammys now!\" said Mars in his acceptance speech as he thanked his collaborators and loved ones.\n\nBruno Mars on performing in front of famous musicians\n\n10:28 p.m.: SZA performs\n\nShemar Moore and Eve took the stage to introduce SZA. The singer performed her hit \"Broken Clocks\" with a choir of backup singers behind her. SZA sang against screens showing trees, Japanese characters and geometric patterns. The performance closed with a shower of sparks. The newcomer was up for five Grammy Awards; she talked to CBS News recently about her surreal week leading up to the Grammys.\n\n10:10 p.m.: Patti LuPone honors Andrew Lloyd Webber, ending feud\n\nCorden introduced everyone to his parents, who were in the audience. He asked his parents what their favorite part of the show was and first his mother said, \"It's all been good.\"\n\nThen his father said, \"The beginning was good, the middle was good … it's all been great.\"\n\n\"Wait a minute … did you go and see 'Hamilton?'\" asked Corden as he found a Playbill in his father's hand. His parents admitted that they figured they could pop out and see \"Hamilton\" and still make it for \"the last three hours\" of the show.\n\nBen Platt from \"Dear Evan Hansen\" paid tribute to late composer Leonard Bernstein, and sang Bernstein's \"Somewhere\" from \"West Side Story.\" Patti Lupone then honored to composer Andrew Lloyd Webber, ending a decades-long feud between the Broadway legends that began when Webber fired LuPone from his Broadway production of \"Sunset Boulevard.\" LuPone stood on a podium in a glamorous, glittering gold gown as she sang. The singer ended the performance with her arms in the air, and then wiped tears from her face.\n\n10 p.m.: Elton John and Miley Cyrus perform \"Tiny Dancer\"\n\nAnna Kendrick introduced a performance by Sir Elton John. He opened with \"Tiny Dancer\" before Miley Cyrus joined him to sing the song. John wore a signature tux adorned with rhinestones, and Cyrus looked demure in a maroon gown.\n\n9:54 p.m.: Hillary Clinton auditions to narrate \"Fire and Fury\"\n\nSting presented song of the year, which went to Bruno Mars for \"That's What I Like.\" Mars brought his colleagues on stage to thank them.\n\nCorden returned to the stage to say that he knows Mr. Trump loves winning awards and pointed out the possibility that next year, someone will win a Grammy for an audiobook about him. Corden showed a skit with different stars auditioning to narrate \"Fire and Fury,\" including John Legend, Cher, Snoop Dogg, Cardi B and DJ Khaled.\n\nGrammys 2018: Hillary Clinton surprises crowd to read \"Fire and Fury\"\n\n\"Why am I even reading this s***? I can't believe this. I can't believe that he really -- this is how he lives his life?\" asked Cardi B. Finally, Hillary Clinton appeared to audition. The crowd roared as Corden said, \"That's it -- that's the one,\" pointing at Clinton after she read a passage.\n\n9:42 p.m.: Camila Cabello makes plea for dreamers\n\nCamila Cabello introduced U2's next performance, but not before making a plea for young immigrants. Cabello talked about her own experience.\n\n\"We remember that this country was built by dreams, for dreams, chasing the American dream,\" she said. \"My parents brought me to this country with nothing in their pockets but hope. They showed me what it means to work twice as hard, and never give up.\"\n\nCabello continued, \"I'm a proud Cuban-Mexican immigrant born in eastern Havana, standing in front of you on the Grammys stage in New York City and all I know is just like dreams, these kids can't be forgotten and are worth fighting for.\"\n\nShe then introduced U2's performance of \"Get Out of Your Own Way.\" U2 performed the song outdoors, from in front of the Statue of Liberty, against a backdrop of images of eyes of different races and backgrounds.\n\n9:33 p.m.: Time's Up at the Grammys\n\nJanelle Monae wore a Time's Up pin as she spoke on stage and said she spoke as \"a young woman with my fellow sisters in this room who make up the music industry.\n\nShe addressed the audience and said, \"We come in peace, but we mean business … And to those who dare try to silence up, we offer you two words: Time's Up. We say Time's Up for pay inequality, discrimination or harassment of any kind, and Time's Up for the abuse of power.\"\n\nShe continued, \"We have the power to undo the culture that does not serve us well. So let's work together, women and men, as a united music industry, committed to creating more safe work environments, equal pay and access for all women.\"\n\nMonae then introduced a performance of \"Praying\" by Kesha, Cyndi Lauper, Camila Cabello, Andra Day, Julia Michaels and Bebe Rexha. \"Praying\" was Kesha's first song in four years and seemed to be a response to her conflict with producer Dr. Luke, whose real name is Lukasz Gottwald. The pop star sued Gottwald in October 2014 and asked a judge to release her from her contract, alleging that the producer threatened and sexually and emotionally abused her. Since then, the two were locked in court battles in both New York and Los Angeles, with Kesha losing or dropping most of the suits. \"Praying\" and Kesha's album \"Rainbow\" are seen as the singer's big comeback.\n\nKesha, Lauper, Cabella, Day, Michaels and Rexha were joined by more women who stood with them as the night's #MeToo moment. When Kesha closed the performance, she was in tears, hugging the other women. The camera showed Hailee Steinfeld wiping away tears in the audience.\n\n9:20 p.m.: Eric Church, Maren Morris and Brothers Osborne honor victims of concert violence\n\nDonnie Wahlberg and Hailee Steinfeld presented the award for best country album. They put on cowboy hats before announcing the winner, Chris Stapleton, for \"From a Room: Vol. 1.\" Stapleton, a relative newcomer, had already won two Grammy Awards earlier in the night.\n\nThe show took a more somber tone as Eric Church, Maren Morris and Brothers Osborne took the stage to perform a tribute to honor the victims of concert violence this past year. The artists all performed at last year's Route 91 Harvest Festival, where at least 58 people were killed when a gunman opened fire on the crowd on Oct. 1, causing the deadliest mass shooting in recent U.S. history.\n\nChurch, Morris and Brothers Osborne performed a cover of Eric Clapton's \"Tears in Heaven\" as the names of victims appeared behind them on set.\n\n8:56 p.m.: Dave Chappelle wins best comedy album\n\nTrevor Noah said he loved Bruno Mars and Cardi B's performance because it reminded him of a time when President Donald Trump was not in office. He announced the winner for best comedy album, which, as Jim Gaffigan predicted earlier in the night, went to Dave Chappelle. Chappelle thanked his colleagues and family before joking, \"See you on Monday.\"\n\nCorden returned to say nobody will go home empty-handed from the Grammy Awards and claimed that anybody who does not win will take a puppy home as Jerry Seinfeld and Sarah Silverman were handed tiny puppies. Corden warned Seinfeld that his puppy was a biter.\n\nCorden then introduced a performance by Sting, who appropriately sang \"Englishman in New York\" against a snowy backdrop. Shaggy joined Sting to perform their song \"Don't Make Me Wait.\" As Sting returned to \"Englishman in New York,\" Shaggy sang out, \"I'm a Jamaican in New York.\"\n\n8:47 p.m.: Corden takes the subway with Shaggy and Sting\n\nCorden introduced a skit he created with Shaggy and Sting. The three took the subway around New York City in honor of the Grammys' return to the East Coast. The three tried to busk, while unamused straphangers told them to \"shut up, sit down.\"\n\n\"Whose stupid idea was this?\" asked Sting.\n\n\"Wasn't me,\" responded Shaggy.\n\nKatie Holmes took the stage to introduce Cardi B and Bruno Mars to perform their remix of \"Finesse.\"\n\nAs in their music video, Cardi B and Bruuno Mars referenced \"In Living Color\" with a 1990s-inspired set and throwback clothes. Mars wore a hoodie with track pants and high-top sneakers and busted out some serious '90s-inspired moves while Cardi B wore a color-blocked outfit with a denim bucket hat and gold chains.\n\n8:36 p.m.: Kendrick Lamar wants Jay-Z to run for president\n\nCorden announced that Bronx teacher Melissa Salguero won the award for music educator of the year before Chappelle returned to the stage. The comedian called it \"an honor\" to present best rap album because the genre was so meaningful to him. He gave a shout out to A Tribe Called Quest -- clearly calling out the Recording Academy for snubbing the rap group -- and other classic rappers before announcing that Kendrick Lamar won the award for \"DAMN.\"\n\nLamar thanked rappers who inspired him, including Jay-Z, Nas and Puff Daddy.\n\n\"These guys show me the game from close and from afar,\" he said, before closing off with, \"Jay for President.\"\n\nPink took the stage in a frayed t-shirt and jeans to sing a pared down version of \"Wild Hearts Can't Be Broken,\" a far cry from her typically flashy, gravity-defying performances.\n\n8:19 p.m.: Victor Cruz and Sarah Silverman introduce \"Despacito\"\n\nVictor Cruz and Sarah Silverman introduced Daddy Yankee and Luis Fonsi to the stage, with Cruz saying that his own Puerto Rican heritage makes him feel especially connected to the singers. Daddy Yankee and Fonsi performed their smash hit, \"Despacito,\" against a set filled with neon lights, pyrotechnics and dozens of dancers. Recently, Luis Fonsi told CBS News of the record-breaking song, \"I had no idea it would become a worldwide phenomenon.\"\n\nCorden joked, \"That is a catchy song. I have not heard that song before.\" The host introduced a performance by Donald Glover, also known as Childish Gambino, who sang \"Terrified.\" Glover wore white from head to toe as he sang.\n\n8:11 p.m.: Jon Batiste and Gary Clark Jr. perform a tribute\n\nJon Batiste and Gary Clark Jr. performed a tribute to late singer Chuck Berry with \"Wonderful Woman\" and \"Maybelline\" before announcing pop solo performance. Ed Sheeran won the award for \"Shape of You,\" but the singer was not at the show to accept the honor.\n\n7:51 p.m.: James Corden calls Jay-Z \"one of the all-time greats\"\n\n\n\nJames Corden announced that on Saturday, Jay-Z was honored as an industry icon at Clive Davis' Pre-Grammy Gala and called him \"one of the all-time greats.\" He joked that he could show Jay-Z around New York City and said, \"You call it the Big Apple, I call it the concrete jungle where dreams are made of.\"\n\nSam Smith performed a soulful rendition of \"Pray.\"\n\nNick Jonas and Kelly Clarkson presented best new artist, which went to Alessia Cara. She said that she had been practicing winning Grammys in her shower ever since she was a kid. She said, \"I just want to say there are some incredible artists making incredible music that need to be acknowledged,\" and said, \"Everyone deserves the same shot.\"\n\nJim Gaffigan took the stage and said, \"Yeah, I haven't heard of me either,\" before saying that though it was his third time getting nominated for a Grammy for best comedy album, he was excited to see Dave Chappelle win, joking that he thought it was strange that Chappelle asked him to write his acceptance speech.\n\nGaffigan did point out that he had a strong connection to music, claiming that his father was in ABBA and his mother is Elton John. Gaffigan introduced a performance by Little Big Town, who sang \"Better Man.\" The band talked to ET earlier in the night about how their songwriter, Taylor Swift, sent them flowers ahead of the Grammys to congratulate them on their nomination.\n\n7:42 p.m.: Kendrick Lamar wins first award of the night\n\nJohn Legend and Tony Bennett sang a few lines from \"New York, New York\" together before presenting the first award of the night: best rap/sung performance. Kendrick Lamar won for \"Loyalty\" feat. Rihanna. Lamar and Rihanna took the stage and Lamar said, \"She gassed me on this song … This really belongs to her,\" before urging Rihanna to speak. Rihanna thanked her colleagues and Lamar.\n\n7:38 p.m.: Lady Gaga performs\n\nHost James Corden introduced the show, joking that though it was the most diverse lineup of Grammy nominees, the show picked the least diverse host. He announced a performance by Lady Gaga, who sang and played a white grand piano adorned with giant angel wings.\n\nThe singer said, \"This is for my father's late sister, Joanne. This is for love and compassion, even when you can't understand,\" before launching into \"Joanne.\" Gaga looked tame and elegant compared to flashy looks from past awards show, wearing a glamorous pink gown. Mark Ronson sat on a stool across from Gaga, playing the guitar. Gaga transitioned into \"Million Reasons\" and closed her performance standing in front of the piano.\n\n7:30 p.m.: Kendrick Lamar opens the show\n\nKendrick Lamar opened the Grammys against a backdrop of an American flag and dancers dressed in military uniform with their faces covered, rapping \"XXX\" lyrics to the beat of \"LUST.\" \"LUST.\" contains lyrics slamming President Donald Trump, with a line that goes, \"We all woke up, tryna tune to the daily news, lookin' for confirmation, hopin' election wasn't true.\" Though the performance was clearly political, Lamar skipped anti-Trump lyrics. Then the set changed so that a screen behind Lamar said, \"This is a satire,\" just as U2's Bono and the Edge emerged to join Lamar on stage as Lamar transitioned into \"DNA.\"\n\nDave Chappelle appeared onstage and said, \"Hi. I'm Dave Chapelle. And I just wanted to remind the audience that the only thing more frightening than watching a black man be honest in America is being an honest black man in America. Sorry for the interruption. Please continue,\" before throwing it back to Lamar.\n\nLamar returned and rapped \"King's Dead\" with sounds of gunshots in the background as Chappelle looked confused and asked if this was really being broadcast.\n\nLamar returned and his dancers wore red hoodies. Lamar finished his performance as each dancer fell to the floor in sync with gunshots.\n\n7:20 p.m.: Stars wear white roses to show solidarity with Time's Up movement\n\nLady Gaga and other celebrities wore white roses on the red carpet at the Grammys to show solidarity with the #MeToo and Time's Up movements against sexual misconduct. Ahead of the Grammys, Rita Ora talked to CBS News and said, \"I'm wearing the white rose this week, which represents solidarity with everything that's going on and there's a lot of people also wearing it, so I'm excited to show my support.\"", "images": ["https://cbsnews3.cbsistatic.com/hub/i/r/2018/01/29/9a6909fe-7900-4775-998b-f069a0206b41/thumbnail/620x349/aaea80dff39d8126d82a283b18417362/gettyimages-911505486.jpg", "https://cbsnews1.cbsistatic.com/hub/i/r/2015/10/14/1fc2913c-cb2d-49df-9a3c-de8c4c9fbc5a/thumbnail/80x80/4bf42ed2ccbfe1233a052870c6b4f366/cbsnews140andrea140x100.jpg", "https://cbsnews2.cbsistatic.com/hub/i/r/2018/01/29/37547e0b-50aa-43aa-9fb5-bdc9e8ea9e96/thumbnail/1200x630g2/a656b198fec8a62f84cd237ae9a18e84/gettyimages-911544978.jpg", "https://cbsnews1.cbsistatic.com/hub/i/r/2019/11/19/186936ea-2db7-4a48-b750-74f38f653dc6/thumbnail/640x360/80fb8996993802606d5c971761bf5b42/newsletter-breakingnews.jpg", "https://cbsnews1.cbsistatic.com/hub/i/r/2018/12/27/a434e2ee-384e-4a17-a235-3956337bf2a6/thumbnail/620x349/62b35dcf2acf995ecc04e2f91d3e6cea/sister-wendy-beckett-ap-18360653071782.jpg"], "top_img": "https://cbsnews2.cbsistatic.com/hub/i/r/2018/01/29/37547e0b-50aa-43aa-9fb5-bdc9e8ea9e96/thumbnail/1200x630g2/a656b198fec8a62f84cd237ae9a18e84/gettyimages-911544978.jpg", "keywords": [], "authors": ["Andrea Park", "Andrea Is An Entertainment Producer At Cbsnews.Com"], "canonical_link": "https://www.cbsnews.com/news/grammys-live-blog-winners-performances-2018-01-28-live-updates/", "title": "Grammy Awards 2018: Bruno Mars sweeps, Jay-Z snubbed", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1, user-scalable=0", "robots": "index, follow", "description": "Music&#039;s biggest night awarded the very best in the music industry as James Corden hosted the show from New York City on Sunday", "keywords": "grammys, james corden, grammy awards, grammys 2018", "news_keywords": "grammys, james corden, grammy awards, grammys 2018", "al": {"web": {"url": "https://www.cbsnews.com/news/grammys-live-blog-winners-performances-2018-01-28-live-updates/"}, "ios": {"app_name": "CBS News", "app_store_id": 334256223, "url": "cbsnewsapp://cbsnews.com/news/grammys-live-blog-winners-performances-2018-01-28-live-updates/"}, "android": {"app_name": "CBS News", "package": "com.treemolabs.apps.cbsnews"}}, "og": {"type": "article", "url": "https://www.cbsnews.com/news/grammys-live-blog-winners-performances-2018-01-28-live-updates/", "title": "Grammy Awards 2018: Bruno Mars sweeps, Jay-Z snubbed", "description": "Music's biggest night awarded the very best in the music industry as James Corden hosted the show from New York City on Sunday", "image": {"identifier": "https://cbsnews2.cbsistatic.com/hub/i/r/2018/01/29/37547e0b-50aa-43aa-9fb5-bdc9e8ea9e96/thumbnail/1200x630g2/a656b198fec8a62f84cd237ae9a18e84/gettyimages-911544978.jpg", "width": 1200, "height": 630}, "video": {"url": "https://public.vilynx.com/direct/8fc31712de713e0c34c55c4bce033614/ea7a9ebc-1eec-4d5a-8bba-89fa3e47c12b/pro69.viwindow.mp4", "secure_url": "https://public.vilynx.com/direct/8fc31712de713e0c34c55c4bce033614/ea7a9ebc-1eec-4d5a-8bba-89fa3e47c12b/pro69.viwindow.mp4", "type": "video/mp4", "width": 1920, "height": 1080}}, "fb": {"app_id": 1536620209892267, "pages": 131459315949}, "article": {"publisher": "https://www.facebook.com/CBSNewsEntertainment", "content_tier": "free", "opinion": "false"}, "twitter": {"dnt": "on", "app": {"country": "US", "name": {"iphone": "CBS News", "ipad": "CBS News", "googleplay": "CBS News"}, "id": {"iphone": 334256223, "ipad": 334256223, "googleplay": "com.treemolabs.apps.cbsnews"}, "url": {"iphone": "cbsnewsapp://cbsnews.com/news/grammys-live-blog-winners-performances-2018-01-28-live-updates/", "ipad": "cbsnewsapp://cbsnews.com/news/grammys-live-blog-winners-performances-2018-01-28-live-updates/", "googleplay": "cbsnewsapp://cbsnews.com/news/grammys-live-blog-winners-performances-2018-01-28-live-updates/"}}, "site": "@CBSNewsEnt", "title": "Grammy Awards 2018: Bruno Mars sweeps, Jay-Z snubbed", "description": "Music's biggest night awarded the very best in the music industry as James Corden hosted the show from New York City on Sunday", "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2018/01/29/37547e0b-50aa-43aa-9fb5-bdc9e8ea9e96/thumbnail/1200x630g2/a656b198fec8a62f84cd237ae9a18e84/gettyimages-911544978.jpg", "creator": "@https://twitter.com/andreapark", "card": "summary_large_image"}, "theme-color": "#101010", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "CBS News", "apple-mobile-web-app-status-bar-style": "black"}, "movies": [], "publish_date": 1517068800.0, "source": "https://www.cbsnews.com", "summary": ""}