{"url": "https://www.vulture.com/2018/05/the-americans-series-finale-saddest-endings.html", "text": "Photo: Copyright 2018, FX Networks. All rights reserved.\n\nSpoilers below for The Americans series finale.\n\nIn retrospect, The Americans couldn’t have ended any other way. By the time the closing credits rolled on the series finale, “START,” each character has suffered a major and particular tragedy: Philip and Elizabeth Jennings abandon their son Henry and lose their daughter Paige, Oleg Burov is locked up in prison as a spy, and Stan Beeman must forever reckon with his decision to let the Jennings escape. (If you’re feeling especially down about this grim farewell, just look on the bright side: At least nobody died!) After giving ourselves a moment to decompress from such an intense series finale, the Vulture staff got together to debate a pressing question: Which character on The Americans suffered the worst ending of all?\n\nOleg Burov\n\nAfter leaving the KGB and starting a family, Oleg got sucked back to America and into Philip and Elizabeth’s lives. He wanted to help his country reform; he ended up getting arrested by the Americans. He didn’t pass along Philip’s warning about the Center’s plot against Gorbachev, and now he faces a lifetime in jail because the KGB won’t trade him out. Sure, it might be something of achievement that Oleg is still alive — even actor Costa Ronin is surprised about that — but it’s all the more disheartening to think that his life got worse the more he tried to be better. Oleg risked his happy life for the sake of principle, and that severed him from his family forever. As if that’s not tragic enough, his loved ones are surely targets of the KGB because of his actions. Now he’s a man without a country, all because he decided to stand up for something. That’s one of the most grim things that can happen to a character, and an reminder of how cruel The Americans believes the universe can be. —Jackson McHenry\n\nHenry Jennings\n\nImagine if the last thing you ever said to your parents was, “I’ve really gotta split, we’re in the middle of a ping-pong tournament.” That’s the story of Henry Jennings, whose world comes crumbling down when Uncle Stan interrupts hockey practice to reveal that everything he thought he knew about his family and his life is a lie. Even worse, his parents have abandoned him. Of course, we know Philip and Elizabeth did it for his benefit — but Henry doesn’t, not really. Unlike Paige, he was never even given a choice. Sure, he seems poised for nominal success, what with his exclusive New Hampshire boarding school (if Stan agrees to pay his tuition, that is) and an elite social network full of future MBAs. But all the business degrees in the world won’t be able to fill the hole inside his heart. I hope he won that ping-pong tournament. —Ray Rahman\n\nPaige Jennings\n\nFor my money, Paige is the one who has it the worst. She signed onto her parents’ Soviet ideology because she wanted to make the world a better place, but until this finale, she never fully understood the emotional costs of their job. She sees the consequences of her father’s lies come crashing down in the parking garage with Stan. She watches her parents make the choice to abandon her brother. She listens to her parents say good-bye to her brother without actually saying good-bye. And then she makes the incredibly brave choice to leave them.\n\nAfter the end of the series, Henry will feel terribly betrayed, but he’ll be exonerated of any involvement and he’ll have Stan. Elizabeth and Philip will have lost their family, but they’ll still have each other (and the knowledge that stopped the people trying to take down Gorbachev). Stan will quietly suffer the worst failure of his career, but at least he’ll get to take care of Henry. But Paige? She has nothing left. She can’t reconnect with Henry. She’s doomed to live in fear that the FBI will come after her. She was groomed to spy for a nation that’s about to collapse. Does she have any money? Where is her real passport? Her driver’s license? How will she get a job? Paige will be stuck forever in that sad, abandoned apartment, drinking vodka alone. —Kathryn VanArendonk\n\nStan Beeman\n\n“You were my best friend.” One of the images that will stay with me from The Americans finale is Noah Emmerich’s crestfallen look when everything Stan suspected is actually proven true in that parking garage. (If only he had followed his gut back in the pilot!) The Americans was masterful at mixing dread, regret, and confusion, and Stan totally embodied those feelings in that moment. Like every relationship on the show, his friendship with Philip was built on truth and untruth: In some ways, Philip could be more himself with Stan even as he lied to him every day, which is what makes Philip’s reply — “You were mine, too” — that much more devastating. And then, for the final twist of the knife, Philip airs his suspicions that he thinks Renee, the woman Stan has fallen in love with, might also be a Soviet spy. Poor, poor Stan. —E. Alex Jung\n\nElizabeth Jennings\n\nThe part in the finale where my sobs turned into wails was when Paige dumped her parents on the train tracks, followed by the slow, sinking realization that Philip and Elizabeth will likely never see their kids again. It’s a sad situation for both the parents and children, but ultimately, it’s more heartbreaking to watch a parent lose a child than vice versa. Of the two parents, Elizabeth strikes me as the more tragic figure, partly because she’s been the most tragic figure all season long. Philip has spent years working on himself, and now that he’s escaped, he can take off his mask once and for all (and perhaps, finally, fully self-actualize). Elizabeth, meanwhile, lost not only her children, but a huge part of her identity as a spy, all in rapid succession. She’s going through an enormous amount of trauma, and the worst part is she has to figure out who she is now. —Gazelle Emami\n\nPhilip Jennings\n\nI spent the majority of this season mourning the life Philip could have had — a life as a hardworking, unassuming D.C.-area hockey dad/travel agent/line-dance club regular — and how it was cut short when he got roped back into the family spy business. (Seriously, name the happiest you have ever seen Philip Jennings in the entirety of this series. It was line-dancing, wasn’t it?) That’s why, in my mind, there’s no conclusion more devastating than that of Philip, who abruptly loses both of his kids, his best friend, and ends up exiled in a country he only vaguely recognizes anymore, all because he served a cause he barely believed in in the first place. —Ashley Fetters\n\nEverybody\n\nEverybody gets a sad ending, because this is The Americans. Elizabeth and Philip must go home to a country that hasn’t been a part of their lives for decades, and live there without their children, the only pure thing in their dire, violent, ideologically driven existence. Paige and Henry have to start over as, essentially, orphans, abandoned by their mother and father, supposedly for their own good. Stan ends the story positioned as a surrogate father to an abandoned teenage boy, which might sound like a note of redemption if he didn’t also have to live with the guilt from betraying his sworn duty as an FBI agent, and the gnawing worry that his wife is a spy, too. Even the Soviet Union and the United States face their own sad endings: The USSR will break up within four years and reconstitute itself as a kleptocracy, while the triumphalist U.S. will declare “the end of history” before devolving into quasi-fascist squabbling brought on, some say, by Russian meddling in the 2016 elections. The only thing that keeps this finale from being one of the most depressing in television history is the sheer appropriateness of everything that happens in it. —Matt Zoller Seitz\n\nThe Americans: In Memoriam", "images": ["https://pixel.nymag.com/imgs/daily/vulture/2018/05/30/americans/30-the-americans-1.w700.h700.jpg", "https://pyxis.nymag.com/v1/imgs/897/187/b3556d666b6ab594b8a6d64383df224f8c-30-the-americans-1.1x.rsocial.w1200.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg"], "top_img": "https://pyxis.nymag.com/v1/imgs/897/187/b3556d666b6ab594b8a6d64383df224f8c-30-the-americans-1.1x.rsocial.w1200.jpg", "keywords": [], "authors": ["Vulture Editors"], "canonical_link": "https://www.vulture.com/2018/05/the-americans-series-finale-saddest-endings.html", "title": "‘The Americans Series’ Finale: Who Has the Saddest Ending?", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Who Has the Saddest Ending on The Americans?", "url": "https://www.vulture.com/2018/05/the-americans-series-finale-saddest-endings.html", "description": "Every major character suffers a tragedy in the series finale. But whose ending is the grimmest?", "image": "https://pyxis.nymag.com/v1/imgs/897/187/b3556d666b6ab594b8a6d64383df224f8c-30-the-americans-1.1x.rsocial.w1200.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "Who Has the Saddest Ending on The Americans?", "description": "Every major character suffers a tragedy in the series finale. But whose ending is the grimmest?", "image": "https://pyxis.nymag.com/v1/imgs/897/187/b3556d666b6ab594b8a6d64383df224f8c-30-the-americans-1.2x.rsocial.w600.jpg", "card": "summary_large_image", "site": "@vulture"}, "article": {"published_time": "2018-05-30T23:32:01.612-04:00", "tag": "vulture lists, the americans, the americans season 6, series finales, finales, tv", "publisher": "https://www.facebook.com/Vulture"}, "description": "In the series finale of ‘The Americans’, every character suffers a major tragedy. But whose ending is the absolute saddest?", "sailthru.tags": "vulture lists, the americans, the americans season 6, series finales, finales, tv", "author": "Vulture Editors", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://cache.nymag.com/media/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1527737521.612, "source": "https://www.vulture.com", "summary": ""}