{"url": "https://www.countryliving.com/life/entertainment/a18727772/sterling-k-brown-ryan-michelle-bathe-love-story/", "text": "Sterling K. Brown and his wife, Ryan Michelle Bathe, first met at Stanford University.\n\nBoth of them are actors, and have even worked on This Is Us together.\n\nThe couple dated, but broke up for three-and-a-half years before reconnecting.\n\nThey were married in 2007, after being \"together solid since April 2004.\"\n\nBrown and Bathe have two sons together.\n\nThese days, Sterling K. Brown and Ryan Michelle Bathe are one of the cutest couples on every red carpet. During his acceptance speeches, Brown, who stars on NBC's hit drama This Is Us, has the sweetest things to say about Bathe. His wife is an actor herself, and has appeared in shows like Army Wives and Boston Legal. Though their marriage seems solid now, their relationship has had twists and turns that rival the drama played out on their respective TV shows. Here's exactly how the pair got together.\n\nHow Did Sterling K. Brown Meet His Wife?\n\nBathe and Brown first met while studying at Stanford University in 1998, where they lived in the same dorm and starred in plays together. Bathe recalled in an interview with People that she was wowed by his talent even then. \"I saw Sterling audition for Joe Turner's Come And Gone. We were both freshmen in college,\" she told the publication. \"I snuck in and I saw his audition, and I thought to myself, 'If this man can do this at 17 years old, my God. What could he do when he becomes a grown man?'\"\n\nGetty Images\n\nThey were friends first and bonded over their shared history. \"We found out that we were both from St. Louis. We didn't know that we were both from St. Louis, like, our parents went to rival high schools. We were born in the same hospital. Like, we were friends,\" Brown told Entertainment Tonight. \"She was dating somebody. Of course she was, she's gorgeous. So we were just buddies.\" The relationship turned romantic, and they ended up dating on and off through college.\n\nWhy Did Sterling K. Brown and Ryan Michelle Bathe Break Up?\n\nBut it wasn't all romance from there. Bathe and Brown broke up for three and a half years before reconnecting. Brown said on The Talk that he had to work up a sweat to win her back. \"She was on a treadmill working out, and I had this epiphany. 'I have to go tell this woman she's the love of my life.' ... and she's like 'Well, I'm working out right now... I'm going to go on a run,'\" he told the hosts. \"She starts running through Koreatown, and I start running along with her. Brother had to work. But it was work well worthwhile.\"\n\nWhat Is Sterling K. Brown and Ryan Michelle Bathe's Marriage Like?\n\nThey were married in 2007, but their path to marriage was so dramatic, Brown thinks it would make a great movie. \"We need to actually put pen to paper and get it produced because people wouldn't believe it,\" he told ET. \"The multitude of ups and downs that we went through before we finally got together and figured it out. [We] have been together solid since April 2004, [but] all the stuff that happened before that, it's a good movie.\"\n\nThe two have even acted together before. They both had roles on Army Wives, and Bathe was cast in a recurring role on This Is Us, too; she plays Yvette, the mother who confronts Rebecca about young Randall's hair and eventually befriends Jack and Rebecca. \"I love actors so much, I decided to marry one,\" Brown said during his acceptance speech at the 2018 SAG Awards. \"You're the best scene partner a brother's ever had.\"\n\nThat said, though, they know one thing they can't do together, and that's rehearse. \"We've learned that there are certain minefields and pitfalls in our relationship, like a slalom, we just move right past them,\" Bathe told E! News. \"Rehearsing together is one of those things.\"\n\nDo Sterling K. Brown and Ryan Michelle Bathe Have Kids?\n\nThey have two sons together, Andrew, 6, and Amaré, 2. And Brown ended up having to help Bathe give birth to their oldest child, in a scene similar to the one Brown was in on This Is Us. \"My wife delivers quickly,\" Brown said on Live With Kelly and Ryan. \"She comes crawling out of the bathroom after a while and she says, 'I think I'm crowning.' And I'm...like, 'Sweetheart, you can't be crowning. It's your first baby. Just try to relax.' I'm mansplaining what's happening to her.'\"\n\nAt the 2017 Emmys, Brown's acceptance speech got cut off before he could thank his wife and children. But backstage, he gave the tribute anyone would love to hear from their spouse. \"They cut me off before I got to thank my wife, man! Ryan Michelle Bathe, you're everything,\" he said. \"You make my life worth living, and you gave me two of the most beautiful things that God has ever put on this planet: My sons. Andrew Jason Sterling Brown, Amaré Michael Ryan Christian Brown, your daddy loves you with the strength of a thousand suns. I'll see you Monday after work. Love you.\"", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-goldsmith-and-mandy-moore-attend-communities-in-news-photo-953629796-1536870606.jpg?crop=1.00xw:0.337xh;0,0.120xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/nup-180092-2632-jpg-1519309658.jpg?crop=1xw:0.7496251874062968xh;center,top&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/actors-sterling-k-brown-and-ryan-bathe-arrive-for-the-75th-news-photo-902323994-1536867160.jpg?crop=1.00xw:0.754xh;0,0.0627xh&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/actors-sterling-k-brown-and-ryan-bathe-arrive-for-the-75th-news-photo-902323994-1536867160.jpg?crop=1.00xw:0.754xh;0,0.0627xh&resize=1200:*", "keywords": [], "authors": ["Megan Friedman"], "canonical_link": "https://www.countryliving.com/life/entertainment/a18727772/sterling-k-brown-ryan-michelle-bathe-love-story/", "title": "Ryan Michelle Bathe and Sterling K. Brown's Love Story", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Country Living", "title": "Sterling K. Brown and His Wife's Love Story Has More Ups and Downs Than 'This Is Us'", "description": "The way they finally got together is fit for a television show. 😍😭", "url": "https://www.countryliving.com/life/entertainment/a18727772/sterling-k-brown-ryan-michelle-bathe-love-story/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/actors-sterling-k-brown-and-ryan-bathe-arrive-for-the-75th-news-photo-902323994-1536867160.jpg?crop=1.00xw:0.754xh;0,0.0627xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 165119423553230, "pages": 12013348247}, "article": {"publisher": "https://www.facebook.com/CountryLiving", "modified_time": "2018-09-13 10:13:51", "published_time": "2018-09-13 10:11:00", "section": "Entertainment", "opinion": "false"}, "twitter": {"site": "@CountryLiving", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/actors-sterling-k-brown-and-ryan-bathe-arrive-for-the-75th-news-photo-902323994-1536867160.jpg?crop=1.00xw:0.754xh;0,0.0627xh&resize=640:*"}, "google-site-verification": "y2umrM2fg1eXvnoHVUyHzeVTDYfhwLzq_rWVXkg0Yhw", "title": "Sterling K. Brown's Wife - Ryan Michelle Bathe and Sterling K. Brown's Love Story", "description": "​These days, Sterling K. Brown and Ryan Michelle Bathe are one of the cutest couples on every red carpet.", "keywords": "sterling k. brown, ryan michelle bathe, sterling k. brown wife, this is us, army wives, stanford university, sterling k. brown love story, sterling k. brown married, sterling k. brown marriage, randall this is us wife, who is sterling k. brown married to, ryan michelle bathe husband, sterling k. brown kids, sterling k. brown girlfriend", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/actors-sterling-k-brown-and-ryan-bathe-arrive-for-the-75th-news-photo-902323994-1536867160.jpg?crop=0.668xw:1.00xh;0.199xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Country Life,life,entertainment", "sailthru.date": "2018-09-13T22:11:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/actors-sterling-k-brown-and-ryan-bathe-arrive-for-the-75th-news-photo-902323994-1536867160.jpg?crop=1.00xw:0.754xh;0,0.0627xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/actors-sterling-k-brown-and-ryan-bathe-arrive-for-the-75th-news-photo-902323994-1536867160.jpg?crop=0.668xw:1.00xh;0.199xw,0", "sailthru.socialtitle": "Sterling K. Brown and His Wife's Love Story Has More Ups and Downs Than 'This Is Us'", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1536804660.0, "source": "https://www.countryliving.com", "summary": ""}