{"url": "https://www.harpersbazaar.com/celebrity/latest/a13953184/prince-harry-meghan-markle-wedding-differences-william-kate/", "text": "Prince Harry and Meghan Markle are set to have the wedding of the year this coming spring, but don’t expect their royal affair to be a copy of Prince William and Duchess Kate’s 2011 ceremony. Here’s what we know so far about how the wedding will be different.\n\nOn Tuesday, Kensington Palace announced that the wedding will take place in May 2018 at St. George’s Chapel in Windsor Castle. The Queen has approved the venue, and the royal family will pay for the wedding.\n\nThe marriage of Prince Harry and Ms. Meghan Markle will take place at St. George's Chapel, Windsor Castle in May 2018. pic.twitter.com/lJdtWnbdpB — Kensington Palace (@KensingtonRoyal) November 28, 2017\n\nSt. George’s Chapel contains the tombs of 10 royals, including Henry VIII and his third wife, Jane Seymour. At least three services take place there every day, and all are open to the public. Windsor Castle, where the Queen lives for part of every year, is located about 20 miles west of London. \"Windsor is a very special place for Prince Harry and he and Ms. Markle have regularly spent time there over the last year and a half,\" Kensington Palace said in a statement. Harry himself was christened there in 1984, so by the rules of the Church of England, he can be married there.\n\nSt. George’s Chapel at Windsor Castle. Getty Images\n\nThe interior of St. George’s Chapel at Windsor Castle. Getty Images\n\nThough William and Kate were married in Westminster Abbey in 2011 and Prince Charles and Princess Diana were married at St. Paul’s Cathedral in 1981, Harry's wedding won’t be the first time a recent royal has married at St. George’s. According to NBC News, Harry’s uncle, Prince Edward, married Sophie Rhys-Jones there in 1999, and his cousin, Peter Phillips, married Autumn Kelly at the chapel in 2008. Prince Charles and Camilla Parker-Bowles had a televised religious blessing there after they had a civil wedding ceremony nearby in 2005.\n\nThe space is much smaller than Westminster Abbey, holding around 800 people compared to the Abbey's whopping 2,000, The Guardian reports. Harry and Meghan plan on making the ceremony reflect their personalities and they're determining a way to involve the public in some way, their spokesman revealed. Either way, the tone seems like it will be much different from William and Kate’s pomp and circumstance.\n\n“It will be a moment of fun and joy that will reflect the character of the bride and groom,” their spokesman told journalists. “The couple of course want the day to be a special, celebratory moment for their friends and family. They also want the day to be shaped so as to allow members of the public to feel part of the celebrations too and are currently working through ideas for how this might be achieved.”", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/harry-william-weddings-1511886257.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/harry-william-weddings-1511886257.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "keywords": [], "authors": ["Megan Friedman"], "canonical_link": "https://www.harpersbazaar.com/celebrity/latest/a13953184/prince-harry-meghan-markle-wedding-differences-william-kate/", "title": "Harry and Meghan’s Wedding Will Be Very Different From William and Kate’s", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#606060", "og": {"type": "article", "site_name": "Harper's BAZAAR", "title": "Harry and Meghan’s Wedding Will Be Very Different From William and Kate’s", "description": "For one, it won't take place in London.", "url": "https://www.harpersbazaar.com/celebrity/latest/a13953184/prince-harry-meghan-markle-wedding-differences-william-kate/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/harry-william-weddings-1511886257.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 227018747326504, "pages": 8327967561}, "article": {"publisher": "https://www.facebook.com/HarpersBazaar", "modified_time": "2017-11-28 05:13:43", "published_time": "2017-11-28 05:11:00", "section": "Celebrity News", "opinion": "false"}, "twitter": {"site": "@harpersbazaarus", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/harry-william-weddings-1511886257.jpg?crop=1.00xw:1.00xh;0,0&resize=640:*"}, "google-site-verification": "bNUXKPTEqUVDbaxHrYA-c1kj007Ao4VsMKdoU80EyiU", "title": "Prince Harry and Meghan Markle's Wedding Compared to Prince William and Kate Middleton - Differences Between Prince Harry and Prince William's Weddings", "description": "Here's how Prince Harry and Meghan Markle's wedding will be different than Prince William and Kate Middleton's.", "keywords": "catherine, duchess catherine, duchess kate, duchess of cambridge, kate middleton, meghan markle, prince harry, prince william, royal engagement, royal wedding, prince harry and meghan markle wedding", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/harry-william-weddings-1511886257.jpg?crop=0.502xw:1.00xh;0,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrity,celebrity,latest,duchess catherine,duchess kate,meghan markle,Duchess of Cambridge,prince harry,catherine,prince william,kate middleton", "sailthru.date": "2017-11-28T17:11:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/harry-william-weddings-1511886257.jpg?crop=1.00xw:1.00xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/harry-william-weddings-1511886257.jpg?crop=0.502xw:1.00xh;0,0", "sailthru.socialtitle": "Harry and Meghan’s Wedding Will Be Very Different From William and Kate’s", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1511817060.0, "source": "https://www.harpersbazaar.com", "summary": ""}