{"url": "https://betches.com/will-dean-unglert-be-the-next-bachelor/", "text": "Dean Unglert, green-eyed Ken doll and America’s boyfriend, is on many people’s short list to be the next Bachelor. And I mean, why wouldn’t he be? He’s smart (I think). He’s handsome. He’s funny. He’s handsome. Did we mention handsome? Where was I? Oh yeah, this dude began his Bachelorette tenure with a vaguely racist comment and he would STILL be a better Bachelor than the last like, five dudes we’ve had (minus Ben, you’re perfect). Let’s see… he doesn’t have a speech impediment, isn’t a raging misogynist, and also isn’t responsible for anyone’s death as far as we know, so sign me tf up. And by me I mean him. But also me. To compete on his season. Yeah, okay, you get it. Moving on.\n\nLast night’s Men Tell All didn’t reveal who the next Bachelor would be, so it’s no surprise that #DeanforBachelor was trending on Twitter during the episode. I’m honestly just surprised that enough people were able to break themselves away from the spell Dean’s eyes cast upon them for long enough to create a hashtag, but I would like to thank those heroic Americans for their service to this country. But will Dean Unglert be the next Bachelor? Sorry, Deanie Babies. It’s not looking likely. Let’s look at the evidence.\n\nExhibit A: Dean is on Bachelor in Paradise. While I’m fully aware that being on Bachelor in Paradise does not preclude you from becoming The Bachelor, having Dean be on The Bachelorette and then Bachelor in Paradise two weeks later and THEN be The Bachelor seems like a lot. He would have to have Nick Viall levels of blackmail material on everyone working at ABC in order to pull that off, and I just don’t see that happening for a relative rookie to the franchise. However, I am in no way suggesting that my eyes, ears, or soul would tire of seeing Dean on my television screen, in case anyone from ABC is reading this. When it comes to how many consecutive hours of Dean I could feasibly watch on TV:\n\nExhibit B: Dean said he is not ready to be The Bachelor. I know—I’m already crafting my excuse to call out of work sick tomorrow so I can deal with this news, too. But it’s (reportedly) true. Dean supposedly told The Hollywood Reporter, which sounds like a fake news outlet if I’ve ever heard one, “I don’t think I’m ready yet, at this point in my life.” Dean’s right; he’s got to rack up a good thousand more Instagram followers before he can truly be “ready.” However, he did add, “Of course, I would never immediately dismiss any offer, but I’d really have to sit down and really think about it.” I think that’s our cue to create a GoFundMe to come up with the extra cash ABC needs to present Dean with an offer he can’t refuse, right? I’ll set one up just in case.\n\nSo I mean, who really knows what will happen. I think I speak for all of us when I say that if ABC tries to pull some fuckery and Nick Viall us again with some lame-ass dude from three seasons ago, I will personally burn the studio to the ground.", "images": ["https://betches.com/app/themes/bws-betches/dist/images/Betches_Main_Logo_b56dbfb2.svg", "https://s3.amazonaws.com/betches/app/uploads/2017/11/30094502/separator.png", "https://pixel.quantserve.com/pixel/p-ZqRuYBtPWtPaq.gif", "https://betches.com/app/plugins/a3-lazy-load/assets/images/lazy_placeholder.gif", "https://betches.com/app/themes/bws-betches/dist/images/Betches_Main_Logo_White_3fc34aaa.svg", "https://betches.com/app/themes/bws-betches/dist/images/separator_3963510f.png", "https://d24bnpykhxwj9p.cloudfront.net/s3file/s3fs-public/users1/2017-08/Tue/giphy%20%281%29_0.gif"], "top_img": "https://d24bnpykhxwj9p.cloudfront.net/s3file/s3fs-public/users1/2017-08/Tue/giphy%20%281%29_0.gif", "keywords": [], "authors": [], "canonical_link": "https://betches.com/will-dean-unglert-be-the-next-bachelor/", "title": "Sorry Everyone, Dean Unglert Is Probably Not The Next Bachelor", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "version": "1.222.425 | 10.32.02", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Sorry Everyone, Dean Unglert Is Probably Not The Next Bachelor | Betches", "description": "Dean Unglert, green-eyed Ken doll and America’s boyfriend, is on many people’s short list to be the next Bachelor. And I mean, why wouldn’t he be? He’s smart (I think). He’s handsome. He’s funny. He’s handsome. Did we mention handsome? Where was I? Oh yeah, this dude began his Bachelorette tenure with a vaguely racist … Continued", "url": "https://betches.com/will-dean-unglert-be-the-next-bachelor/", "site_name": "Betches", "image": {"identifier": "https://d24bnpykhxwj9p.cloudfront.net/s3file/s3fs-public/users1/2017-08/Tue/giphy%20%281%29_0.gif", "secure_url": "https://d24bnpykhxwj9p.cloudfront.net/s3file/s3fs-public/users1/2017-08/Tue/giphy%20%281%29_0.gif"}}, "article": {"tag": "tv movies and more", "section": "TV", "published_time": "2017-08-01T21:01:44+00:00"}, "twitter": {"card": "summary_large_image", "description": "Dean Unglert, green-eyed Ken doll and America’s boyfriend, is on many people’s short list to be the next Bachelor. And I mean, why wouldn’t he be? He’s smart (I think). He’s handsome. He’s funny. He’s handsome. Did we mention handsome? Where was I? Oh yeah, this dude began his Bachelorette tenure with a vaguely racist … Continued", "title": "Sorry Everyone, Dean Unglert Is Probably Not The Next Bachelor | Betches", "image": "https://d24bnpykhxwj9p.cloudfront.net/s3file/s3fs-public/users1/2017-08/Tue/giphy%20%281%29_0.gif"}, "generator": "WordPress 5.3.2", "fb": {"pages": 197896046906431}, "wp-parsely_version": "2.0", "msapplication-TileImage": "https://s3.amazonaws.com/betches/app/uploads/2018/01/13052953/cropped-favicon23-270x270.png"}, "movies": [], "publish_date": 1501621304.0, "source": "https://betches.com", "summary": ""}