{"url": "https://www.seventeen.com/celebrity/movies-tv/a20666366/13-reasons-why-season-3/", "text": "As you mentally mend from the heartbreak that was season two of 13 Reasons Why, check out all we know about what comes after that.\n\n***WARNING: There are season 2 spoilers ahead!***\n\nHere's everything we know so far about season three...\n\nWhen will season 3 be released?\n\n13 Reasons Why is finally coming back and the wait is almost over! Netflix has officially announced that the show will return on August 23 for another 13 episodes. They also released a brand new trailer that gives fans a sneak peek as to what they should expect in this new season and it has a SHOCKING reveal that you won't believe.\n\nSeason 3 might be a little less graphic\n\nAs we await 13 Reasons Why season 3, Netflix has announced that they are making some edits to the show's first season. The streaming platform has decided to remove Hannah Baker's suicide scene from the finale of season 1 \"on the advice of medical experts, including Dr. Christine Moutier, Chief Medical Officer at the American Foundation for Suicide Prevention,\" they said in a statement.\n\nAn update on 13 Reasons Why\n\n\n\nIf you or someone you know needs help finding crisis resources please visit https://t.co/cNtjtuNG1p pic.twitter.com/SxGjbYpZF6 — Netflix (@netflix) July 16, 2019\n\n\"No one scene is more important to the life of the show, and its message that we must take better care of each other,\" said the show's creator Brian Yorkey. \"We believe this edit will help the show do the most good for the most people while mitigating any risk for especially vulnerable young viewers.\"\n\nThis change might also mean changes for the upcoming season, which Netflix revealed will be coming later this summer. Following this edit, we can probably expect less graphic scenes in season 3, and possibly a more gentle approach to the subject of suicide.\n\n\n\nAnne Winters Says She Can't Watch This Scene\n\nChances are that fans are getting ready for season 3 of 13 Reasons Why with a rewatch or two. While a release date still hasn't been announced, Anne Winters is opening up about one scene that she couldn't get through while trying to watch old seasons.\n\n\"It was very graphic. I could barely watch it honestly,\" she told RadioTimes.com about Tyler's sexual assault scene at the end of season 2. \"It was very disturbing. I could see how that provoked a lot of controversy to be honest.\"\n\nDespite the controversy against it, Anne says that she is happy that show is at the forefront of telling very real stories that some people might be against seeing.\n\n\"At the same time I love being on a show that has so much controversy because it’s in everyone’s line of conversation, and everyone’s talking about it. I think that’s great,\" she said. \"But that was crazy: that scene is definitely one that I will not watch again.\"\n\nSeason 3 Will Have Some of the Show's Best Episodes\n\nThe cast is almost done wrapping up season 3 of 13 Reasons Why and Dylan Minnette is already getting fans excited thanks to his recent tweet.\n\nAccording to Dylan, the cast just got the scripts for the final 3 episodes and he couldn't help but share his opinion of them. \"I know i never really tweet about 13 reasons why but i gotta say some of these last few scripts of season 3 are the show’s best. alright that’s all,\" he wrote.\n\ni know i never really tweet about 13 reasons why but i gotta say some of these last few scripts of season 3 are the show’s best. alright that’s all👋 — Dylan Minnette (@dylanminnette) January 8, 2019\n\nWith the cast now getting the final scripts, it's only a matter of time that filming ends and a release date is announced!\n\nProduction Could Be Held Up Because of Selena Gomez's Emotional Breakdown\n\nAccording to Us Weekly, a source close to Selena says that, \"She wants to better herself every day. That’s her priority.” But could that take time away from her projects like 13 Reasons Why, which she produces? Only time will well.\n\nAbortion Might Be a Topic in Season 3\n\nAt least, if the storyline were up to actor Anne Winters (who plays Chloe), she would make it so. In the season two finale, we learned about Chloe's pregnancy, presumably with a child she conceived with Bryce. “Abortion should be a topic. I don't know if she should do it or not, I'm going to leave that up to the writers. But I think that it should definitely be discussed,” Winters told The Hollywood Reporter.\n\nFans were totally shocked when Chloe made the decision to stay with Bryce, but then everything started to add up in the last episode of season two, when Chloe told Jessica she's pregnant. We'll have to wait and see but maybe she found out she was pregnant before her testimony and that's why she ultimately stayed loyal to Bryce. Either way, there are so many questions to be answered when it comes to this storyline. The show has never shied away from tough issues before, so it's very likely the writers and producers will plan to address teen pregnancy in some way, shape, or form.\n\n\n\nWill Ross Butler Return To The Show Amid Alleged Murder Rumors?\n\nBack in May, 13 Reasons Why star Ross Butler (aka Zach Dempsey) made headlines after Frances Bean Cobain's ex-husband, Isaiah Silva, sued him, Courtney Love, and others for conspiring to murder him, according to court documents obtained by People. Silva claimed in his suit that they were \"conspiring to kill him with the intent of stealing\" Kurt Cobain's iconic MTV Unplugged guitar.\n\nRecently, Ross released a statement claiming his innocence. “I never entered into a conspiracy or otherwise agreed to commit any crime against Silva. I never conspired with anyone else to murder or kidnap Silva … or take possession of a guitar that Silva claims Ms. Cobain gave to him as a gift,” Butler said, according to documents obtained by The Blast.\n\nWill all this drama causes issues for him on set for season 3? Who knows.\n\n\n\nThe Cast Just Got Huge Raises for Season 3\n\nThe cast knows just how much they're worth and they're not afraid to ask for it.\n\nDylan Minnette and the rest of the teenage cast members asked Netflix for raises before season 3 started shooting. The negotiations came close to when filming was going to start, which led many to believe that production would be delayed. But it looks like negotiations went well and everyone walked out happy.\n\nDylan will be making $200,000 an episode while the rest of the cast will be making $135,000. If the show gets renewed for a fourth season, they will get another raise that will bring them to $150,000. The cast previously made $20,000 - $60,000 an episode. Dylan used to make around $80,000, according to Deadline.\n\nSeason 3 Has Started Filming\n\nThe cast returned to the San Fransisco Bay Area and the show has officially started filming according to pictures from the cast. By the looks of it, they're very excited to be back together again!\n\nShooting will run from August 12 until February 6, 2019, according to SFGate.\n\nGlorioso Casting has already set up casting calls for extras for the series, so this is definitely happening! It will continue to film in the same areas as previous seasons and no new locations have been announced yet.\n\nDylan Minnette Has Some Ideas for Clay After the End of Season 2\n\nThe end of season two left all of us wondering what is going to happen to Clay in season 3. After preventing Tyler from going through with his planned school shooting, Clay was seen holding Tyler's gun as police cars could be heard getting closer to the school. Dylan spoke with Entertainment Tonight and revealed that its likely the season will continue right where it left off.\n\n\"I don’t know, I’m not confirming, but that's where I feel like it’s going. I don’t know what Clay does with that gun, I don’t know how he gets out of it,” he tells Entertainment Tonight. “When we were filming it I did not realize that the sirens would sound that close!”\n\n\n\nHe also opened up about the possibility of exploring Clay's mental health. \"To continue the conversation of, you know, mental illness and everything can really be explored through Clay. I think there's a lot to be discussed with him,” he shared.\n\nDylan also told Entertainment Tonight that it's likely a safe bet we'll see more of Clay's relationship with Justin and the aftermath of Tyler's sexual assault. He also noted that Clay will likely stay away from romantic relationships after what happened with Skye and Hannah. He also said that this will be the first season without Hannah, which will definitely make things difficult for Clay.\n\n“I think if anyone expects Clay to have an easy path in any season, we know we're wrong,\" he said. \"I think that season three is definitely not gonna be easy for Clay or any of these people and if it was, I don’t think we’d be the show anymore…yeah, man, I’m nervous to know what Clay is gonna go through in season three.”\n\n\n\nYou can watch the teaser below, and if you look close enough, you'll notice the person opening the locker spins to 20-1-9 for the year it premieres. How clever is that?!\n\n\n\n#13ReasonsWhy has been renewed for a third season. All 13 episodes will premiere in 2019. pic.twitter.com/UPtOWyIvJq — See What's Next (@seewhatsnext) June 6, 2018\n\nMackenzie and Tyler could give their relationship another try.\n\nSeventeen.com recently spoke with Chelsea Alden, who plays Mackenzie in season 2, and according to her, there is a slight possibility Mack and Tyler could give their relationship another chance in season 3.\n\n\"I’d love to see Mack and Tyler try to start over. Maybe even just try to rebuild their friendship and trust, and hopefully that could build back into a relationship. But Tyler definitely has some things he needs to work on for himself, and I’d love to see Mackenzie just be there for him and help him through it,\" she said.\n\nFans might learn more about Monty.\n\nSeventeen.com got the chance to chat with Timothy Granaderos, who plays Monty, and of course, we had to ask him about his predictions for season 3.\n\n\"It's hard to say what'll happen to Monty. I think that sometimes in the real world, proper justice isn't served. From a viewer’s perspective, I hope Monty gets what’s coming to him. From an actor’s perspective, I hope it takes a season’s worth of episodes for it to come,\" he said.\n\n\n\nScott Reed could join forces with Clay.\n\nBy the end of season 2, Scott decides he no longer wants to protest Bryce and teams up with Clay and his friends to help find the polaroids from the clubhouse. Going forward, will Scott develop a closer relationship with Clay? Brandon Butler, who plays Scott, sure hopes so!\n\n\"Selfishly, I think it would be kinda interesting to see Scott hanging out with Clay’s crew and maybe learn more about Scott’s relationships with Bryce and Monty,\" Brandon told Seventeen.com.\n\nHannah probably won't be in it.\n\nBoth showrunner Brian Yorkey and star Katherine Langford hinted that a season 3 will most likely not see a ton of Hannah Baker.\n\nIn an interview with Entertainment Weekly, Langford said:\n\n\"For me, we told Hannah's story so fully in season one. And in a way, doing that scene in episode 13, I've so often referred to it as it was the hardest scene because it's the scene where I had to let her go. I think coming back this season was challenging because it was playing her but not really her. The challenge was when you tell a character's story so fully, and then you have to come back as a version of her that's filtered through other people's eyes; that required a lot of trust.\"\n\nYorkey told Elite Daily that Hannah most likely won't have a huge role in S3.\n\n\"The loss of Hannah will continue to be the inciting traumatic event for this group of kids and parents. It will always be part of the story. But I don’t see a tremendous continued presence for Hannah, because I think we needed her to finish telling everyone else’s side of her story and we needed her so that Clay could get to a point of saying, ‘I love you and I let you go',\" Yorkey explained.\n\n\n\nWe could see more of Zach and Hannah in season 3.\n\nFans fell in love with Zach and Hannah's romance, getting behind the Zannah ship for reals. There's a good chance showrunners will want to further develop this romance that had fans weeping tears of joy. Maybe it will be in the form of more flashbacks, or maybe there's more information from the Zach and Hannah days that will shed light on the future of Liberty High.\n\nJustin may be in danger.\n\nAt the end season two, as Clay and Justin were talking in Monet's coffee shop, the camera turned to Seth (Justin's mom's abusive and drug dealing boyfriend), who was watching them from his car. As we all know, Seth was previously mad at Justin for taking his money, but at that point, he was probably tracking Justin in hopes of finding his mom, who ran away and is nowhere to be found. This is all to say, Seth is bad news. And now that the Jensens are going to adopt Justin, this may mean the whole family will be in danger in season three.\n\nIt will probably address gun violence.\n\nGuns played a major role throughout season two, but in the last episode, Tyler planned a mass shooting at Liberty High School and almost went through with it, until Clay stopped him. Tony then pulled up in his mustang and drove away with Tyler, but what next? There were siren sounds, so clearly, the police were on their way.\n\n\n\nWill Clay report Tyler? Will Tyler go into hiding? There are a lot of questions regarding that last scene, so if the writers and producers are brainstorming material for season three, that would be a place to start.\n\nJessica may be in a love triangle.\n\nBefore the second season even premiered, fans were stressed about the rumored love triangle between Jessica, Alex, and Justin, and with good reason. Throughout season two, Alex and Jessica grew closer together and even shared a kiss at one point. Although their relationship status was unclear for most of the time, they eventually came to the agreement that they were dating.\n\nBut, then the school's Spring Fling came around — Jessica and Justin kissed! It was implied they may have gone further, but the point is, Jessica and Justin reconnected.\n\nGiven everything that's happened, the next season will most likely address this complicated love triangle. What do you guys think? Should Jessica date Alex or Justin? Or should she ditch both of them and live the single life?\n\nBryce may play a smaller role in season 3.\n\nAt the end of season 2, Bryce told Justin he was going to transfer to another school and \"start over,\" which means that he may be written out of season 3.\n\nIt could focus on a different old-school technology.\n\nSeason 1 was tapes and it seems like season 2 told a story through Polaroid pictures, so what does that mean for season 3?\n\n13 Reasons Why\n\nSeason 1 - tapes\n\nSeason 2 - Polaroids\n\nSeason 3 - VHS rentals from Blockbuster\n\nSeason 4 - Messages via carrier pigeon — Dan Lynch (@DanLynch94) May 8, 2018\n\nIf you are experiencing suicidal thoughts, connect with a counselor 24/7 at the National Suicide Prevention Lifeline by calling 1-800-273-8255, or by accessing the chat feature on their website. You can also visit the 13 Reasons Why website for more information on how to get help.", "images": ["https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/17/1600x800/landscape-1493291520-13-reasons-why-finale-3.jpg?resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/17/1600x800/landscape-1493291520-13-reasons-why-finale-3.jpg?resize=1200:*", "keywords": [], "authors": ["Tamara Fuentes", "Carolyn Twersky", "Entertainment Editor", "Tamara Fuentes Is The Entertainment Editor For Seventeen", "Covers Celebrity News", "Pop Culture", "Television", "Movies", "Music", "Assistant Editor"], "canonical_link": "https://www.seventeen.com/celebrity/movies-tv/a20666366/13-reasons-why-season-3/", "title": "'13 Reasons Why' Season 3 News, Date, Cast, Spoilers and Theories", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Seventeen", "title": "\"13 Reasons Why\" is Coming Back Sooner Than You Think and There's a Shocking Death That's Been Revealed", "description": "Looks like not everyone survived this season.", "url": "https://www.seventeen.com/celebrity/movies-tv/a20666366/13-reasons-why-season-3/", "image": {"identifier": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/17/1600x800/landscape-1493291520-13-reasons-why-finale-3.jpg?resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 112965278727107, "pages": 8028997215}, "article": {"publisher": "https://www.facebook.com/seventeen", "modified_time": "2019-08-01 02:51:13", "published_time": "2019-08-01 02:49:00", "section": "Movies & TV", "opinion": "false"}, "twitter": {"site": "@seventeen", "card": "summary_large_image", "image": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/17/1600x800/landscape-1493291520-13-reasons-why-finale-3.jpg?resize=640:*"}, "google-site-verification": "uQMdsrh02fvs6lNVGcB04v0iEtK1MpGMQ3UF-Fy0RVI", "title": "'13 Reasons Why' Season 3 News, Date, Cast, Spoilers and Theories - All the Details on 13RW Season 3", "description": "Now that 13 Reasons Why season 3 is officially happening, here's everything you need to know about the new season, including when it will air on Netflix, who in the cast from season 2 is coming back, plots, theories, and more.", "keywords": "13 reasons why season 3, 13 reasons why, 13 reasons why season 3 netflix, 13 reasons why season 3 release date, 13rw season 3, 13 reasons why season 3 date, when does 13 reasons why season 3 air, 13 reasons why season 3 cast, 13 reasons why season 3 spoilers, 13 reasons why season 3 theories", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/17/1024x1024/square-1493291520-13-reasons-why-finale-3.jpg?resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebs & Entertainment,celebrity,movies-tv", "sailthru.date": "2019-08-01T14:49:00Z", "sailthru.image.full": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/17/1600x800/landscape-1493291520-13-reasons-why-finale-3.jpg", "sailthru.image.thumb": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/17/17/1024x1024/square-1493291520-13-reasons-why-finale-3.jpg", "sailthru.socialtitle": "\"13 Reasons Why\" is Coming Back Sooner Than You Think and There's a Shocking Death That's Been Revealed", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1564598940.0, "source": "https://www.seventeen.com", "summary": ""}