{"url": "https://people.com/tv/what-you-didnt-see-2017-emmys/", "text": "While you were tuned in to Stephen Colbert‘s hilarious hosting antics at the 2017 Emmy Awards on Sunday, PEOPLE was watching for the action off-camera, backstage and on the red carpet. From the inseparable Big Little Lies ladies to the stunning This is Us cast, we caught every moment not shown on TV.\n\nHere are the best backstage moments you didn’t see.\n\nGet push notifications with news, features and more.\n\nOn the Red Carpet\n\nNewlywed Julianne Hough kicked things off on the 2017 red carpet. The Dancing with the Stars judge quickly made her way down the carpet as she posed, rocking a baby-oiled ponytail.\n\nThis Is Us nominee Sterling K. Brown and his wife Ryan Michelle Bathe joined Hough in the early-bird arrivals. The actor gave his wife a sweet kiss on the cheek as they waited to talk to press on the carpet. His wife gushed over her dress, saying she’s been FaceTiming with her stylist all morning. Brown adorably carried his wife’s train as they walked the carpet.\n\nImage zoom John Shearer/WireImage\n\nWatch the full episode of People & Entertainment Weekly Red Carpet Live, streaming now on PeopleTV. Go to People.com/peopletv, or download the app on your favorite streaming device.\n\nBrown’s This Is Us costar Mandy Moore (who’s newly engaged!) joined the actor on the carpet, where she complimented Bathe’s dress as she showed off her new ring.\n\nThe Modern Family cast also had a blast ahead of the show as Jesse Tyler Ferguson arrived and immediately ran over to say hi to RuPaul as Ty Burrell walked by and made him laugh. Burrell’s TV daughter Ariel Winter walked the carpet with her boyfriend Levi Meaden, showing off her legs in a stunning dress with a high slit.\n\nImage zoom Rob Latour/Variety/Shutterstock\n\nFor full Emmys coverage, click here.\n\nThe nominated ladies of Big Little Lies caused a commotion on the carpet as Reese Witherspoon, Nicole Kidman and Laura Dern walked together. Kidman also took the time to snuggle up with hubby Keith Urban while taking pictures.\n\nImage zoom Matt Baron/Shutterstock\n\nProud dad Liev Schreiber (and Ray Donovan nominee) walked the carpet with his adorable 8-year-old son Kai and protectively stroked his hair throughout the night.\n\nThe actor gave a sweet shoutout on Instagram to his youngest son, who he shares with ex-partner Naomi Watts. “The very dapper and downright divine Kai Schreiber!!!” Schreiber wrote.\n\nImage zoom Dan Steinberg/Invision/AP\n\nInside the Show\n\nThe show kicked off with a couple of sweet moments as late night hosts James Corden and Jimmy Kimmel led their respective wives to their seats hand-in-hand.\n\nThe audience got a hilarious surprise as former White House Press Secretary Sean Spicer came out with a makeshift podium. The celeb-filled crowd was as shocked as they were amused to see the embattled Spicer onstage.\n\nImage zoom CBS\n\nVeep‘s Anna Chlumsky reacting to Sean Spicer\n\nLater in the show, surprise supporting actress winner Ann Dowd was so stunned by her win for The Handmaid’s Tale that, as she staggered down the aisle, Leslie Jones reassured her, “Yes! It’s you! You won!”\n\nSterling K. Brown was a popular winner for This Is Us and had the crowd behind him as the Emmy producers cut off his mic and dimmed the lights in an attempt to end his speech for outstanding lead actor in a drama.\n\nBackstage\n\nWhile the show was happening live, the backstage area was abuzz with several big stars coming in and out.\n\nProud boyfriend Ben Affleck was seen standing close to his Saturday Night Live producer girlfriend Lindsay Shookus as they watched the show from a monitor. He sweetly kept his hand on her lower back after the long-running show took the award for outstanding variety series.\n\nRELATED VIDEO: From Sterling K. Brown To The Cast Of ‘Stranger Things’ — Celebs Gather At 2017 Emmy Awards Governors Ball\n\nAt the Afterparties\n\nElisabeth Moss and her two awards arrived at the Hulu event to a warm crowd eager to offer her praise. She danced to Nelly’s “Hot in Here” and laughed with Mad Men costar Jon Hamm. Samira Wiley and her wife Lauren Morelli posed in the photo booth at Otium in Downtown Los Angeles.\n\nOver at HBO’s after party at the Pacific Design Center in West Hollywood, the Big Little Lies stars gathered and outstanding lead actress in a limited series or movie Nicole Kidman accepted praise from an ongoing line of congratulators. Reese Witherspoon celebrated with husband Jim Toth and daughter Ava, 18, although the show’s star and producer told PEOPLE she didn’t need the outstanding limited series Emmy to feel like she’d won. “I set out four years ago to create better roles for women in film and television. That was the win,” she said. “I feel like we won before we got there that night. Just to have this, it’s just icing on the cake. I feel so lucky.”\n\nJulia Louis-Dreyfus sat with husband Brad and some friends, while Colin Jost chatted with Saturday Night Live producer Lorne Michaels about the talk shows he’d been visiting while in L.A. Alexander Skarsgard hit the dance floor just before the HBO gathering wound down around midnight.\n\nAt Netflix’s celebration, House of Cards‘ Robin Wright and daughter Dylan Penn relaxed and chatted in a booth, where the actress refueled with some food and the 26-year-old sipped on a cocktail. Master of None star Lena Waithe brought her Emmy onto the dance floor and received hugs and congratulations on her first win from friends. Nearby, the Stranger Things kids bopped around next to the deejay. The 13 Reasons Why cast, including Brandon Flynn and Tommy Dorman, stuck together throughout the evening and hung by the bar at NeueHouse Hollywood.\n\nThis Is Us‘ Sterling K. Brown chatted with Sarah Paulson for a while at Fox’s party, where his on-screen dad Milo Ventimiglia cozied up to girlfriend Kelly Egarian. Donald Glover celebrated his two victories among a group of well-wishers at Vibiana in L.A. Ariel Winter and boyfriend Levi Meaden spoke with her Modern Family costar Julie Bowen, as Sofia Vergara and some family members enjoyed the music, spending most of the night on the dance floor.\n\nBrown, Ventimiglia, and Glover also made appearances at the Governors Ball, as did SNL’s Jost, Leslie Jones, Kate McKinnon, Alec Baldwin and alum Seth Meyers. Glover posed for photos with Waithe and Riz Ahmed, who told PEOPLE his outstanding lead actor in a limited series or movie win feels, “incredible, exhilarating, really great.” On his way out of the Microsoft Theater, Jimmy Kimmel posed for selfies with fans.\n\nStay tuned for more behind-the-scenes tidbits.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fliev-schreiber4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fsterling-k-brown2-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fariel-winter7.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fanna-chlumsky3.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fariel-winter7.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fnicole-kidman12-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fariel-winter7.jpg", "keywords": [], "authors": ["Ale Russian"], "canonical_link": "https://people.com/tv/what-you-didnt-see-2017-emmys/", "title": "What You Didn't See on TV at the 2017 Emmys", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Ariel Winter,Emmy Awards,Julianne Hough,Keith Urban,Laura Dern,Mandy Moore,News,Nicole Kidman,Reese Witherspoon,Sterling K. Brown,TV", "news_keywords": "Ariel Winter,Emmy Awards,Julianne Hough,Keith Urban,Laura Dern,Mandy Moore,News,Nicole Kidman,Reese Witherspoon,Sterling K. Brown,TV", "description": "PEOPLE was watching for the action off-camera, backstage and on the red carpet while you were tuned to the show", "og": {"title": "What You Didn't See on TV at the 2017 Emmys", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/what-you-didnt-see-2017-emmys/", "description": "While you were tuned in to Stephen Colbert‘s hilarious hosting antics&nbsp;at the 2017 Emmy Awards&nbsp;on Sunday, PEOPLE was watching for the action off-camera, backstage and&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fariel-winter7.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/tv/what-you-didnt-see-2017-emmys/", "description": "PEOPLE was watching for the action off-camera, backstage and on the red carpet while you were tuned to the show", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fariel-winter7.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/what-you-didnt-see-2017-emmys/", "title": "What You Didn't See on TV at the 2017 Emmys", "description": "PEOPLE was watching for the action off-camera, backstage and on the red carpet while you were tuned to the show", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Fariel-winter7.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}