{"url": "https://www.elle.com/culture/movies-tv/news/a47020/princess-diaries-3-release-date-casting-news/", "text": "It's hard to believe that The Princess Diaries 2: Royal Engagement came out way back in August 2004. While the past 14 years have just flown by, fans of the Disney series have never given up hope on getting another sequel. And if new reports are to be believed, The Princess Diaries 3 is finally on the way, but will Anne Hathaway and Chris Pine return? Here's what we know so far.\n\nAs of 2019, the film is still very much on.\n\nWhile the bulk of updates about Princess Diaries 3 came out in 2017, Anne Hathaway was asked about the status of the project during her January 2019 appearance on Watch What Happens Live. She wants it to happen. Julie Andrews wants it to happen. They're working on it.\n\n\"There is a script for the third movie.... There is a script,” she said. \"I want to do it. Julie [Andrews] wants to do it. Debra Martin Chase, our producer, wants to do it. We all really want it to happen. It’s just we don’t want to unless it’s perfect, because we love it just as much as you guys love it. It’s as important to us as it is to you, and we don’t want to deliver anything until it’s ready, but we’re working on it, so...\"\n\nThere's already a script!\n\nEven before Hathaway confirmed there was a script, the author of The Princess Diaries book series, Meg Cabot told Entertainment Weekly that a script exists. She also said that if the movie gets made, it'll happen \"kind of as a tribute\" to Garry Marshall, director of the first two movies, who passed away in 2016. But Cabot refused to reveal any further details, apart from saying that the movies would likely deviate from the book series. She said, \"I think of them as two different universes.\"\n\nGarry Marshall was planning the third installment before he died.\n\nIn an interview with People in March 2016, Marshall said, \"I was with Anne Hathaway a couple weeks ago. It looks like we want to do The Princess Diaries 3 in Manhattan.\" Sadly, Marshall's plan never came to fruition, but it's possible that the sequel will still be set in New York, to honor his idea.\n\nAnne Hathaway has a secret idea for the sequel.\n\nJulie Andrews, who plays Queen Clarisse Renaldi in the movies, told Buzzfeed in February 2017, \"Annie had an idea that she wanted to pursue about it, and I'm all for it, so if she'd like to…\" And, yes, the \"Annie\" she's referring to is Anne Hathaway. Andrews also confirmed, \"I would very willingly and happily do it.\"\n\nHowever, it might be some time before 'The Princess Diaries 3' eventuates.\n\nHathaway's rep reportedly told Buzzfeed in March 2017, \"It's way too premature to discuss this project.\"\n\nWhile appearing on Watch What Happens Live in October 2019, Andrews was asked about the status of a Princess Diaries 3 script, to which she replied, \"Well, the truth is I haven't heard. But there's been talk about it for quite a while,\" adding, \"I think [co-star Hathaway] had or is having a second child and she's busy and I've been busy. I think if it happens, it would be lovely, and if it doesn't, I wouldn't have known about it.\"\n\nChris Pine is open to it.\n\nIn January 2016, during a fan Q&A for Entertainment Weekly, Pine was asked, \"Don't you pray every night for a Princess Diaries 3?\" To which he replied, \"Have you been reading my diary?\"\n\nMandy Moore would consider a cameo.\n\nIn July 2017, Moore, who played mean-girl cheerleader Lana, told ELLE.com, \"If I'm going to be involved, I would be down for a cameo—maybe she could make amends with Mia and apologize for being a bully when she was younger. She was insecure, going through a difficult time in her life and [has now] reflected on why that wasn't okay.\"\n\nMoore also appeared on People Now in February 2019 and was asked what she would like to see for her character Lana. The actress has a pretty fleshed out answer: \"I would like to see if life kicked down a few pegs because she was the bully in school [if she comes back]. I'd like to see her is life has come full circle and maybe she's a little more well humble. I would be down!\"\n\n©Walt Disney Co./Courtesy Everett Collection Everett\n\nPrincess Mia's best friend Lilly Moscovitz would come back.\n\nIn July 2016, Heather Matarazzo, who played Princess Mia's best friend Lilly Moscovitz, told Cosmopolitan that she would definitely return for another sequel. She said, \"If Annie and Julie are down, of course.\"\n\nThe fans are ready.\n\nPetition for Princess Diaries 3 — sofia (@sofialdana1) November 21, 2018\n\nI NEED PRINCESS DIARIES 3!!!!!!!!!! WHERE IS IT?!?!?!?!?!?!?? — Francis Dominic✨ (@francisdominiic) August 13, 2018\n\nHonestly if they make a third #PrincessDiaries movie my heart would probably explode with joy. — Sara 🐍🌻📚🏃‍♀️ (@Sarawrr13) July 29, 2017\n\n“Princess Diaries 3 is officially coming out!!!”\n\n“THIS. IS. NOT. A. DRILL.”\n\n“It is FINALLY happening.”\n\n“Please don’t freak out.”\n\n\n\nMe: pic.twitter.com/mk9IwCrk0Y — 𝚌𝚕𝚊𝚛𝚎𝚗𝚣𝚎 (@khlournz) January 25, 2019\n\nThe Princess Diaries 3 but it’s about Gupta finding out she is a queen.\n\n\n\nShe immediately takes it so seriously while continuing her job as Vice Principal and says “The Queen is coming” every time she enters a room. pic.twitter.com/Hb42uLFpsG — Amanda Holland (@AwkwardHolland) January 2, 2019\n\nHold the phone..... princess diaries 3?! My inner child is coming out 😳😂 — Cole 💁🏻‍♀️ (@juuury_) January 25, 2019\n\nWhile we all wait for an official announcement, there's plenty of time to rewatch the first two movies, and remember just how cute Chris Pine was in Royal Engagement.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/mcdprdi-ec057-1548424577.jpg?crop=0.754xw:0.524xh;0.246xw,0.329xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/mcdprdi-ec057-1548424577.jpg?crop=0.754xw:0.524xh;0.246xw,0.329xh&resize=1200:*", "keywords": [], "authors": ["Amy Mackelden", "Weekend Editor", "Amy Mackelden Is The Weekend Editor At Harpersbazaar.Com", "Where She Writes About Entertainment", "Celebrity News", "Beauty"], "canonical_link": "https://www.elle.com/culture/movies-tv/news/a47020/princess-diaries-3-release-date-casting-news/", "title": "Everything We Know About The Princess Diaries 3 So Far", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "ELLE", "title": "Everything We Know About 'The Princess Diaries 3' So Far", "description": "There's a script, and the movie is still happening.", "url": "https://www.elle.com/culture/movies-tv/news/a47020/princess-diaries-3-release-date-casting-news/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/mcdprdi-ec057-1548424577.jpg?crop=0.754xw:0.524xh;0.246xw,0.329xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "modified_time": "2019-10-25 01:47:16", "published_time": "2019-01-25 01:00:00", "section": "Movies & TV 2020", "opinion": "false"}, "twitter": {"site": "@ELLEmagazine", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/mcdprdi-ec057-1548424577.jpg?crop=0.754xw:0.524xh;0.246xw,0.329xh&resize=640:*"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "title": "The Princess Diaries 3 Cast, Release Date, Rumors, and News", "description": "If new reports are to be believed, The Princess Diaries 3 is finally on the way, but will Anne Hathaway and Chris Pine return? Here's what we know so far.", "keywords": "Anne Hathaway, chris pine, mandy moore, meg cabot, julie andrews, princess diaries 3, princess diaries, princess diaries 3 cast, princess diaries 3 date, princess diaries 3 news, princess diaries 3 rumors", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/mcdprdi-ec057-1548424577.jpg?crop=0.721xw:1.00xh;0.279xw,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Culture,culture,movies-tv,chris pine,mandy moore,anne hathaway", "sailthru.date": "2019-01-25T13:00:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/mcdprdi-ec057-1548424577.jpg?crop=0.754xw:0.524xh;0.246xw,0.329xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/mcdprdi-ec057-1548424577.jpg?crop=0.721xw:1.00xh;0.279xw,0", "sailthru.socialtitle": "Everything We Know About 'The Princess Diaries 3' So Far", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1548349200.0, "source": "https://www.elle.com", "summary": ""}