{"url": "www.albawaba.com/entertainment/did-lindsay-lohan-convert-to-islam%3F-1091090", "text": "She sparked rumours she had converted to Islam when she changed her Instagram bio to 'Alaikum salam' in January, which translates to 'and unto you peace' in Arabic.\n\nAnd Lindsay Lohan certainly looked the part as she attended a London Modest Fashion Week event in the capital on Sunday.\n\nThe American Mean Girls actress, 31, opted to wear a hijab for the event, conforming to the event's theme- which showcases the latest styles in hijabs, abayas and long hemlines.\n\nLetting a glimpse of her trademark flame hair shine through, the head piece perfectly framed her pretty face, accentuated by a touch of lipgloss and eyebrow pencil.\n\nShe teamed it with a black bomber jacket and black trousers as she stopped to check out the cosmetics.\n\nThe actress was seen posing with excited fans at the event, before making a quiet exit.\n\nSharing a snap of the actress with their goodie bag, a beauty brand from the event later wrote: 'She was so lovely and was saying how she's into halal cosmetics and what she’s actually wearing on her face today was all halal!!'\n\nLetting a glimpse of her trademark flame hair shine through, the head piece perfectly framed her pretty face, accentuated by a touch of lipgloss and eyebrow pencil.\n\nShe teamed it with a black bomber jacket and black trousers as she stopped to check out the cosmetics.\n\nThe actress was seen posing with excited fans at the event, before making a quiet exit.\n\nSharing a snap of the actress with their goodie bag, a beauty brand from the event later wrote: 'She was so lovely and was saying how she's into halal cosmetics and what she’s actually wearing on her face today was all halal!!'\n\nModest: The American Mean Girls actress, 31, opted to wear a hijab for the event, conforming to the event's theme- which showcases the latest styles in hijabs, abayas and long hemlines\n\nLondon Modest Fashion week kicked off this weekend, showcasing the latest styles in hijabs, abayas and long hemlines.\n\nThe second installment of the two-day event, held at Victoria House, Bloomsbury, saw models parading down the runway in demure clothing.\n\nRunning alongside London Fashion week, the event, which charges up to £200 for tickets, features shopping, runway shows, talks and workshops - including a 'sharia legal hub'.\n\nMore than 40 designers from around the world showcased scarves, hijabs and loose-fitting maxi dresses at the annual style showcase organised by Haute Elan, who say 'modest fashion' is one of the fastest-growing consumer markets.\n\nIn January Lindsay deleted all the pictures on her Instagram account and changed her bio, changing her bio to 'Alaikum salam.'\n\nA new angle: London Modest Fashion week kicked off this weekend, running alongside London Fashion week\n\nThe Arabic greeting translates to 'and unto you peace,' and many took it mean that Lohan was converting to the Muslim faith.\n\nLohan has not revealed however if she is in fact converting to the faith, and a rep for the actress did not respond to a request for comment from DailyMail.com.\n\nThere were previously rumors that Lohan might be converting back in 2015 when she was photographed holding a copy of the Quran while doing community service in Brooklyn.\n\nWhen appearing on the Turkish talk show Haber Turk later year, she explained that the book was actually just a gift from some friends.\n\n'My very close friends, who have been there for me a lot, in London are Saudi and they gave me the Quran and I brought it to New York because I was learning,' said Lohan.\n\nRare picture: In January Lindsay deleted all the pictures on her Instagram account and changed her bio, changing her bio to 'Alaikum salam.' (seen in her latest new Instagram post)\n\n'It opened doors for me to experience spiritually, to find another true meaning. This is who I am.'\n\nShe said however that she was attacked after that picture was released in the media.\n\n'They crucified me for it in America. They made me seem like Satan. I was a bad person for holding that Quran,' said Lohan.\n\nShe said that she was then happy to leave and return to London because she felt unsafe in [her] country.\n\nLohan spent time in October of last year visiting child refugees who had fled Syria and crossed over into Turkey.\n\nShe told Page Six last month that she was hoping to return to Turkey again either before of after the start of the new year.\n\n'The dates are not set yet. It depends on how Turkey feels after the recent terrorist attack in Istanbul,' said Lohan,\n\n'Not that any attack has or will ever stop me from helping those suffering, those who need our help the most.'\n\nShe then added: 'I miss my family a lot, but they are very supportive and understanding of the fact that my main focus is business, writing and soon to start another film. More so, my work with refugees.'\n\nJust a few days before her account was wiped clean in January 2017, Lindsay had shared a poem in which she said she wanted to 'fix ISIS minds'.\n\n'Sometimes I hear the voice of the one I loved the most. But in this world we live in on terror,' the poem went.\n\n'Who i am to be the girl who is scared and hurt, when most things that happen i cannot explain.\n\n'I try to understand, when i'm sitting in bed alone at 3am. So i can't sleep, i roll over. I can't think and my body becomes cold. I immediately feel older.....\n\n'Than [sic] i realize, at least I am in a bed. I am still alive. So what can really be said? Just go to bed and close the blinds.\n\n'Still and son on, i cannot help but want to fix all of these idle isis minds because, there has to be something i can figure out.\n\n'Rather than living in a world of fear and doubt, they now shoot, we used to shout\n\n'If only i can keep trying to fix it all, i would keep the world living loving and small. 'I would share my smiles and give too Many kisses.'", "images": ["https://www.albawaba.com/sites/default/files/styles/d02_traditional/public/2020-04/EVvrjjPX0AExU2C.jpg?h=db8c261b&itok=AqdOHYMv", "https://www.albawaba.com/sites/default/files/styles/d02_traditional/public/2020-04/waRbd7Zk.jpg?h=8995857d&itok=0-yNpwiw", "http://www.albawaba.com/sites/default/files/im/Laura.jpg", "https://www.albawaba.com/sites/default/files/styles/de2e_standard/public/im/InstagramLindsay.jpg?itok=sPnBzO8L", "https://logo.albawaba.com/logos/small/1742.png", "https://www.albawaba.com/themes/custom/abn/logo.svg", "http://www.albawaba.com/sites/default/files/im/Lindsay1.jpg", "https://www.albawaba.com/sites/default/files/styles/d02_traditional/public/158711877776.jpeg?h=d1cb525d&itok=FxKYgPgm", "https://www.albawaba.com/sites/default/files/styles/d02_traditional/public/2020-04/Screen%20Shot%202020-04-17%20at%206.52.14%20PM.png?h=7639a74e&itok=JIeLynNe", "https://www.albawaba.com/sites/default/files/styles/d02_traditional/public/2020-04/000_1QN1LE.jpg?h=69f2b9d0&itok=e0_N7-j3", "http://www.albawaba.com/sites/default/files/im/Linsday_Instagram1.jpg", "https://www.albawaba.com/themes/custom/abn/logo-print.png", "https://www.albawaba.com/sites/default/files/styles/default/public/im/InstagramLindsay.jpg?itok=MHdIrB3B", "https://www.albawaba.com/themes/custom/abn/images/footer-logo.png"], "top_img": "https://www.albawaba.com/sites/default/files/styles/default/public/im/InstagramLindsay.jpg?itok=MHdIrB3B", "keywords": [], "authors": [], "canonical_link": "https://www.albawaba.com/entertainment/did-lindsay-lohan-convert-to-islam%3F-1091090", "title": "Did Lindsay Lohan Convert to Islam?", "meta_data": {"title": "Did Lindsay Lohan Convert to Islam? | Al Bawaba", "og": {"site_name": "Al Bawaba", "type": "article", "url": "https://www.albawaba.com/entertainment/did-lindsay-lohan-convert-to-islam%3F-1091090", "title": "Did Lindsay Lohan Convert to Islam? | Al Bawaba", "description": "She sparked rumours she had converted to Islam when she changed her Instagram bio to 'Alaikum salam' in January, which translates to 'and unto you peace", "image": {"identifier": "https://www.albawaba.com/sites/default/files/styles/default/public/im/InstagramLindsay.jpg?itok=MHdIrB3B", "url": "https://www.albawaba.com/sites/default/files/styles/default/public/im/InstagramLindsay.jpg?itok=MHdIrB3B", "width": 1200, "height": 630}}, "twitter": {"card": "summary_large_image", "description": "She sparked rumours she had converted to Islam when she changed her Instagram bio to 'Alaikum salam' in January, which translates to 'and unto you peace", "title": "Did Lindsay Lohan Convert to Islam? | Al Bawaba", "image": {"identifier": "https://www.albawaba.com/sites/default/files/styles/default/public/im/InstagramLindsay.jpg?itok=MHdIrB3B", "height": 630, "width": 1200}}, "description": "She sparked rumours she had converted to Islam when she changed her Instagram bio to 'Alaikum salam' in January, which translates to 'and unto you peace", "abstract": "She sparked rumours she had converted to Islam when she changed her Instagram bio to 'Alaikum salam' in January, which translates to 'and unto you peace", "referrer": "origin", "rights": "©2020 Al Bawaba. All rights reserved.", "p": {"domain_verify": "85420ddac6963c616968109fe3d1e16b"}, "MobileOptimized": "width", "HandheldFriendly": "true", "apple-mobile-web-app-capable": "yes", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.albawaba.com", "summary": ""}