{"url": "https://web.archive.org/web/20090604101517/http://www.whitehouse.gov/the_press_office/Background-Briefing-on-GM-Restructuring-May-31-2009/", "text": "THE WHITE HOUSE\n\n\n\nOffice of the Press Secretary\n\n\n\n__________________________________________________\n\nFOR IMMEDIATE RELEASE June 1, 2009\n\n\n\nBACKGROUND BRIEFING\n\nBY SENIOR ADMINISTRATION OFFICIALS\n\nON THE GENERAL MOTORS RESTRUCTURING\n\n\n\nMay 31, 2009\n\nVia Conference Call\n\n7:10 P.M. EDT\n\n\n\nMS. PSAKI: Thank you, everyone, for joining the call. Just a reminder that the call this evening is on background, and you can attribute quotes to a senior administration official. And the embargo is set for 10:00 p.m. this evening Eastern time. Everyone on this call should also have a fact sheet.\n\nI'm going to turn it over to Robert Gibbs now.\n\nMR. GIBBS: Thanks, everybody, for joining. We're going to do this basically in two parts. The first part, my colleagues will go through the GM specific parts of the call tonight. And then after that we will go through the government ownership principles, which I know a number of you are interested in as part of this and other transactions.\n\nSo with that, I'm going to turn it over to my colleague.\n\nSENIOR ADMINISTRATION OFFICIAL: Thanks, I'll just try to run through this reasonably quickly and maximize the time for questions. Everyone should have a fact sheet. I know you've only had it for a short period of time, so let me run through quickly the main points that we wanted to cover.\n\nEveryone is aware that 60 days ago the President announced that he would give General Motors 60 days in order to design a plan for viability that would achieve lasting and permanent profitability and opportunity for success. And since that time the company has been working diligently in conjunction with the auto task force to implement those principles, including one of the President's main principles which was the concept of shared sacrifice among all of the stakeholders.\n\nAnd so we are here tonight to give you a preview of the results of this, including what the President will talk about tomorrow. So I'll run through that reasonably quickly.\n\nFirst, within this concept of shared sacrifice there are several things to talk about -- first, as I said, the auto task force has worked with GM on an operational restructuring that is designed to reduce General Motors break-even point of about 16 million annual rate of car sales down to 10 million annual car sales environment. As many of you undoubtedly know, we're running about 9.5 million car sales at the moment. And so we hope that by reducing this break-even point GM will be able to endure a period of difficult car sales before hopefully we will see a recovery, and this will, of course, allow GM to become profitable at a much lower level of car sales than has been the case before.\n\nSecondly, as you know, the UAW has reached a new agreement with GM and that agreement has been ratified that involves significant concessions by the UAW -- concessions that are in virtually every respect more aggressive than what the previous administration demanded in its loan agreement. And one of the major aspects of that settlement, of that renegotiation, was changes in terms of the VEBA -- employee retirement health care trust in which GM had a $20 billion obligation under its existing -- and I'll talk in a second about what's going to happen with that.\n\nGM is also announcing more or less as we speak that the steering committee has reported that bondholders represent at least 54 percent of GM's unsecured bonds, have agreed to tender their portion of the $27 billion of unsecured debt for a pro rata share of 10 percent of the equity of new GM for -- inaudible -- for an additional 58 percent. And so I think from the standpoint of the U.S. government we are very pleased and gratified to be going into the 363 process that will commence tomorrow with such a strong showing of support from the -- inaudible -- community.\n\nAnd then GM is also announcing tonight the specifics of its operational restructuring with respect to its plant operations. And we will leave the details of that to them as it is their decisions and their restructuring.\n\nSo we are going through, as I think everyone here is aware, a 363 process that we hope and expect will be similar to Chrysler. We do not expect it to be as speedy as Chrysler's because GM is a far larger, far more complicated global company, but we do expect it to proceed, broadly speaking, along similar lines to the Chrysler one, which you all know, has made very good progress and is very close to a successful outcome.\n\nSo in the context of that 363, a new company, a new GM, if you will, will be formed to purchase the operating assets out of the old General Motors that will become part of this new company. And left behind in the old company will be liabilities and other miscellaneous assets that are no longer needed as part of the new General Motors that we expect to create.\n\nSo as part of that several other things will happen. First, the new GM will establish a new VEBA, a new independent trust. And you will recall that I mentioned the $20 billion obligation that the old General Motors had to VEBA. As part of the shared sacrifice that the President has emphasize, that will be replaced by a $2.5 billion note, $6.5 billion of preferred stock, and 17.5 percent of the equity of new GM -- thus warrants to purchase an additional 2.5 percent of the company.\n\nAs was the case in Chrysler, VEBA will have the right to select one independent director, and as in the case with Chrysler, and will be the case with both companies, neither VEBA nor UAW will have any right to voter's share or any other government right. So it is with the exception of one independent director, a purely passive interest.\n\nAs was the case with Chrysler, the qualified pension plan for both hourly and salaried employees will be carried over to the new GM and will remain intact and benefits will be paid in the normal course.\n\nThirdly, as I mentioned, the U.S. Treasury is preparing to provide about $30 billion of additional financing through -- inaudible -- possession process during this Chapter 11 to meet both working capital needs during the bankruptcy process as well as to refinance certain existing obligations, and as well as to be sure that the company has the means to be successful in the future. And I'll talk a little bit more about that in a second.\n\nThe U.S. Treasury does not believe or anticipate that any additional assistance to GM will be required. We intend for this to be a permanent resolution of the GM situation and an ability for the company to go forward and be profitable.\n\nIn exchange for the $30.1 billion, the U.S. government will receive about $9 billion of debt and preferred stock in the new GM and approximately 60 percent of the equity in the new company.\n\nLet me emphasize in anticipation of those later discussion and questions that we did not seek or solicit or desire to have this equity position. We came upon it simply as a matter of prudence and out of desire to assure that GM was able to go forward with a flexible, deleverage balance sheet, one that is capable of sustaining itself during -- in a very cyclical business in what is obviously a difficult environment. And so we had a choice as guardians of the taxpayer dollars, which was to either take this equity as part of the consideration that we could receive on behalf of the U.S. taxpayers, and hopefully have it result in the taxpayers receiving a greater recovery, or we could have simply left it behind and given it to others and taxpayers would have ended up much shorter in terms of the total outcome. So the equity ownership of the U.S. government is not something we sought or desired; it was simply a necessary outcome of the restructuring process and a desire to have GM with a substantially deleveraged balance sheet and able to be competitive.\n\nWe're also very pleased to say that the governments of Canada and Ontario -- similar to the situation with Chrysler, will participate alongside the Treasury by lending about $9.5 billion and they will also receive both debt and preferred stock and about 12 percent of the equity in the new GM, and similar to the case with Chrysler, the right to pick one of the initial directors.\n\nI think at that point I will -- I think I've covered now the main points on GM, so let me turn it back to Robert\n\n\n\nMR. GIBBS: Thanks. Before we take questions on that -- do you want to go through our government ownership principles now? I know it's a big part of what a lot of folks are interested in.\n\nSENIOR ADMINISTRATION OFFICIAL: Sure, let me take that on and start by saying that while this, of course applies to GM right now, this is part of a much broader effort to articulate principles for the U.S. government investments in a series of other companies as well. So this is more about how we can expect the government to act as a common shareholder in this and other cases.\n\nThe first starting point is really to pick up on something you said, which is the government really has no desire to own equity stakes in companies any longer than is absolutely necessary and will actively seek to dispose its ownership interest as soon as it is practical to do that. The goal is to promote strong, viable companies that can become profitable quickly, can contribute to growth and jobs without government involvement. And there is absolute clarity about that.\n\nOf course, in exceptional cases where the U.S. government feels it's necessary to respond to a company's request for assistance the government has decided to reserve the right to set upfront conditions that will protect taxpayers and promote the financial stability or encourage growth. And in the sense of -- inaudible -- conditions, there has been some -- as you've seen in this restructuring and in some other companies, where necessary, these conditions are precisely the kinds of restructuring that my colleague has talked about and would focus primarily on ensuring a strong board of directors, that focuses on the right kind of management that can deliver a long-term vision, that gets these companies to be profitable, ends the need for government support as quickly as is practical.\n\nNow, after those upfront conditions are in place, the government feels that it can protect taxpayers' investment by managing its ownership stake as a hands-off in a commercial manner as possible. And so the government will not interfere with or exert control over day-to-day company operations and very much will ensure that no government employees will serve on board or be employed by the company it makes investments in.\n\nAs a shareholder, the government will limit what it votes on to core governance issues, particularly the selection of the company's board of directors; major corporate events or transactions. And in its effort to protect taxpayers' resources as much as possible, the government intends to be extremely disciplined as to how it uses even these limited rights.\n\nSo those, as I said, are the principles that apply here in the upfront restructuring of GM and in the intention of the government going forward, but are consistently being applied where the U.S. finds itself in these kinds of situations.\n\nMS. PSAKI: Thank you so much. I think we're ready to turn it over to questions at this point.\n\nQ Good evening. Appreciating that this is obviously a bigger company than Chrysler, how quickly do you expect you can get it through, and do you expect that legally it will be more difficult?\n\n\n\nSENIOR ADMINISTRATION OFFICIAL: In 60 to 90 days; more complicated and many more moving pieces, but we are hopeful that it will have a similar successful outcome.\n\nQ Can you speak a little bit about the input that you will have on the selection of some of the directors -- you're not naming them directly, but you will have input into who some of the new board members are -- what kind of direct or indirect input, and what would you be looking for in the directors?\n\nSENIOR ADMINISTRATION OFFICIAL: Let me say a couple of things about that. First, you'll recall that at the time the President, on March 30th -- announced that a majority of the directors of new General Motors would be new, so by implication, there will be a number of existing General Motors directors that will continue with the new company and there will be identified, based on consultations between the current chairman and his colleagues and ourselves -- there has been a process underway since that announcement, led by the General Motors board, to identify additional directors, again in consultation with the U.S. government.\n\nThirdly, with respect to the kinds of people that are being sought, they are business leaders, CEOs, former CEOS, people from other walks of life with relevant experience and can contribute, regardless of political background, affiliation, or nature. And I would point you to the selection of the term at Chrysler, Bob Kidder, very distinguished former businessman, former CEO of Borden, former CEO of Duracell, his politics are not known to any of us anyway, who has agreed to take this on because of his belief in this industry and belief and desire that Chrysler could succeed. And I think Bob Kidder exemplifies the type of individual that will be sought to serve on the new General Motors board.\n\nQ Are we going to see the new board members named tomorrow or is that a longer process?\n\nSENIOR ADMINISTRATION OFFICIAL: I would expect over the 60 to 90 days, by the time the company comes out of bankruptcy 60 or 90 days from now, I would expect you to see substantial additions to the GM board.\n\nSENIOR ADMINISTRATION OFFICIAL: As a technical matter, these directors will actually join the board of New Co., which will be buying the assets out of General Motors.\n\n\n\nQ Gentlemen, can you specify how the UAW negotiations altered the restructuring plan and are there still the number of plants being closed as before, even though there is one new assembly plant -- also how would the process for -- inaudible -- dealer count of GM mirror or change from that used by Chrysler in its bankruptcy case?\n\nSENIOR ADMINISTRATION OFFICIAL: We were involved in helping to facilitate the discussions between the UAW and General Motors, but I think those are matters that are best left to the two of them. I think the UAW has spoken about its contracts and what it believes. Obviously the vast majority of its members have ratified it. And General Motors has spoken about the contract. So I think they're both satisfied with it and we're satisfied with it, but we don't see a need to get into the details.\n\nSENIOR ADMINISTRATION OFFICIAL: And with respect to your second question, GM has already embarked on the beginnings of its new -- inaudible -- program. They have different management in process, so inevitably it thinks about life slightly differently and so it's a slightly different process that they're going through, but the goal and the end result is intended to be very similar.\n\nQ Can you talk a little bit about how long it might take to get all this money back over time and what your expectations are as to how much the taxpayer might see back on this?\n\nSENIOR ADMINISTRATION OFFICIAL: I don't think we're here today to predict or project. We designed the restructuring to maximize the potential for taxpayer money. The company has done a great job on the operational restructuring -- in conjunction with our colleagues in order to facilitate that. And so we certainly intend to maximize taxpayer proceeds, but I would also point you back to what my colleague said, that we intend to also exit as soon as practical.\n\nQ My question is to expand the subsidiary of GM. Australia, for instance, has got a subsidiary of General Motors America. What will happen to those subsidiaries, and will there be any restrictions on the new GM investing in factories overseas, like for instance, the factory in Australia?\n\nSENIOR ADMINISTRATION OFFICIAL: One of the principles that the President established early on that we have very much intimated as part of this is that U.S. taxpayer dollars should stay within the U.S. And that is not intended to sound protectionist -- I think it's a principle that every country follows. And so we do not intend to use U.S. taxpayer dollars to support foreign subsidiaries. Happily, most of GM's foreign subsidiaries are able to sustain themselves independently or by receiving support from their local governments, as I believe will be the case in Australia. We have had contacts with the Australian government on this matter and I believe they're intending to support GM Australia.\n\nYou're all aware of the restructuring of Opal -- of GM Europe, and that was effected under the same set of principles, and those are the principles that we intend to maintain going forward. I think having a global footprint is certainly an advantage to General Motors, and to the extent that it is financially prudent and within those principles, we'd certainly like to see it continue.\n\nQ Good evening. Could you give us a sense whether any members on the current GM board will be remaining on the board of the new company, and how that will work with the lead executives at GM, as well, please?\n\nSENIOR ADMINISTRATION OFFICIAL: Well, I believe I already answered that question by reminding you that the President, on March 30th, said that the majority of the GM board will become new members, which means a minority will be old members. And so we do expect to have some continuity with respect to those members. Fritz Henderson is the CEO and like all CEOs, serves at the pleasure of the board, and we would expect that that relationship would continue.\n\nQ As GM restructures and the government is now involved in that company, how -- or will the government get involved in new jobs, or should I say, fuel-efficient, alternative-fuel sources, starting with that type of training with GM employees?\n\nSENIOR ADMINISTRATION OFFICIAL: As my colleague suggested, there are a number of principles that are going to govern our behavior as a shareholder in this company and others, one of which is no involvement in day-to-day business matters. And that will be a continuing principle for us. Of course the government of the United States has many relationships with the automobile industry as a whole, including foreign companies and including companies that have not been the beneficiaries of financial support from the U.S. government. And those matters, whether they go to regulation for fuel efficiency, or regulation for safety or support, or employment or what have you, will continue, but they will continue on a track entirely separate from and not driven by our role as shareholders.\n\nI might mention the President some time ago appointed Ed Montgomery, the former deputy secretary of labor, to support him in assuring that we were doing everything that we could for communities in Michigan.\n\nQ I was just wondering if you guys are disclosing which plants or factories may close as part of all this restructuring. I know there's been talk of 14, or is that still up in the air right now or haven't been determined?\n\nSENIOR ADMINISTRATION OFFICIAL: As I said earlier, General Motors I believe is in the process of releasing that information, and I think, in the context of what my colleague said about us not making plant-by-plant or any other kind of management decisions, we will leave that to them.\n\nQ Thank you. I've got a couple of quick things. Are secured bondholders, do they get a hundred percent back? Does the tax lump carry forward, go to the new company? And can you say that there's no negative impact on Ford from these arrangements that you've described? Thank you.\n\nSENIOR ADMINISTRATION OFFICIAL: With respect to the first question, there are no secured bondholders in GM; there are secured banks, and they will receive a full recovery because they are amply secured, as distinct from the banks in Chrysler which were not fully secured.\n\nWith respect to your second question, I'm going to let my colleague answer -- would you expect the transfer? And what was the third question? Oh, Ford.\n\n\n\nSENIOR ADMINISTRATION OFFICIAL: Ford has ample financial resources. Ford has been very successful in maintaining and even growing its market share during this period and is a world-class company, and we do believe completely -- and that has been the President's decision -- the belief that this country can support three domestic successful, viable auto companies.\n\nQ Thanks, guys. A number of the principles -- the governmental principles you've established -- members of Congress have asked GM and the administration to keep the company from importing cars made in Chinese plants. Is that an issue that the administration will specifically stay away from, or will it take a position? Have you made a preference known to GM's management?\n\nSENIOR ADMINISTRATION OFFICIAL: GM has made a commitment in its later agreement with respect to production in North America. But as to any specific thing, no, that would be a kind of specific commercial thing and would not be the object of our negotiation with the company.\n\nQ -- any additional money going into GM beyond the $30.1 billion that you're extending now -- is that an expectation, or are you saying, or will the President say that this is it for GM, this is the extent of taxpayer money and they won't get any additional funding?\n\nSENIOR ADMINISTRATION OFFICIAL: There's no plan of any kind, intention, contingency plan, anything of any kind for further support beyond this point.\n\nQ But beyond not having as plan are you saying that there's no way they will get --\n\nSENIOR ADMINISTRATION OFFICIAL: We believe the support being provided within a framework on a conservative economic assumption should allow the company if stakeholders do what they need to do, if its managers are successful in doing what they need to do, to be commercially viable going forward and not require extraordinary support going forward. One never says never with respect to any hypothetical contingency that could arise in the future, but this is it for support for GM, and on a go forward basis, GM's position will be the same as that of any other company in the United States.\n\nSENIOR ADMINISTRATION OFFICIAL: We are reducing GM's liability by well over 50 percent and providing it with the financial flexibility that we truly believe -- and an enormous amount of work that's been done here that will allow it to be viable even under today's difficult economic circumstances.\n\nQ I just wanted to ask what the sort of anticipated future of the whole task force operation that you all have set up is going to be? And maybe this answers that question, but whether there will be, six months from now or a year from now, some part of the U.S. government that will look after the shares that we will have in the two car companies, if only at a distance?\n\nSENIOR ADMINISTRATION OFFICIAL: There are a number of people around the table who are looking at me with interest in how I answer this. On a go forward from here, moving through this bankruptcy where the government has a major role, there is a great deal to be done, and the staff of the task force will continue to be very active. The Cabinet members who comprise the task force will continue to play their role in providing expertise on a range of issues. On a go-forward basis, the government will obviously adjust its staffing to its needs. But for now, there's plenty to do.\n\nQ As it is now, you guys have folks in Detroit -- I'm not sure what numbers there are. Is it anticipated that you'll continue to have representation on site going forward?\n\nSENIOR ADMINISTRATION OFFICIAL: We don't have anybody in Detroit on any kind of long-term basis. People obviously go out there in the context of diligence. I think we -- in the context of what my colleague said about the government as shareholder, we are shareholders, like a lot of other people who don't control companies. And in that respect, we expect that the taxpayers will want us to monitor their investment and be sure that we understand what's going on, but we're not going to be having people based in Detroit or anything like that.\n\nQ What will the government's position be in terms of executive compensation issues?\n\nSENIOR ADMINISTRATION OFFICIAL: There are a series of laws and other regulations that exist, and the company will comply with all of them.\n\nQ But will you -- you'll have the ability to name the compensation committee. Will you leave it to the compensation committee? Will there be any government policy -- because you have a policy with the banking bailout; I'm wondering if you're going to have any kind of a policy for this industrial company.\n\nSENIOR ADMINISTRATION OFFICIAL: Again, there are a series of policies; there's the Dodd amendment, there will be regulations to implement the Dodd amendment in due course, and the company will live with them. We don't intend to name the compensation committee per se. We intend to, as we said, to work with the company and their initial directors, but the compensation committee will operate on its own. And we assume, just as it has during the period of the loan agreements where there were also compensation restrictions, that it will operate within them.\n\nSENIOR ADMINISTRATION OFFICIAL: And like as in any company, the board will name a compensation committee.\n\nQ Thanks, guys. Just a couple quick questions. Can you talk about the appointment of the chief restructuring officer and about the bad assets that GM will leave behind, even if you're not going to name the plants or the dealers that might be left behind? And also, is the government planning or encouraging any more management changes at GM?\n\nSENIOR ADMINISTRATION OFFICIAL: I think those are all pretty much questions for the company in terms of the naming of the chief restructuring officer is a company decision. The assets that will be left behind will be -- are being chosen, have been chosen by the company, and again we would direct you to them to answer those questions. And in terms of management changes, we have nothing further to announce on that at this time. As I said earlier, Fritz Henderson and other management key members serve at the pleasure of the board. It will be up to the existing board until emergence and then the new board to make any decisions about management.\n\nMS. PSAKI: We have time for one more question.\n\nQ I just wanted to go back to the question of the task force. In terms of the longevity of the task force, do you perceive it being needed well beyond the bankruptcy proceeding itself? I mean, do you perceive the task force being in existence in fact until the company is sold?\n\nSENIOR ADMINISTRATION OFFICIAL: The company is not going to be -- I mean, I'm not sure what you mean by the company being sold. The company will go through this restructuring period; new GM will emerge as part of the 363 process; and then the company will continue, as we said, as a private company operating in the for-profit commercial role and so forth. And the government, as we indicated, is a reluctant -- will be a reluctant shareholder for only as long as is necessary, for as long as -- we will be out as soon as is practicable. During that period of time, we imagine that the taxpayers want us to be looking after their money, and so as we indicated, there will be people here watching over that investment, but as I indicated, in the nature of passive shareholders similar to Fidelity or some other large investment firm that has a large stake in a company.\n\n\n\nMS. PSAKI: Thank you, everyone, for joining the call. As a reminder, this is embargoed until 10:00 p.m. Eastern time.\n\n\n\nEND\n\n7:40 P.M. EDT\n\n", "images": ["https://web.archive.org/web/20090604101517im_/http://www.whitehouse.gov/assets/tout/smc_nt_04.jpg", "https://web.archive.org/web/20090604101517im_/http://www.whitehouse.gov/images/eop/hdr-usa-flag.gif", "https://web.archive.org/web/20090604101517im_/http://statse.webtrendslive.com/dcs0l9nq800000ctek411lue6_2c8b/njs.gif?dcsuri=/nojavascript&WT.js=No&DCS.dcscfg=1&WT.tv=8.6.0", "https://web.archive.org/web/20090604101517im_/http://www.whitehouse.gov/images/eop/clear.gif", "https://web.archive.org/web/20090604101517im_/http://www.whitehouse.gov/assets/images/get_connected_01.jpg", "https://web.archive.org/web/20090604101517im_/http://www.whitehouse.gov/assets/images/home_touts_03.jpg", "https://web.archive.org/web/20090604101517im_/http://www.whitehouse.gov/assets/tout/fy-2010-budget.jpg", "https://web.archive.org/web/20090604101517im_/http://www.whitehouse.gov/assets/tout/bnr_blog.jpg", "https://web.archive.org/web/20090604101517im_/http://www.whitehouse.gov/images/eop/sftr-whgov.gif"], "top_img": "https://web.archive.org/web/20090604101517im_/http://www.whitehouse.gov/assets/tout/bnr_blog.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "Background Briefing on GM Restructuring, May 31, 2009", "meta_data": {"keywords": "President, Barack Obama, White House, United States of America, 44th President, White House history, President Obama, Barck, Barek, Barak, Barrack, Barrak, Obma, Barack", "description": "Thanks, I'll just try to run through this reasonably quickly and maximize the time for questions.  Everyone should have a fact sheet.  I know you've only had it for a short period of time, so let me run through quickly the main points that we wanted to cover."}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}