{"url": "https://ew.com/tv/2018/01/24/max-greenfield-assassination-gianni-versace-new-girl/", "text": "New Girl type TV Show network Fox\n\nOne of the great surprises of The Assassination of Gianni Versace: American Crime Story is the completely transformative performance by New Girl’s Max Greenfield. The actor plays Ronnie, a junkie who befriends Andrew Cunanan (Darren Criss) and is unaware that his new acquaintance is a wanted serial killer.\n\nIn only a handful of scenes, Greenfield creates a full-bodied tragic character — even Ronnie’s walk feels specific and thoughtful. The actor previously worked with executive producer Ryan Murphy on American Horror Story: Hotel, which also found the actor exploring a much darker side than New Girl fans were used to seeing.\n\nEW talked to Greenfield about reuniting with Murphy, crafting his Versace character, and, naturally, Darren Criss’ pink Speedo.\n\nENTERTAINMENT WEEKLY: Was this just the case of Ryan Murphy calling you up and asking you to do this role? How did this come about?\n\nMAX GREENFIELD: Ryan and I keep in touch. He knew that I had finished New Girl, and he knew I was off. We ran into each other and he was like, “What are you doing?” and I was like, “I don’t know, man.” I think I had wrapped that week. He goes, “I wanna show you a couple of things.” And this happened to be one of the things he showed me. He sent me the first two scripts. I went off and looked at it, and I thought it was incredible. I didn’t know that I could do it. I’m certainly not the person that you think of when you would read this on paper. Like, “Oh, that’s a no-brainer!”\n\nSo I put myself on tape for it. I wanted to see if I could do it, and I got to a place where I felt like, “Oh, now I sorta love this guy!” I sent Ryan the tape and I said, “I don’t know if this is any good, but this is what it would look like.” Two and a half weeks later, I was in Miami.\n\nImage zoom Pari Dukovic/FX\n\nDid you lose weight? You look much skinnier, or maybe that was just your psychical performance.\n\nIt was probably a little bit of both. The previous summer I had done The Glass Castle, which was a great experience. But I was supposed to have an arm-wrestling match with Woody Harrelson in the movie. The one note from the director was, “Hey, man, this is a big scene in the movie. I know you’re like a fit guy. Can you not work out as much?” I was like, “I will not touch another weight.” And I didn’t for like a long time, and I ended up losing a lot of size. On New Girl, I’m always like in cardigans, and I just don’t think it really played. But in this, mixed with the fact that I’m like, “Oh, in two weeks I’m going to be in Miami? I don’t have to eat I guess.” But I also think it was the physicality and the buzz cut and the whole thing.\n\nWhat was it about Ronnie that you responded to?\n\nWhat I really loved about him and what I found so heartbreaking about him … I knew he was based on a real guy, but I knew physically we didn’t resemble one another. What I found so heartbreaking about him, and as I started to research the period of the time, but I knew a little bit about — it’s funny when you research something as an actor, you might know about that period of time. But when you’re then asked to come at it from a place of, I’m going to have to play this person, really understanding what 1997 and that the period around that meant for somebody in the LGBT community who has HIV, and the idea that a year and a half earlier they had figured out the correct medication to give patients who had accepted over the past 15-plus years that they were going to die! They watched everybody else around them die — how on earth would it be any different? You hear people who are still living with HIV who lived through that time to this day talk about the fact that they still have difficulty wrapping their head around that tomorrow isn’t going to be my last day? Or this isn’t going to turn on me?\n\nBut what I also loved about Ronnie and what he represented is you can see through Ryan’s other work and Larry Kramer’s work, these people from the ACT UP movement who were like taking it head on. But you never saw the people who gave into it and didn’t fight and just thought, “This is my fate and this is what I deserve.” And I think Ronnie was one of those people, and it broke my heart. I thought, “I love this guy.”\n\nDid you find any comparisons between Ronnie and Gabriel, the character you played on AHS: Hotel?\n\nI think in the sense maybe that these are two guys who were lost. Totally lost.\n\nHow as it working with Darren?\n\nIt was really great. It was intense. As heartbreaking as Ronnie was, part of that heartbreak was his relationship with Andrew and the fact that he was enamored by this guy, and also sort of thinking he had made a friend. He was so alone and thought this was a guy who came to Miami for the same reasons he had. Watching him sort of try to keep up with Andrew and carry on a normal conversation with him like friends might do and listen to this guy who was so all over the place. The humor of that is not lost on me. I mean, there is an element of like, man, this is an odd couple!\n\nWhat was it like when Darren emerged from the bathroom with duct tape on his face?\n\nThe nice thing of a scene like that is they’re not very hard to play! If you’re in character and the scene is “Be freaked out by the guy who walks out of the bathroom with his head wrapped in duct tape,” I’d love to say I’m an incredible actor, but at that point it’s not that hard.\n\nYou also have to spend a fair amount of time staring at Darren in a pink Speedo; was that an odd day at work?\n\nThat is so par for the course on a Ryan show. Honestly, it couldn’t be less weird.\n\nI guess you did previously yank Naomi Campbell through a bed on Hotel.\n\n[The beach scene] was honestly one of the more casual days I’ve ever had on a Ryan set [laughs].\n\nWhy do you and Ryan work so well together?\n\nUm, it’s not me. There’s a couple factors: I really love Ryan. I love what he does. He has set the bar so high for performances on his projects that if you don’t come prepared and ready to go, I don’t know why you’re there. That to me is all I wanna do.\n\nThen, there’s the fun idea, which is like to surprise or excite Ryan, which is really hard to do.\n\nThe third thing, and this really is why it works out so well, is because the people that work for Ryan, his department heads, these people are so astronomically good at their job. If you utilize them as an actor under the umbrella of what Ryan has given us all for who this character is, the next thing you know you have the right clothes on, you have the earring, your hands are dirty, your head is shaved, you have the right mustache. Everything is just right, and you then don’t have to work that hard. To me I think the reason why I’ve been really happy and satisfied and why I think they’ve been successful collaborations is because of the people he surrounds himself with. They’re so good.\n\nNow that New Girl is ending, would you want to be on a Ryan Murphy series?\n\nLook, Ryan is one of those people if I saw his number pop up on my phone, I’d say, “I’ll be at Fox in five minutes.”\n\nWhat can you say about the finale of New Girl?\n\nWhat I love about the season and the way we wrap it up is I equate it to like a rock musician who plays a rock concert and goes, “You know what, you guys? Tonight I’m playing the hits! We’re just gonna play all the songs you love.” I love that they did that. I love what Liz [Meriwether] and the rest of the writers did. I think it’s a real love letter to the fans. It’s all of the greatest hits from seven seasons.\n\nThe Assassination of Gianni Versace: American Crime Story airs Wednesdays at 10 p.m. on FX. New Girl returns for its final season April 10 at 9:30 p.m. ET on Fox.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F13%2Fbetter-call-saul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2Frhbh-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F01%2F9_ronnie_008_re-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F09%2Flennykravitz.jpg%3Fw%3D768", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F115093_46282_b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F09%2FHomeland_810_4979_R.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F115093_48676b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2017%2F11%2Frolestout.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F17%2FNUP_189932_0195.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2FListen-to-Your-Heart.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fewedit.files.wordpress.com%2F2018%2F10%2Fcelebrity-binge.jpg%3Fw%3D768", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2F116494_0767b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-voice-rec.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Frhony.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2064'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2Fdee-rogan-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F12%2Fsnl.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F03%2Fgreys-anatomy-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Fevan-rachel-wood-aaron-paul-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2019%2F12%2Fnew-girl-finale-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F14%2Fthe-challenge-b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F10%2Foutlander-sea5.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F15%2F116400_1225b.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F01%2F9_ronnie_008_re-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F04%2F08%2FRVD417d_0162b.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F01%2F9_ronnie_008_re-2000.jpg", "keywords": [], "authors": ["Tim Stack", "Seija Rankin", "Jodi Walker", "Maureen Lee Lenker", "Andy Hoglund", "Dalton Ross", "Chancellor Agard", "Samantha Highfill", "Sydney Bucksbaum", "James Hibberd"], "canonical_link": "https://ew.com/tv/2018/01/24/max-greenfield-assassination-gianni-versace-new-girl/", "title": "Max Greenfield on Assassination of Gianni Versace, end of New Girl", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Max Greenfield", "news_keywords": "Max Greenfield", "description": "The sitcom star shows his dark side in the FX miniseries", "og": {"title": "Max Greenfield on his haunting 'Assassination of Gianni Versace' role and the end of 'New Girl'", "type": "article", "site_name": "EW.com", "url": "https://ew.com/tv/2018/01/24/max-greenfield-assassination-gianni-versace-new-girl/", "description": "One of the great surprises of The Assassination of Gianni Versace: American Crime Story is the completely transformative performance by New Girl’s Max Greenfield. The&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F01%2F9_ronnie_008_re-2000.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://ew.com/tv/2018/01/24/max-greenfield-assassination-gianni-versace-new-girl/", "description": "The sitcom star shows his dark side in the FX miniseries", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F01%2F9_ronnie_008_re-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/tv/2018/01/24/max-greenfield-assassination-gianni-versace-new-girl/", "title": "Max Greenfield on his haunting 'Assassination of Gianni Versace' role and the end of 'New Girl'", "description": "The sitcom star shows his dark side in the FX miniseries", "site": "@ew", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F01%2F9_ronnie_008_re-2000.jpg"}, "fb": {"app_id": 2485718348341688, "pages": 52150999700}, "article": {"opinion": "false"}}, "movies": [], "publish_date": 1516723200.0, "source": "https://ew.com", "summary": ""}