{"url": "http://seuss.wikia.com/wiki/Cindy_Lou_Who", "text": "“ It was Little Cindy Lou Who, who was no more than two. The Grinch had been caught by this tiny Who daughter. ” Description\n\nCordelia Louinda \"Cindy Lou\" Who is a sweet little girl from Dr. Seuss' storybook How the Grinch Stole Christmas!. She serves as the tritagonist in the 2000 film adaption.\n\nShe was a six-year-old Who girl who lives in Whoville and plays a main role in the story in the storybook.\n\nIn 1966, she was voiced by the late June Foray. In 2000, she was portrayed by Taylor Momsen in the live action film of the same name, in which she has more role than her cartoon version.\n\nIn 2018, she appears in the computer animated remake (18 years since the Jim Carrey film), where she is voiced by Cameron Seely who was in the movie The Greatest Showman.\n\nContents show]\n\nBroadway Musical\n\nIn the musical, Cindy Lou can be from six to twelve years old. She has four siblings: Boo Who, Danny Who, Betty Lou Who and Annie Who. She first appears in It's The Thought, Who Likes Christmas, I Hate Christmas Eve and Whatchamo.\n\nShe's clearly different from the other children dressed in red and white while she wears a pink gown. On Christmas Eve, she wakes up to meet the Grinch when she sings Santa For A Day with the Grinch.\n\nShe's played by two little girls every Winter at the Olde Globe in San Diego. She was first portrayed by Vanessa Hudgens.\n\n1966 film\n\nIn the original book and the animated adaptation, Cindy Lou Who comes out of bed for a drink of water when she finds the Grinch, disguised as Santa Claus, stuffing her family's Christmas tree up the chimney.\n\nMistaking him for Santa, she innocently asks him why he's taking the tree. The Grinch, sensing innocence in the young girl, covers up his theft by lying to her, saying that there’s a broken light on the tree and that he was taking it to \"his workshop\" to fix the problem and then return it on Christmas Day when she wakes up.\n\nThen, the Grinch gets her a cup of water and sends her back to bed, showing the only legitimate kindness that he has in his small heart.\n\nNotably, though this is her only real scene in the original book, Cindy Lou gets a bit more screen time in the animated adaptation.\n\nLive Action\n\nSee Cindy Lou Who (Live-Action)\n\n2018 Film\n\nThis version of Cindy Lou Who is different than her 1966 and 2000 version. For example, Cindy-Lou Who plots to capture Santa Claus to thank him for helping her widowed mother and her baby brothers every Christmas, something which will interfere with the Grinch's plans. She’s voiced by Cameron Seely, sounding exactly the way the late June Foray made her in the original classic 1966 film.\n\nAppearance\n\nShe has blonde hair, blue eyes & thick, wiry antennae in her cartoon version than in the book.\n\nRelationship\n\nThe Grinch\n\nWhen Cindy Lou first met The Grinch at the post office, they didn't get along because The Grinch thought that Cindy is just like the other Whos who only care about presents which she doesn't.\n\nEven though he did save her from the stamping machine, he just didn’t want to admit that he only did that because he cared about her safety. Then, Cindy Lou decide to asks everyone what they know about him and soon discovers that he has a sad past.\n\nLater, Cindy Lou met the Grinch again after she found that the only reason he hated Christmas is because he had a tragic past and Cindy thought he was funny and wasn’t afraid of him which it upset him, but the Grinch decides to go to the celebration for her sake.\n\nAs the movie continued, the Grinch went bad, got revenge, stole Christmas and realized what he had done after realizing that Christmas isn't about presents, but spending time with your loved ones.\n\nAt the end, he returns the gifts and gets a kiss on the cheek from Cindy who cared about him. Then, they become best friends as the movie ends.\n\nHer Family\n\nCindy Lou loves her parents and brothers, but she believes that everyone is missing the point about Christmas by being more concerned about the gifts and festivities.\n\nAfter meeting The Grinch and know that he has a dark past which she feels bad for him since he was bullied by The Mayor and the other Who kids. So she decides to bring The Grinch back to Whoville and make everybody include The Grinch to show them what Christmas really about.\n\nDuring the celebration, her mother was lost at the light contest (deleted scene) and soon The Grinch came late, having fun and almost woo his childhood crush Martha May Whovier. The Mayor gives him an electric shaver as a present, reminding him of his painful humiliation at school.\n\nMay Who then asks Martha to marry him, promising her a new car in return. This causes the Grinch to openly berate the Whos for thinking that Christmas is about gifts that they will just dispose of later, in the hopes of making them too ashamed to celebrate the holiday.\n\nHe then goes on to ruin the celebration by burning the Christmas tree with a makeshift flamethrower (although his actions prove fruitless as the Who's have a spare tree which the Grinch sees them erect before he leaves).\n\nAfter the gifts were stolen by The Grinch, the mayor and everybody blame Cindy for ruin Christmas by letting the Grinch come to Whoville which it hurts her feelings until her father stand up for her and finally realized that Christmas isn't about gifts, but spending time with your love ones and know that Cindy was right about Christmas and knowing the true nature of The Mayor.\n\nWhile her family singing, Cindy went to Mt. Crumpit and wants to tell The Grinch about Christmas.\n\nThen she was looking for him, but decides to go in the sled and saw him by saying hi to The Grinch to his surprise The Grinch that she came all the way up Mt. Crumpit to see him and tell him that no one shouldn't be alone on Christmas. (It means that she always cared about him)\n\nThen she smiles at The Grinch which it make The Grinch very happy that she does care about him until she was in danger of falling off the cliff with the sleigh, the Grinch finds enough strength to lift the sleigh, the gifts and Cindy Lou to safety.\n\nAfter a long descent down Mount Crumpit, the Grinch returns to Whoville with Cindy and the gifts. He confesses to the burglary, apologizes for his actions towards the Whos and turns himself in to the police as they arrive, but the Whos reconcile with him, much to May Who's dismay.\n\nMartha turns down May Who's proposal and says that her heart belongs to the Grinch instead. The redeemed Grinch starts a new life with the Whos, commemorating the Christmas feast with them in his cave.\n\nTrivia\n\nShe was the first Who (other than Martha May Whovier) who wasn't afraid and didn’t hate the Grinch. She just knows that the Grinch is sweet and has a good side.\n\nCindy Lou was afraid of the Grinch at first until she realized that he had a dark past and tries to help him by becoming his friend.\n\nCindy Lou was the Grinch's first best friend along with his dog, Max in the live action movie.\n\nGallery\n\nSee Also", "images": ["https://vignette.wikia.nocookie.net/seuss/images/c/cb/Cindy_2.PNG/revision/latest/scale-to-width-down/124?cb=20181125194712", "https://slot1-images.wikia.nocookie.net/__cb1586975593232/common/extensions/wikia/WikiaBar/images/wikiabarIcon.png", "https://vignette.wikia.nocookie.net/seuss/images/8/89/Wiki-wordmark.png/revision/latest?cb=20180301161409", "https://vignette.wikia.nocookie.net/rockosmodernlife/images/a/ad/Static_Cling_Netflix_banner.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20191126160900", "https://vignette.wikia.nocookie.net/seuss/images/d/dd/8b456641134b178fabfcd793398e1191.jpg/revision/latest/scale-to-width-down/128?cb=20151201012542", "https://vignette.wikia.nocookie.net/seuss/images/5/55/41-413200_cindy-lou-who-by-yesenia62702-on-deviantart-cindy.png/revision/latest/scale-to-width-down/143?cb=20200229225429", "https://vignette.wikia.nocookie.net/seuss/images/1/1d/Il_570xN.265694722.jpg/revision/latest/scale-to-width-down/139?cb=20151203232643", "https://vignette.wikia.nocookie.net/seuss/images/e/e4/005397b2-fcc0-4ab4-b38f-d7629f296b56.jpg/revision/latest/scale-to-width-down/185?cb=20151201022627", "https://vignette.wikia.nocookie.net/seuss/images/9/99/7186138658_4488232875_b.jpg/revision/latest/scale-to-width-down/134?cb=20151201022952", "https://vignette.wikia.nocookie.net/seuss/images/8/8c/Grinch-stole-christmas4.jpg/revision/latest/scale-to-width-down/282?cb=20120215002236", "https://vignette.wikia.nocookie.net/wubbzy/images/7/7e/Me_and_My_Friends_-_128.png/revision/latest/zoom-crop/width/100/height/56?cb=20180423181936", "https://vignette.wikia.nocookie.net/seuss/images/8/8c/Grinch-stole-christmas4.jpg/revision/latest?cb=20120215002236", "https://vignette.wikia.nocookie.net/seuss/images/6/6e/Cindy-lou-who-2018.png/revision/latest/scale-to-width-down/143?cb=20180514060708", "https://vignette.wikia.nocookie.net/seuss/images/b/b3/CindyLouWho.jpg/revision/latest/scale-to-width-down/185?cb=20151201022800", "https://vignette.wikia.nocookie.net/seuss/images/c/c5/The_Grinch_holding_Cindy.jpg/revision/latest/scale-to-width-down/87?cb=20151130204741", "https://vignette.wikia.nocookie.net/seuss/images/3/30/46235656_2241102869470091_2735146594134392832_n.jpg/revision/latest/scale-to-width-down/90?cb=20181125194611", "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D", "https://vignette.wikia.nocookie.net/seuss/images/9/9d/Lashette%2Bcindy.jpg/revision/latest/scale-to-width-down/99?cb=20200229234059", "https://vignette.wikia.nocookie.net/seuss/images/7/7b/Cindy-lou-who.gif/revision/latest/scale-to-width-down/185?cb=20151201022554", "https://vignette.wikia.nocookie.net/seuss/images/6/66/Thegrinch2018goldenbook.jpg/revision/latest/scale-to-width-down/155?cb=20180917000655", "https://vignette.wikia.nocookie.net/seuss/images/8/8f/Cindy_Lou_Who.jpg/revision/latest/scale-to-width-down/103?cb=20160826215523", "https://vignette.wikia.nocookie.net/seuss/images/c/c8/Cindy_3.PNG/revision/latest/scale-to-width-down/126?cb=20181125193248", "https://vignette.wikia.nocookie.net/seuss/images/2/2b/0f98f8c0f95ad0223bf498e43ae002ad.jpg/revision/latest/scale-to-width-down/108?cb=20151201012715", "https://vignette.wikia.nocookie.net/seuss/images/a/a6/Grinch_pats_cindy_on_the_head.jpg/revision/latest/scale-to-width-down/185?cb=20151201022832", "https://vignette.wikia.nocookie.net/101dalmatianstreet/images/0/0e/Community-header-background/revision/latest/zoom-crop/width/100/height/56?cb=20200106151802"], "top_img": "https://vignette.wikia.nocookie.net/seuss/images/8/8c/Grinch-stole-christmas4.jpg/revision/latest?cb=20120215002236", "keywords": [], "authors": [], "canonical_link": "https://seuss.fandom.com/wiki/Little_Cindy-Lou_Who", "title": "Little Cindy-Lou Who", "meta_data": {"viewport": "width=device-width, user-scalable=yes", "generator": "MediaWiki 1.19.24", "keywords": "Dr. Seuss Wiki,seuss,Little Cindy-Lou Who,Little Cindy-Lou Who,Taylor Momsen,How the Grinch Stole Christmas! (Film),How the Grinch Stole Christmas! (TV Special),Dr. Seuss' The Grinch,Cameron Seely,Cindy Lou Who (Live-Action),How the Grinch Stole Christmas!,How the Grinch Stole Christmas! (Book),June Foray", "description": "Description Cordelia Louinda &quot;Cindy Lou&quot; Who is a sweet little girl from Dr. Seuss' storybook How the Grinch Stole Christmas!. She serves as the tritagonist in the 2000 film adaption.", "twitter": {"card": "summary", "site": "@getfandom", "url": "https://seuss.fandom.com/wiki/Little_Cindy-Lou_Who", "title": "Little Cindy-Lou Who | Dr. Seuss Wiki | Fandom", "description": "Description Cordelia Louinda \"Cindy Lou\" Who is a sweet little girl from Dr. Seuss' storybook How the Grinch Stole Christmas!. She serves as the tritagonist in the 2000 film adaption."}, "fb": {"app_id": 112328095453510}, "og": {"type": "article", "site_name": "Dr. Seuss Wiki", "title": "Little Cindy-Lou Who", "description": "Description Cordelia Louinda \"Cindy Lou\" Who is a sweet little girl from Dr. Seuss' storybook How the Grinch Stole Christmas!. She serves as the tritagonist in the 2000 film adaption.", "url": "https://seuss.fandom.com/wiki/Little_Cindy-Lou_Who", "image": "https://vignette.wikia.nocookie.net/seuss/images/8/8c/Grinch-stole-christmas4.jpg/revision/latest?cb=20120215002236"}, "apple-itunes-app": "app-id=422467074, app-arguments=https://seuss.fandom.com/wiki/Little_Cindy-Lou_Who"}, "movies": [], "publish_date": null, "source": "http://seuss.wikia.com", "summary": ""}