{"url": "https://people.com/music/whitney-houstons-mother-expresses-horror-over-new-claim-the-singer-was-molested-by-dee-dee-warwick/", "text": "It’s been nearly two months since the new documentary Whitney debuted at Cannes on May 16, making public a shocking claim that the late superstar was molested as a child by Dee Dee Warwick, her cousin and Dionne Warwick’s sister.\n\nNow Whitney’s mother Cissy Houston is breaking her silence on the painful allegation. In this week’s PEOPLE cover story she speaks out for the first time, on behalf of herself and niece Dionne Warwick, sharing their “horror” about the claim made by Whitney’s longtime assistant Mary Jones.\n\nGet push notifications with news, features and more.\n\nJones says in the film that Whitney confided in her, revealing that as a child she had been sexually abused by Dee Dee. Whitney’s brother Gary also claims in the film that he was molested by Dee Dee between the ages of 7 and 9.\n\nRELATED: Whitney Houston’s Mother Expresses ‘Horror’ Over Claims Singer Was Molested by Dee Dee Warwick\n\nImage zoom Whitney Houston; Dee Dee Warwick Rex/Shutterstock (2)\n\nFor more on Whitney Houston’s shocking untold story, pick up this week’s issue of PEOPLE on newsstands Friday.\n\nWhile Jones stands by her decision to air the allegation in the film, Cissy, in conjunction with her niece Dionne, has issued the following emotional statement, revealing their deep concerns about the claim, and the film as a whole.\n\nCissy Houston and Dionne Warwick’s full statement:\n\nMy niece Dionne Warwick and I make this statement to raise our voices above the din surrounding the release of the film, Whitney. Although the film is marketed as a Houston Family approved/endorsed project, neither my son, Michael, Dionne nor I knew of the allegations of abuse, the direction the film would take, until two days before the screening at Cannes.\n\nTo begin we want to state clearly that the horror of what victims of sexual abuse experience is unimaginable. We make no attempt to minimize the pain, the trauma and perhaps lifelong damage to the psyche of abuse victims. We understand and acknowledge that there are no rules governing a person’s reaction to trauma and every person reacts differently. By this statement we do not intend to defend, condone or excuse the crime of molestation.\n\nImage zoom Cissy and Whitney Houston ABC Photo Archives/Getty Images\n\nRELATED: Whitney Houston Sings to a Young Bobbi Kristina in Exclusive Clip from New Documentary\n\nWe cannot, however, overstate the shock and horror we feel and the difficulty we have believing that my niece Dee Dee Warwick (Dionne’s sister) molested two of my three children.\n\nI’ve been told—as justification for the invasive theme of this film—that Whitney was a public person and therefore the public has a right to know any and everything about her. I say, NO, she was a famous person … a singer, an actress, a quiet but generous philanthropist. She wasn’t running for office, asking for money or trying to win the right to run anyone’s life. Her job does not entitle the “public” to know every intimate detail of her life beyond what she herself revealed during her lifetime. Although she spoke about her struggle with drugs, the interventions, her daughter Krissi and issues in her marriage, she never PUBLICLY spoke about her father’s stealing from her or revealed any claim that she had been molested. IF she was molested I do not believe she would have wanted it to be revealed for the first time to thousands, maybe millions of people in a film.\n\nI know the woman who was identified as Whitney’s “close confidante”. If she was my daughter’s “close confidante” it would seem she chose to betray Whitney’s confidence by publicizing rumors and hearsay. In any case Dionne, Michael and I do not know her the way we knew and loved Dee Dee Warwick. Dee Dee may have had her personal challenges but the idea that she would have molested my children is overwhelming and for us unfathomable. We cannot reconcile the Public’s need to know about Whitney’s life as justification for invasion of her privacy or the charge against Dee Dee, a charge which neither Whitney nor Dee Dee is here to deny, refute or affirm. Neither I, Dionne, nor my son Michael who was very close to his sister, and in the film is VERY candid about their drug use, has ever heard these allegations; we have never heard anything remotely connected to the crimes charged against Dee Dee in the film. How can that be fair to my daughter, to Dee Dee, or to our family?\n\nI spent many years in recording studios (sometimes with Dionne and/or Dee Dee) where I earned my living. I also went “on the road” with my group The Sweet Inspirations to try to help provide a good life for my family BUT my children always came first in my heart and in my life. When I was away they did not stay with four or five different families; they stayed at home where their longtime babysitter, Phyllis, or my dear friend Bae or their father took care of them. In all the years I traveled Dee Dee, who was 21 years older than Whitney, NEVER BABYSAT for them.\n\nImage zoom Cissy and Whitney Houston Jack Vartoogian/Getty\n\nRELATED VIDEO: Whitney Houston’s Cousin Slams Kanye West for Using Photo of Her Drug-Covered Bathroom\n\nDionne’s mom, my oldest sister Lee, was there for me after my mother died when I was eight years old, and during some of the darkest times of my young life. Lee died several years ago and although I miss her every day I am comforted by the knowledge that she is not here to live this experience\n\nHow I wish I could ask Dee Dee and Nippy what happened, but this film distinguishes itself from the other films about her by spreading rumor, innuendo and hearsay; leaving questions to which I’ll never have the answers.\n\nRELATED: Jada Pinkett Smith Shares Throwback Photo with ‘Fierce’ Friend Whitney Houston: ‘You Are Missed’\n\nDionne and I are part of a family whose members have always worked hard for themselves and their children to be successful. The goal of most parents is to help their children achieve more than they did. The film treats my family’s aspirations with the heavy handedness of people who are viewing an African American family through a lens lacking in cultural sensibilities. Like most parents we gave our children names we liked … Gary Joseph, Michael Blair and our longed-for baby girl, Whitney Elizabeth, not for any other reason. We did not name our daughter because it was the name of a character in a “WHITE SITCOM” or because we were striving to be considered middle class as alleged in the film. I loved the name Whitney and Elizabeth was her grandmother’s name.\n\nImage zoom Whitney Houston as a child REX/Shutterstock\n\nI am heartbroken that despite all she accomplished fans and haters alike are left with the notion that she lived her life as a victim. She made mistakes and in the last few years she did live her life in the grip of the drugs that drove her and all the consequences of that, both as a woman and as a mother. She loved Krissi with all her heart and she did the best she could as Krissi’s mother, but being in a struggle with drugs is inconsistent with being a great mother. She faced challenges in her life, exacerbated by fame, divorce and family issues but she was not a victim.\n\nAfter people have seen the film they will draw their own conclusions and we are not trying to change that. We just want people to know there is another side. While the filmmakers certainly had the legal right to make this film, I wonder at the moral right.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fwhitney-split-story-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fwhitney-cissy-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fwhitney-young-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fgettyimages-139039771-1-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1333&h=698&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fgettyimages-139039771-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F18%2Fusa418.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1333&h=698&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fgettyimages-139039771-1-2000.jpg", "keywords": [], "authors": ["Janine Rubenstein", "Liz Mcneil"], "canonical_link": "https://people.com/music/whitney-houstons-mother-expresses-horror-over-new-claim-the-singer-was-molested-by-dee-dee-warwick/", "title": "Whitney Houston's Mom Cissy Calls Molestation Claims 'Unfathomable'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Movie News,Music News,News,Rollout,Whitney Houston,Whitney Houston 1963-2012", "news_keywords": "Movie News,Music News,News,Rollout,Whitney Houston,Whitney Houston 1963-2012", "description": "Cissy Houston and Dionne Warwick reveal \"the shock and horror\" and disbelief they feel about the claim Whitney Houston was molested by family member Dee Dee Warwick.", "og": {"title": "Read Whitney Houston's Mom Cissy's Emotional Statement About Molestation Claims", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/music/whitney-houstons-mother-expresses-horror-over-new-claim-the-singer-was-molested-by-dee-dee-warwick/", "description": "It’s been nearly two months since the new documentary Whitney&nbsp;debuted at Cannes on May 16, making public a shocking claim that the late superstar was&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1333&h=698&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fgettyimages-139039771-1-2000.jpg", "width": 1333, "height": 698}}, "pinterest": {"url": "https://people.com/music/whitney-houstons-mother-expresses-horror-over-new-claim-the-singer-was-molested-by-dee-dee-warwick/", "description": "Cissy Houston and Dionne Warwick reveal \"the shock and horror\" and disbelief they feel about the claim Whitney Houston was molested by family member Dee Dee Warwick.", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fgettyimages-139039771-1-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/music/whitney-houstons-mother-expresses-horror-over-new-claim-the-singer-was-molested-by-dee-dee-warwick/", "title": "Read Whitney Houston's Mom Cissy's Emotional Statement About Molestation Claims", "description": "Cissy Houston and Dionne Warwick reveal \"the shock and horror\" and disbelief they feel about the claim Whitney Houston was molested by family member Dee Dee Warwick.", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1333&h=698&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F07%2Fgettyimages-139039771-1-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}