{"url": "en.wikipedia.org/wiki/Jennifer_Aniston", "text": "American television and film actress\n\nJennifer Joanna Aniston (born February 11, 1969) is an American actress, film producer, and businesswoman. The daughter of actors John Aniston and Nancy Dow, she began working as an actress at an early age with an uncredited role in the 1987 film Mac and Me. Her first major film role came in the 1993 horror comedy Leprechaun. Since her career grew in the early 1990s, Aniston has been one of the highest-paid actresses in Hollywood.\n\nAniston rose to international fame portraying Rachel Green on the television sitcom Friends (1994–2004), for which she earned Primetime Emmy, Golden Globe, and Screen Actors Guild awards. The character became widely popular and was described as one of the greatest female characters in American television history. Aniston has since played starring roles in numerous dramas, comedies and romantic comedies. Her biggest box office successes include the films Bruce Almighty (2003), The Break-Up (2006), Marley & Me (2008), Just Go with It (2011), Horrible Bosses (2011), and We're the Millers (2013), each of which grossed over $200 million in worldwide box office receipts. Some of her most critically acclaimed film roles include Office Space (1999), The Good Girl (2002), Friends with Money (2006), Cake (2014), and Dumplin' (2018). She returned to television in 2019, producing and starring in the Apple TV+ drama series The Morning Show, for which she won another Screen Actors Guild Award.\n\nAniston has been included in numerous magazines' lists of the world's most beautiful women. Her net worth is estimated to be US$200 million. She is the recipient of a star on the Hollywood Walk of Fame. Aniston is also the co-founder of the production company Echo Films, established in 2008. Divorced from actor Brad Pitt, to whom she was married for five years, Aniston is also separated from actor Justin Theroux, whom she married in 2015.\n\nEarly life\n\nAniston was born on February 11, 1969, in the Los Angeles neighborhood of Sherman Oaks,[4][5] the daughter of Greek-born actor John Aniston and actress Nancy Dow.[4] One of her maternal great-grandfathers, Louis Grieco, was from Italy.[6] Her mother's other ancestry includes English, Irish, Scottish, and a small amount of Greek.[7] Aniston has two half-brothers: John Melick, her older maternal half-brother, and Alex Aniston, her younger paternal half-brother.[4] Aniston's godfather was actor Telly Savalas, one of her father's best friends.[4][8]\n\nAs a child she moved to New York City.[4] Despite her father's television career she was discouraged from watching television, though she found ways around the prohibition. When she was six, she began attending a Waldorf school.[9] Her parents split up when she was nine years old.[10]\n\nHaving discovered acting at age 11 at the Waldorf school,[10] Aniston enrolled in Manhattan's Fiorello H. LaGuardia High School of Music & Art and Performing Arts, where she joined the school's drama society;[11] Anthony Abeson was her drama teacher.[12] She performed in The Sign in Sidney Brustein's Window by Lorraine Hansberry and Three Sisters by Anton Chekhov.[13]\n\nCareer\n\nBeginnings (1988–1993)\n\nAniston first worked in Off-Broadway productions such as For Dear Life and Dancing on Checker's Grave,[4] and supported herself with part-time jobs which included working as a telemarketer, waitress, and bike messenger.[4] In 1988, she had an uncredited minor role in the critically panned sci-fi adventure film Mac and Me. The next year she appeared on The Howard Stern Show as a spokesmodel for Nutrisystem,[14] and moved back to Los Angeles.[15]\n\nShe obtained her first regular television role on Molloy in 1990, and appeared in Ferris Bueller, a television adaptation of the 1986 film Ferris Bueller's Day Off; both series were quickly canceled. She starred as a teenager going to summer camp in the made-for-television film Camp Cucamonga (1990), and as a spoiled daughter followed by a vengeful leprechaun in the horror film Leprechaun (1993).[16] A 2014 retrospective from Entertainment Weekly identified Leprechaun as her worst role,[17] and Aniston herself has expressed embarrassment over it.[18]\n\nAniston also appeared in two more failed television comedy series, The Edge and Muddling Through,[19] and guest-starred in Quantum Leap, Herman's Head, and Burke's Law.[20][21]\n\nFriends and breakout (1994–2004)\n\nDepressed over her four unsuccessful television shows, Aniston approached Warren Littlefield at a Los Angeles gas station asking for reassurance. The head of NBC entertainment encouraged her to continue acting, and a few months later helped cast her for Friends,[22][19] a sitcom that was set to debut on NBC's 1994–1995 fall lineup. The producer originally wanted Aniston to audition for the role of Monica Geller,[23] but Courteney Cox was considered more suitable. Thus, Aniston was cast as Rachel Green. She was also offered a spot as a featured player on Saturday Night Live, but turned it down to do Friends.[24] She played Rachel until the show ended in 2004.\n\nThe program was successful and Aniston, along with her co-stars, gained worldwide recognition among television viewers. Her character was widely popular and was later recognized as one of the greatest female characters in American television.[25][26] The actress received five Primetime Emmy Award nominations (two for Supporting Actress, three for Lead Actress), including a win for Lead Actress.[27] She was also nominated for two Golden Globe Awards and won in 2003 as Best Actress – Television Series Musical or Comedy. According to the Guinness Book of World Records, Aniston (along with her female co-stars) became the highest-paid television actress of all time with her $1 million-per-episode paycheck for the final season of Friends.[28] Her character's relationship with Ross Geller, portrayed by David Schwimmer in the show, was widely popular among audiences, and the couple was frequently voted as television's favorite couple in polls and magazines.[29]\n\nFollowing a four-year hiatus, Aniston returned to film work in 1996, when she performed in the ensemble cast of romantic comedy She's the One.[30] Aniston's first starring vehicle was Picture Perfect (1997), in which she played a struggling young advertising executive opposite Kevin Bacon and Jay Mohr. While the film received mixed reviews, it was a moderate commercial success,[31] and Aniston's performance was more warmly received, with many critics suggesting that she had screen presence.[32] In 1998, she appeared as a woman who falls for a gay man (played by Paul Rudd) in the romantic comedy The Object of My Affection,[33] and the next year she starred as a restaurant waitress in the cult film Office Space.[34]\n\nShe starred in the independent dramedy The Good Girl (2002) as an unglamorous cashier who cheats on her husband. The film was a commercial success in limited release, taking in over $14 million in North America.[35] Film critic Roger Ebert declared it her breakthrough:\n\nAfter languishing in a series of overlooked movies that ranged from the entertaining Office Space to the disposable Picture Perfect, Jennifer Aniston has at last decisively broken with her Friends image in an independent film of satiric fire and emotional turmoil. It will no longer be possible to consider her in the same way.[36]\n\nAniston's biggest commercial success in film has been the comedy Bruce Almighty (2003), in which she played the girlfriend of a television field reporter (Jim Carrey) offered the chance to be God for one week.[37] With a worldwide box office gross of $484 million,[38][39] the film was the fifth-highest-grossing big screen production of the year.[40] Aniston next starred as the old classmate of a tightly-wound newly-wed in the romantic comedy Along Came Polly (2004), opposite Ben Stiller,[41] which placed number one at the North American box office, earning $27.7 million in its opening weekend;[42] it eventually made $172 million globally.[43]\n\nContinued film success (2005–2013)\n\nIn 2005, Aniston appeared as an alluring woman having an affair with an advertising executive in the thriller Derailed, and as an obituary and wedding announcement writer in the romantic comedy Rumor Has It.[44][45] Both films were moderate box office hits.[46][47] Aniston took on the role of a single, cash-strapped woman working as a maid in the independent drama Friends with Money (2006), which received a limited release.[48]\n\nHer next film was the romantic comedy The Break-Up (2006), alongside Vince Vaughn, in which she starred as one half of a couple having a complicated split when both refuse to move out of the pair's recently purchased home. It received mixed reviews but grossed approximately $39.17 million during its opening weekend and $204 million worldwide.[49] The A.V. Club's Keith Phipps gave the film a negative review, stating, \"It's like watching the 'we were on a break' episode of Friends stretched to feature length, and without the blessed relief of commercial breaks or the promise of Seinfeld around the corner.\"[50] CinemaBlend gave the film a positive review stating, \"In an era of formulaic romantic movies that bear no resemblance to reality, The Break-Up offers a refreshing flipside.\"[51]\n\nIn 2006, Aniston directed the short film Room 10, set in a hospital emergency room and starring Robin Wright and Kris Kristofferson, as part of Glamour's Reel Moments film series.[52] She noted that she was inspired to direct by actress Gwyneth Paltrow, who also directed a short film that year.[53] In 2007, Aniston guest-starred in an episode of Dirt—playing the rival of Courteney Cox's character[54]—and in an episode of 30 Rock, playing a woman who stalks Jack Donaghy.[55] For the latter she received a Primetime Emmy Award nomination as Outstanding Guest Actress in a Comedy Series.[56]\n\nThe 2005 comedy drama Marley & Me, with Aniston and Owen Wilson as the owners of the titular dog, set a record for the largest Christmas Day box office sales ever with $14.75 million. It earned a total of $51.7 million over the four-day weekend and placed number one at the box office, a position it maintained for two weeks.[57] The total worldwide gross was $242.7 million.[58] Her next film in wide release, the romantic comedy He's Just Not That into You (2009), in which she starred opposite Ben Affleck, grossed $178.8 million globally[59] and ranked number one at the United States box office for its opening weekend.[60] While it received mixed reviews, Aniston, along with Affleck, Ginnifer Goodwin, and Jennifer Connelly, were praised by critics as stand-outs in the film.[61][62]\n\nAniston appeared as the former wife of a bounty hunter (Gerard Butler) in the romantic comedy action film The Bounty Hunter (2010). The film was panned by critics, with The Hollywood Reporter writing that \"the mishmash ends up as a thoroughly unfunny adult cartoon.\"[63] Nevertheless, it was a box office success, garnering over $130 million worldwide.[64] A lukewarm box office reception greeted her next film, the romantic comedy The Switch (2010), in which she starred with Jason Bateman as a 30-something single woman who decides to have a child using a sperm bank. The film's opening weekend drew what The Hollywood Reporter dubbed \"a dispiriting $8.4 million.\"[65] The film received generally mixed reviews, with review site Metacritic showing 13 out of 30 critics delivering a positive verdict.[66]\n\nIn 2010, Aniston was also a guest star on the season two premiere of ABC's sitcom Cougar Town, playing a psychiatrist.[67] Her announcement that she would appear on Cougar Town garnered excitement and was dubbed her return to television. The A.V. Club wrote, \"[her role is] is a funny bit, and it highlights just how much Jennifer Aniston is built to be a TV star.\"[68][69][70] In 2011, she starred opposite Adam Sandler as an office manager posing as the wife of a plastic surgeon in the romantic comedy Just Go with It,[71][72][73] and played a sexually aggressive dentist in Horrible Bosses.[74] Just Go with It and Horrible Bosses both made over $100 million in North America and $200 million worldwide.[75][76]\n\nAniston appeared in the comedy Wanderlust (2012) with Paul Rudd,[77] with whom she acted in The Object of My Affection and also Friends, as a married couple who join a commune after losing their money and deciding modern life is not for them.[78] The script for Wanderlust, bought by Universal Pictures,[79] was produced by Judd Apatow.[80][81] Wanderlust received positive reviews but was a box office failure, grossing only $21 million worldwide, against a production budget of $35 million.[82] Aniston starred as a struggling stripper who agrees to pose as a wife for a drug deal, with Jason Sudeikis, in We're the Millers (2013). The film received mixed reviews from critics,[83] but was a financial success, grossing $269 million against a budget of $37 million.[84]\n\nRecent roles and return to television (2014–present)\n\nAniston played the role of a stoic socialite who becomes the target of an ill-planned kidnapping plot in Life of Crime (2014), a film adaptation of Elmore Leonard's 1978 novel The Switch.[85] The film was released in limited theaters, to positive reviews.[86] Catherine Shoard of The Guardian described her performance as \"endearingly comic\"[87] and Eric Kohn of Indie Wire wrote that \"Aniston tops any of her recent performances with a spirited turn that harkens back to her neurotic days on Friends.\"[88] She also reprised her role for Horrible Bosses 2 (2014).[89]\n\nIn Cake (2014), Aniston starred as an astringent woman named Claire Simmons who struggles with chronic pain.[90] The film received mixed reviews; however, Aniston's performance was highly praised, dubbed by some critics as \"Oscar-worthy.\"[91][92][93][94] The Toronto International Film Festival called her performance \"heartbreakingly good\",[95] Gregory Ellwood of HitFix stated, \"It's really on most people's radar for being a rare dramatic turn for Jennifer Aniston, and she doesn't disappoint.\" He further stated, \"Aniston makes you believe in Claire's pain. She makes you believe this character is at her lowest point and only she can pull herself out of it. ... It's a complete performance from beginning to end and she deserves the appropriate accolades for it.\"[96] For her portrayal, Aniston was nominated for the Critics' Choice Movie Award for Best Actress, Golden Globe Award for Best Actress in a Motion Picture – Drama, and SAG Award for Outstanding Performance by a Female Actor in a Leading Role.[97][98]\n\nHorrible Bosses in 2011 Aniston at the London premiere ofin 2011\n\nIn 2015, Aniston starred as a reluctant therapist in the screwball comedy She's Funny That Way,[99] which received mixed reviews and found a limited release in theaters, but her performance was once again noticed. Wesley Morris of Grantland called her \"one of the great screen comedians. ... Most of her scenes here are extraneous, but her vulgarity and tartness are so sharp that the movie needs them. ... This isn't just Aniston having the best stuff. It's her having the most fun with her talent. She's funny in every way.\"[100] She was \"one of the film's few bright spots\" for Lou Lumenick from The New York Post.[101]\n\nAniston starred as the recently divorced mother of two children in the romantic comedy Mother's Day (2016), directed by Garry Marshall, and opposite Julia Roberts and Kate Hudson.[102] The film was panned by critics and a moderate commercial success.[103] In 2016, she voiced a workaholic and overprotective mother in the animated film Storks, alongside Andy Samberg and Kelsey Grammer,[104] which was released to mostly positive reviews; it grossed over $183.4 million with a $70 million budget.[105][106] Her last 2016 film role was that of a frigidly cold head honcho of a company in the comedy Office Christmas Party, directed by Josh Gordon and Will Speck and opposite Jason Bateman and Kate McKinnon.[107] It made $114.5 million globally.[108]\n\nIn The Yellow Birds, a war drama directed by Alexandre Moors, Aniston portrays the mother of a deceased soldier, alongside Alden Ehrenreich, Tye Sheridan, Jack Huston, and Toni Collette.[109] While she said she does not \"normally gravitate toward being in war films\", she made an exception because the film was \"written so beautifully and in such a way [she] had never experienced\".[110] The film, first presented during the 2017 Sundance Film Festival, received a VOD release in June 2018.[111] The Los Angeles Times wrote in its review: \"Toni Collette and Jennifer Aniston as the soldiers' quite different but equally concerned mothers, deliver uniformly naturalistic performances\".[112]\n\nIn December 2018, Netflix released the musical comedy Dumplin', with Aniston as executive producer and star—marking her first project for a streaming service.[113] That year, she began work on two more Netflix projects: Murder Mystery, a comedy that reunites her with Adam Sandler, which premiered on June 14, 2019;[114] and First Ladies, a film about the first lesbian President of the United States, with Tig Notaro as her wife.[115]\n\nAniston made her return to television on November 1, 2019, producing and starring alongside Reese Witherspoon in the Apple TV+ drama The Morning Show. It is her first main television role since the conclusion of Friends in 2004.[116] Aniston won the Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Drama Series, and was nominated for two Golden Globe Awards for Best Actress – Television Series Drama and Best Television Series – Drama as the series' producer.[117][118]\n\nOther ventures\n\nAniston has appeared in commercials and music videos throughout her career. After starting on Friends, Aniston and her co-star Matthew Perry shot a 60-minute instructional video for the release of Microsoft's Windows 95 operating system.[119] The next year she appeared in commercials for L'Oréal hair products.[120]\n\nUnder a contract with Elizabeth Arden, Inc.,[121] Aniston worked for over a year on her first perfume, which was released in July 2010.[122][123] Original plans called for the perfume to be named \"Lolavie by Jennifer Aniston\", but to avoid confusion with a similarly named perfume, the name was changed to simply \"Jennifer Aniston\".[124] In 2014, she launched her second perfume, named J,[125][126] followed by Near Dusk (2015),[121] Beachscape (2016),[127] Luxe and Chapter One (both in 2017).[128][129]\n\nSince 2007, she has worked in a publicity campaign for the drink SmartWater; on March 7, 2011, she released a YouTube video for SmartWater, Jennifer Aniston Goes Viral, which tripled online interest in the product within 24 hours of its release.[130][131][132] In 2012, Aniston co-founded hair care brand Living Proof and also became its spokeswoman. She left when the company was sold to Unilever in 2016.[133][134][135] In January 2013, she became the new spokeswoman of Aveeno Skincare.[136] She replaced Daniella van Graas as Aveeno's spokesmodel and became its new \"face\". Reportedly, Aniston is paid \"eight figures\" for her endorsement.[137][138][139][140] For roughly $5 million she became the new face of Emirates airline in 2015,[141][142] which was reportedly a success.[143] For pharmaceutical company Shire, she appeared in a 2016 campaign raising awareness about chronic dry eye.[144][145]\n\nShe appeared in the 1996 Tom Petty and The Heartbreakers music video for \"Walls\", and in 2001, in Melissa Etheridge's music video for \"I Want To Be in Love\".[146][unreliable source?] She also appeared in a Heineken commercial.[120]\n\nAlong with Brad Pitt and Brad Grey, CEO of Paramount Pictures, Aniston founded the film production company Plan B Entertainment in 2002,[147] although she and Grey withdrew in 2005.[148][149] In 2008, she and producer Kristin Hahn formed Echo Films.[150]\n\nPhilanthropy\n\nAniston has been a celebrity advocate for numerous charities and received attention for her own donations. She has appeared in television commercials for St. Jude's Children's Research Hospital, and hosted September 2008's Stand Up to Cancer show.[151] In the \"It Can't Wait\" campaign to free Burma, Aniston directed and starred in a video.[152] She is a supporter of Friends of El Faro, a non-profit organization that helps raise money for Casa Hogar Sion, an orphanage in Tijuana, Mexico.[153]\n\nOn April 14, 2007, Aniston received GLAAD's Vanguard Award for her contributions to increased visibility and understanding of the LGBT community.[154] On Earth Day 2010, she joined Courteney Cox, Woody Harrelson, Ben Stiller and others, in \"The Cove PSA: My Friend is...\",[155] an effort to stop the slaughter of dolphins based on the documentary The Cove.[156][157] In 2013, she was named the Entertainment Industry Foundation (EIF) ambassador for the Saks Fifth Avenue Key to the Cure campaign, which raises funds for the EIF Women's Cancer Research Fund.[158] In 2015, she supported the Comic Relief, Inc. charity.[159] Other charities that Aniston has publicly supported include Clothes Off Our Back, Feeding America, EB Medical Research Foundation, Project A.L.S., OmniPeace, and the Rape, Abuse & Incest National Network.[160]\n\nAniston donated $500,000 to Doctors Without Borders, Haitian health care provider Partners in Health and AmeriCares,[161][162] and also participated in the Hope for Haiti Now telethon. She donated $500,000 to the Red Cross and another $500,000 to the Ricky Martin Foundation in 2017 to help victims of hurricanes Harvey, Irma and Maria.[163]\n\nAfter being honored by SmartWater in 2016 for her ongoing philanthropic work for St. Jude's, Aniston spoke of the importance of philanthropy in her life to InStyle magazine: \"We live an extremely beautiful, fortunate life being able to do what we get to do for a living. And so it's a way of being able to be in a position to do something for people who are less able. It's something that makes my heart smile.\"[164]\n\nPersonal life\n\nAniston practices Hatha yoga and Budokan karate.[165][166][167] In 2014, she spoke of her Transcendental Meditation practice.[168] The following year, she revealed she has dyslexia, which had affected her education and self-esteem, and that after being diagnosed in her 20s, her outlook toward life changed. She stated, \"I thought I wasn't smart. I just couldn't retain anything. Now I had this great discovery. I felt like all of my childhood trauma-dies, tragedies, dramas were explained.\"[169]\n\nAniston is a Democrat, donating to Barack Obama's presidential campaign and taking part in a fund-raising lunch for Hillary Clinton during her 2016 Presidential campaign.[170][171][172]\n\nRelationships\n\nShe was romantically involved with actor Tate Donovan. The couple began dating in 1995, but ended their relationship after two and a half years in 1998.[173]\n\nAniston met Brad Pitt in 1998; their relationship was widely publicized in the press.[174][175] She married Pitt, after two years of dating, on July 29, 2000, in a lavish Malibu wedding. For a few years, their marriage was considered the rare Hollywood success.[4] On January 7, 2005, they announced their separation,[176] and finalized their divorce on October 2.[177] During their divorce proceedings, there was intense speculation in the media that Pitt had been unfaithful to Aniston with his Mr. & Mrs. Smith co-star Angelina Jolie, whom he started dating soon after the split.[178] In the following months, the public's reaction toward the divorce was reported in the press, and \"Team Aniston\" and \"Team Jolie\" T-shirts appeared throughout the country.[178] Aniston commented on the divorce in a January 2015 interview with The Hollywood Reporter, stating that: \"Nobody did anything wrong... It was just like, sometimes things [happen].\"[169]\n\nIn 2005, amid reports that their divorce was due to Aniston's refusal to have children with Pitt, Aniston stated to Vanity Fair, \"I've never in my life said I didn't want to have children. I did and I do and I will! ... I would never give up that experience for a career.\" Aniston also revealed that the divorce prompted her to reach out to her mother, from whom she was estranged for nearly a decade. They initially became estranged when Nancy talked about her daughter on a television show and wrote From Mother and Daughter to Friends: A Memoir (1999).[179][180] Aniston has also stated she was devastated by the death of her longtime therapist, whose work helped make her separation from Pitt easier.[53] She said her relationship with Pitt, which she does not regret, was \"seven very intense years together\" and that \"it was a beautiful, complicated relationship\".[181]\n\nFrom 2008–09, she briefly dated singer and musician John Mayer making a notable public appearance at the 81st Academy Awards.[182][183]\n\nAniston started a relationship with actor, director, and screenwriter Justin Theroux in May 2011. The following January they purchased a home in Los Angeles's Bel Air neighborhood for roughly $22 million.[184] They became engaged on August 10, 2012[185] and were married on August 5, 2015 at their estate.[186] They separated at the end of 2017.[187]\n\nIn the media\n\nWealth\n\nAniston is one of the highest-paid actresses in Hollywood as of 2018.[188] She has been on the Forbes Top Earning Actresses list for 15 years, every year since 2001—and since then also on its Celebrity 100 list (based on \"earnings and fame\"), topping it in 2003.[189][190] According to Forbes, in October 2007, Aniston was the top-selling celebrity face of the entertainment industry.[191]\n\nThe magazine estimated her net worth at $110 million in 2007,[192] $150 million in 2014,[193] and $200 million in 2017.[194] It listed her earnings as $19.5 million in 2018.[195]\n\nPublic image\n\nAniston has been included in magazine lists of the world's most beautiful women.[196][197][198] In 2005, she became the first GQ Woman of the Year. She has frequently appeared on People's annual list of Most Beautiful Women, and was number one in 2004 and 2016.[199] She also topped the magazine's Best Dressed List in 2006. She has been a regular on FHM's 100 Sexiest Women list since 1996, most recently ranking at number 79 in 2012.[200] In 2011, The Daily Telegraph reported the most sought-after body parts of the rich and famous revealed by two Hollywood plastic surgeons who carried out a survey among their patients to build up the picture of what the perfect woman would look like. Under the category of the most sought-after body shape, Aniston was voted in the top three, alongside Gisele Bündchen and Penélope Cruz.[201] In the same year, readers of Men's Health magazine voted Aniston the Sexiest Woman of All Time.[202] Although Aniston disliked the hairstyle she wore during her first two years on Friends, \"The Rachel\" became very popular.[203][204]\n\nShe received a motion picture star on the Hollywood Walk of Fame on February 22, 2012,[205] located at 6270 Hollywood Boulevard.[206] On Forbes' list of the 100 Most Powerful Actresses in Hollywood, she was ranked third in 2013.[207]\n\nIn July 2016, she wrote an essay for The Huffington Post in reply to rumors about her, where she criticized \"The objectification and scrutiny we put women through\" and stated that: \"We are complete with or without a mate, with or without a child. We get to decide for ourselves what is beautiful when it comes to our bodies. ... We don't need to be married or mothers to be complete. We get to determine our own 'happily ever after' for ourselves.\"[208] The essay was supported by many celebrities and covered widely in the media.[209]\n\nAfter years of aversion to social media, Aniston joined Instagram on October 15, 2019, causing the app to \"break\" (for hours the follow button became inoperable due to an overload of web traffic to her account) with the first photo of a Friends cast reunion. At 5 hours and 16 minutes, she became the fastest person to reach a million followers on the app, setting a Guinness World Record.[210]\n\nWorks and accolades\n\nAniston has received five Primetime Emmy Award nominations, two Golden Globe Award nominations, and nine SAG Award nominations for her role in Friends. From these, she has won one of each. She also garnered one additional Primetime Emmy Award nomination for her guest appearance in 30 Rock, while her performance in Cake earned her nominations at the Golden Globe and SAG Awards. Aniston won a SAG Award and was nominated for two Golden Globe Awards for The Morning Show.\n\nAccording to review aggregator site Rotten Tomatoes and the box-office site Box Office Mojo, Aniston's most critically acclaimed and commercially successful films are Office Space (1999), The Good Girl (2002), Bruce Almighty (2003), Friends with Money (2006), The Break-Up (2006), Marley & Me (2008), Just Go with It (2011), Horrible Bosses (2011), We're the Millers (2013), and Dumplin' (2018).[211][43]\n\nSee also\n\nReferences", "images": ["http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/21px-Video-x-generic.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/21px-P_vip.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/JenniferAnistonFeb09.jpg/220px-JenniferAnistonFeb09.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Jennifer_Aniston_estrella.jpg/170px-Jennifer_Aniston_estrella.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/24px-Flag_of_the_United_States.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Emblem-money.svg/21px-Emblem-money.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/JenniferAniston08TIFF.jpg/170px-JenniferAniston08TIFF.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/42/Jennifer_Aniston_and_Kristin_Hahn_%28cropped%29.jpg/220px-Jennifer_Aniston_and_Kristin_Hahn_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/16/JenniferAnistonHWoFFeb2012.jpg/220px-JenniferAnistonHWoFFeb2012.jpg", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Jennifer_Aniston_2011.jpg/220px-Jennifer_Aniston_2011.jpg", "https://upload.wikimedia.org/wikipedia/commons/1/16/JenniferAnistonHWoFFeb2012.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/24px-Blank_television_set.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/1/16/JenniferAnistonHWoFFeb2012.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jennifer_Aniston", "title": "Jennifer Aniston", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/1/16/JenniferAnistonHWoFFeb2012.jpg"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}