{"url": "https://www.theringer.com/movies/2017/10/9/16450614/harvey-weinstein-sexual-harassment-hollywood-responds", "text": "As expected, The New York Times’ exposé on the multiple sexual-harassment allegations lodged against noted Hollywood producer Harvey Weinstein, published Thursday, has continued to reverberate throughout the film industry. Weinstein was fired from his own company on Sunday, and on Monday, several prominent figures within in the industry — including some who have worked with Weinstein in the past — issued statements condemning his actions. The initial story has also developed in the four days since it was published, as Weinstein seeks to repair his public image in the wake of the allegations and several others to come forward. In an email obtained by The Hollywood Reporter, Weinstein reportedly asked several prominent Hollywood executives for their support once he learned that the Weinstein Company would terminate his employment.\n\nJUST IN: Weinstein's desperate email to Hwood CEOs, moguls hours before his firing. Read to me by a disgusted (male) recipient pic.twitter.com/wQA64WcKf7 — Janice Min (@janicemin) October 9, 2017\n\nA similar report from Variety published Monday claimed that the producer tried to impede the Weinstein Company’s probe into his harassment allegations, which played a role in his eventual ousting.\n\nIt was also reported that The New York Times had pursued the story surrounding Weinstein at least one other time in 2004. Former Times reporter Sharon Waxman, founder of The Wrap, scoffed at the public praise for the Times exposé, writing on her website that the newspaper had buckled to pressure from Hollywood elites and killed a story she had been working on about Weinstein’s misconduct. Waxman says that she had information about a Miramax employee who had been hired solely to “take care of Weinstein’s women needs,” and that she had also made contact with a former Weinstein employee who had agreed to a settlement after an unwanted sexual encounter with the producer. According to Waxman, the studio mogul, who frequently advertised in the Times, put pressure on the newspaper to kill the story. Early claims that Matt Damon and Russell Crowe were also involved in attempts to rebut the story have since been denied by Damon himself, in a Deadline interview published Tuesday. Damon said that his conversation with Waxman was “about a one minute phone call” concerning a piece she was writing about then-Miramax executive Fabrizio Lombardo. Waxman corroborated his story in a tweet on Tuesday.\n\nAs the Weinstein story continues to unfold, prominent figures continue to respond. We’ll collect those responses in this post, which will be regularly updated as more celebrities speak out.\n\nUpdated October 13\n\nQuentin Tarantino: “Stunned and Heartbroken”\n\nQuentin Tarantino broke his silence early Friday morning on the Weinstein allegations. In a statement shared by actress Amber Tamblyn on Twitter—Tamblyn said they had a “long dinner”—Tarantino said he was “stunned and heartbroken” to hear about Weinstein’s alleged behavior and will speak about it at greater length in a few days. “I need a few more days to process my pain, emotions, anger and memory and then I will speak publicly about it,” his statement read.\n\nTarantino’s silence on the allegations was met with criticism, as the filmmaker has had all of his films distributed by Weinstein, beginning with 1992’s Reservoir Dogs.\n\nUpdated October 12\n\nRyan Gosling: “I’m Deeply Disappointed in Myself for Being So Oblivious”\n\nOn Thursday, the Blade Runner 2049 star Ryan Gosling tweeted a statement adding his “voice of support” for the women speaking out against Weinstein. “Like most people in Hollywood, I have worked with him and I’m deeply disappointed in myself for being so oblivious to these devastating experiences of sexual harassment and abuse,” Gosling said. “He is emblematic of a systematic problem. Men should stand with women and work together until there is real accountability and change.”\n\nEmma Thompson Says Weinstein Is the Tip of the Iceberg\n\nIn an interview clip released Thursday by the BBC, the actress called Weinstein a “predator” and said that he’s at the top of the ladder in a system of “harassment, and belittling, and bullying.” She also said that “this has been a part of our world, women’s world, since time immemorial.” When asked whether other men like Weinstein exist in Hollywood, she said that while other men may not have harassed women to the degree that Weinstein allegedly did, even one instance of harassment should “count.”\n\nKate Beckinsale: “Harvey Is an Emblem of a System That Is Sick”\n\nIn a message posted to Instagram on Thursday morning, Beckinsale shared her own experience of being sexually harassed by Weinstein, detailing one incident in particular that occurred when the actress was 17 years old. Beckinsale said she repeatedly rebuffed Weinstein’s advances and that he would jokingly tell people, “Kate lives to say no to me.” “Let's stop allowing our young women to be sexual cannon fodder, and let’s remember that Harvey is an emblem of a system that is sick, and that we have work to do,” the actress concluded. Read her full statement below.\n\nUpdated October 11\n\nFilm Academy Responds to Weinstein Accusations, BAFTA Suspends His Membership\n\nThe Academy of Motion Picture Arts and Sciences released a statement Wednesday that calls Weinstein’s alleged actions “repugnant, abhorrent, and antithetical to the high standards of the Academy and the creative community it represents.” The organization also announced that the Board of Governors will meet on Sunday, October 14 to “discuss the allegations against Weinstein and any actions warranted by the Academy.” The British Academy took its own action early Wednesday, suspending Weinstein’s membership “effective immediately.” The statement said that the organization “considers the reported alleged behavior completely unacceptable and incompatible with BAFTA’s values.”\n\nLéa Seydoux: “I Had to Defend Myself” From Weinstein\n\nIn a conversation with The Guardian, published Wednesday, French actress Léa Seydoux described an incident in which she said Weinstein attempted to kiss her during a meeting in his hotel room. “I had to defend myself,” Seydoux said. “He’s big and fat, so I had to be forceful to resist him.” She said that since the encounter, she’s had to engage with Weinstein several times at public events. “Everyone knew what Harvey was up to and no one did anything. It’s unbelievable that he’s been able to act like this for decades and still keep his career.”\n\nCara Delevingne Details Various Incidents of Harassment by Weinstein\n\nModel and actress Cara Delevingne, who recently appeared in the Weinstein Company film Tulip Fever, released a statement Wednesday describing several incidents in which she said she was harassed by Weinstein. According to Delevingne, Weinstein called her early on in her acting career and asked whether she had slept with any of the women she was “seen out with in the media.” She said that Weinstein told her that if she was gay or publicly dated a woman, she would never “get the role of a straight woman or make it as an actress in Hollywood.” Delevingne also detailed an experience in which Weinstein invited her to his hotel room and asked her to kiss another woman in front of him. “The more we talk about it, the less power we give them,” she said. “To the people who defend these men, you are part of the problem.”\n\nI just received this statement from @Caradelevingne detailing her experience with Harvey Weinstein. Thank you, Cara. pic.twitter.com/SA1D05lYH4 — Yashar Ali (@yashar) October 11, 2017\n\nTom Hanks: “Isn’t It Kind of Amazing That It Took This Long?”\n\nIn a profile published Wednesday by The New York Times, Tom Hanks said that while he never worked with Weinstein, “it all just sort of fits, doesn’t it?” He rejected Weinstein’s excuse that he grew up in the ’60s and ’70s, when the “rules ... were different.” “I did too,” Hanks said. “So I think it’s like, well, what do you want from this position of power? I know all kinds of people that just love hitting on, or making the lives of underlings some degree of miserable, because they can.” He went on to say that people like Weinstein think their achievements entitle them.\n\nLeonardo DiCaprio: “No Excuse” for Sexual Assault\n\nIn a post on his Facebook page—also shared on Twitter—DiCaprio, a frequent Weinstein collaborator, weighed in on the allegations, though he didn’t refer to Weinstein by name. “There is no excuse for sexual harassment or sexual assault—no matter who you are and no matter what profession,” the actor said. “I applaud the strength and courage of the women who came forward and made their voices heard.\"\n\nLindsay Lohan Supports Weinstein in Deleted Instagram Videos\n\nIn two videos posted on Instagram on Tuesday night, which have since been deleted, Lindsay Lohan came to Weinstein’s defense and called for his wife, Georgina Chapman, to stay with him. On Tuesday, Chapman announced that she was separating with Weinstein in the wake of the allegations of sexual harassment and assault. “I don’t think it’s right what’s going on,” Lohan says in the videos. “I think Georgina needs to take a stand and be there for her husband. He’s never harmed me or did anything to me. We’ve done several movies together. I think everyone needs to stop. I think it’s wrong. So, stand up.”\n\nlindsay lohan (and her whack accent) is defending Harvey Weinstein on her insta rn. GOODBYE TO YOU FOREVER. pic.twitter.com/aMzvAOXPYp — lauren yap (@itslaurenyap) October 11, 2017\n\nUpdated October 10\n\nObamas Release Statement Condemning Weinstein, Celebrating Courage of Women Who Have Come Forward\n\n“Michelle and I have been disgusted by the recent reports about Harvey Weinstein,” reads a statement released by Barack and Michelle Obama on Tuesday afternoon. “Any man who demeans and degrades women in such fashion needs to be condemned and held accountable, regardless of wealth or status. We should celebrate the courage of women who have come forward to tell these painful stories. And we all need to build a culture — including by empowering our girls and teaching our boys decency and respect — so we can make such behavior less prevalent in the future.”\n\nGretchen Mol: “I Am Angry and Disgusted About Harvey Weinstein’s Abuse of Power”\n\nIn a guest column Tuesday for The Hollywood Reporter, actress Gretchen Mol denied what she described as “slut-shaming” rumors that she had a long-held transactional relationship with Weinstein. “I did not exchange sexual favors with Harvey Weinstein, or anyone, for advancement in my career. I was never paid any settlement. The truth is that I have never been alone in a room with Harvey Weinstein,” Mol wrote. She said that her story is not a defense of Weinstein, but a statement of fact. Mol wrote that she had heard rumors about Weinstein and other actresses years before she heard them about herself. “The consistent implication was that actresses were eager for the bargain, that we wanted fame and fortune so desperately that we would make this kind of nauseating concession. This is another kind of misogyny, and blame-shifting,” Mol continued. She finished by putting her support behind the outspoken victims, proclaiming, “We have no reason to feel ashamed.”\n\nHeather Graham: “We Don’t Want to Be the First or Only Voice in the Room”\n\nIn an account published by Variety on Tuesday afternoon, Heather Graham detailed an encounter with Weinstein in which she said he implied that she had to have sex with him for a movie role. She recounted a meeting with Weinstein in which he told her he wanted her to star in one of his movies. “Later in the conversation, he mentioned that he had an agreement with his wife. He could sleep with whomever he wanted when he was out of town,” Graham wrote. “I walked out of the meeting feeling uneasy. There was no explicit mention that to star in one of those films I had to sleep with him, but the subtext was there.” She went on to express her support for the other women who have shared their stories, and said, “While I still do feel guilty for not speaking up all those years ago, I’m glad for this moment of reckoning. To the countless other women who have experienced the gray areas: I believe you.”\n\nMinnie Driver Speaks Out in Support of Victims\n\nFrequent Miramax star Minnie Driver condemned Weinstein’s alleged abuse on Tuesday afternoon in a statement made to Variety. “In light of the revelations about Harvey Weinstein in the past few days, I feel it necessary to add my support for the women who have been victimized and have been brave enough to talk about it,” Driver said in her statement. “While I never experienced any abuse while working with Harvey, I think it’s important to add my voice to those of women everywhere who have experienced abuse at the hands of powerful men.”\n\nMatt Damon Denies Pressuring The New York Times to Kill a 2004 Harvey Weinstein Story\n\nIn an interview with Deadline, Damon addressed The Wrap’s allegation that he, along with Russell Crowe, pressured The New York Times into killing a story about Weinstein’s sexual misconduct. According to Damon, Weinstein told him to expect a call from Sharon Waxman about Miramax employee Fabrizio Lombardo, and that the story she was pursuing was a negative piece on Lombardo. “Harvey said, ‘You worked with him,’” Damon said. “‘Can you tell her that he was a professional and you had a good experience,’ and that was it. I didn’t mind doing it, because that was all true.”\n\nThe actor also denied knowing about Weinstein’s behavior, disputing the notion that everyone in Hollywood knew about the alleged harassment. “This type of predation happens behind closed doors, and out of public view,” he said. “If there was ever an event that I was at and Harvey was doing this kind of thing and I didn’t see it, then I am so deeply sorry, because I would have stopped it. And I will peel my eyes back now, farther than I ever have, to look for this type of behavior. Because we know that it happens. I feel horrible for these women and it’s wonderful they have this incredible courage and are standing up now.” Read Damon’s full interview with Deadline here.\n\nGwyneth Paltrow Reportedly Refused Weinstein Advances: “I Thought He Was Going to Fire Me”\n\nOn Tuesday morning, The New York Times published an article detailing various stories from major actresses, leading with an account from Paltrow. The Shakespeare in Love (a Miramax movie) Oscar winner told the Times that at age 22, she was summoned to Weinstein’s suite before shooting began on Emma. According to the interview, Weinstein placed his hands on Paltrow and suggested that they head to the bedroom for massages. “I was a kid, I was signed up, I was petrified,” Paltrow told the Times. She also said that she told Brad Pitt, her boyfriend at the time, about the incident. When he confronted Weinstein, Paltrow said that producer threatened her not to tell anyone else about the incident. “I thought he was going to fire me,” she said.\n\nAngelina Jolie: “This Behavior Towards Women in Any field, Any Country Is Unacceptable”\n\nIn the same New York Times piece published Tuesday, the actress and director joined Paltrow and others in sharing her own story about Weinstein. “I had a bad experience with Harvey Weinstein in my youth, and as a result, chose never to work with him again and warn others when they did,” Jolie told the Times in an email. “This behavior towards women in any field, any country is unacceptable.”\n\nHillary Clinton Releases Statement in Support of Alleged Victims\n\nWeinstein has been a longtime donor to and fundraiser for Democratic candidates and causes, and many conservative critics called on Hillary Clinton to make a statement. She released one on Twitter on Tuesday. “I was shocked and appalled by the revelations about Harvey Weinstein,” she said. “The behavior described by women coming forward cannot be tolerated. Their courage and the support of others is critical in helping to stop this kind of behavior.”\n\nStatement from Secretary Clinton on Harvey Weinstein: pic.twitter.com/L1l2wl9l0I — Nick Merrill (@NickMerrill) October 10, 2017\n\nNicole Kidman: “We Need to Eradicate This Behavior”\n\nIn a statement released to People on Tuesday, Kidman, a frequent Weinstein Company collaborator, put her support behind the victims of Weinstein’s alleged harassment. “As I’ve stated before publicly, I support and applaud all women and these women who speak out against any abuse and misuse of power — be it domestic violence or sexual harassment in the workforce,” the actress said in the statement. “We need to eradicate this behavior.”\n\nJulianne Moore Tweets Her Support for Women Coming Forward\n\nOn Monday morning, the actress joined the growing number of stars tweeting their support of Weinstein’s alleged victims. “Coming forward about sexual abuse and coercion is scary and women have nothing to be gained personally by doing so,” Moore tweeted. She continued, “But through their bravery we move forward as a culture, and I thank them. Stand with @AshleyJudd @rosemcgowan and others.”\n\n1. Coming forward about sexual abuse and coercion is scary and women have nothing to be gained personally by doing so. — Julianne Moore (@_juliannemoore) October 9, 2017\n\nBen Affleck: Additional Allegations “Made Me Sick”\n\nIn a post shared to Facebook and Twitter on Tuesday morning, Affleck said that he is “saddened and angry that a man who I worked with used his position of power to intimidate, sexually harass and manipulate many women over decades.” He continued, “The additional allegations of assault that I read this morning made me sick. This is completely unacceptable, and I find myself asking what I can do to make sure this doesn’t happen to others. We need to do better at protecting our sisters, friends, co-workers and daughters. We must support those who come forward, condemn this type of behavior when we see it and help ensure there are more women in positions of power.”\n\nRebecca Hall: “I Think He Deserves What Is Coming”\n\nHall, who has appeared in a number of Weinstein Company productions, spoke with IndieWire on Tuesday about Weinstein’s conduct and the recent allegations against him. “Of course I have something to say about it,” Hall said. “He released two films that I was involved in, so it’s not like I haven’t come across him.” She continued, “I wholeheartedly stand behind the women who are coming out and saying what they’re saying now, it’s incredibly hard to do that, and the idea that it could be in any way for their gains is preposterous. I think what’s going to happen in the next couple of days is interesting and I think he deserves what is coming. It’s indefensible how he’s behaved, it is. I think it’s inexcusable, and I am behind those women.” Hall said that while she was never personally assaulted by Weinstein, she was aware of the rumors concerning his behavior.\n\nJennifer Lawrence “Deeply Disturbed” by Allegations\n\nOn Monday night, Jennifer Lawrence, who won an Oscar in 2013 for her leading role in Silver Linings Playbook—a film produced by Weinstein—called the allegations against the producer “inexcusable and absolutely upsetting.” “I was deeply disturbed to hear the news about Harvey Weinstein’s behavior,” she said in a statement to Variety. “My heart goes out to all of the women affected by these gross actions. And I want to thank them for their bravery to come forward.”\n\nGeorge Clooney: “Everyone Is Complicit in It”\n\nSpeaking with The Daily Beast on Monday night, George Clooney admitted to hearing rumors about Weinstein “chasing girls” over the years, but was unaware of the extent of the producer’s behavior. “This is harassment on a very high level,” the actor said. “And there’s an argument that everyone is complicit in it. I suppose the argument would be that it’s not just about Hollywood, but about all of us—that every time you see someone using their power and influence to take advantage of someone without power and influence and you don’t speak up, you’re complicit. And there’s no question about that.” Read Clooney’s full interview here.\n\nJessica Chastain: Weinstein Stories “Were Everywhere”\n\nIn a series of tweets Monday, Jessica Chastain said it was “heart shattering” to read Waxman’s piece in The Wrap and learn that Hollywood elites reportedly made efforts to keep the Weinstein allegations silent. “I was warned from the beginning,” Chastain wrote in another tweet. “The stories were everywhere. To deny that is to create an enviornment [sic] for it to happen again.”\n\nI was warned from the beginning. The stories were everywhere. To deny that is to create an enviornment for it to happen again. — Jessica Chastain (@jes_chastain) October 9, 2017\n\nUpdated October 9\n\nGlenn Close: “I’m Angry”\n\nIn a statement to The New York Times on Monday, Close said she is “angry and darkly sad” to learn about the Weinstein allegations, while admitting to being previously aware of “vague rumors” surrounding the producer. “I’m angry, not just at him and the conspiracy of silence around his actions, but also that the ‘casting couch’ phenomenon, so to speak, is still a reality in our business and in the world: the horrible pressure, the awful expectation put on a woman when a powerful, egotistical, entitled bully expects sexual favors in exchange for a job,” Close said. Read her full response here.\n\nKate Winslet Applauds “Profound Courage” of Women Speaking Out Against Weinstein\n\nWinslet, who won a Best Actress Oscar in 2009 for The Reader—which was released by the Weinstein Company—praised the “profound courage” of the women who spoke out against the mogul in a statement to Variety on Monday. “I unequivocally support this level of very necessary exposure of someone who has behaved in reprehensible and disgusting ways,” the actress says. “[Weinstein’s] behaviour is without question disgraceful and appalling and very, very wrong. I had hoped that these kind of stories were just made up rumours, maybe we have all been naïve. And it makes me so angry.”\n\nMeryl Streep: “Not Everybody Knew”\n\nStreep, who has collaborated with Weinstein on films like The Iron Lady, for which she won an Academy Award for best actress, sent a statement to HuffPost on Monday about the producer. Noting first that Weinstein’s alleged behavior is disgraceful and appalling, Streep said that Weinstein maintained a “respectful” working relationship with her, and emphasized that the open secret of his actions wasn’t privy to everyone in Hollywood. In closing, she lauded the women who came forward for their courage in bringing Weinstein’s abusive behavior to light. Her full statement reads:\n\nThe disgraceful news about Harvey Weinstein has appalled those of us whose work he championed, and those whose good and worthy causes he supported. The intrepid women who raised their voices to expose this abuse are our heroes. One thing can be clarified. Not everybody knew. Harvey supported the work fiercely, was exasperating but respectful with me in our working relationship, and with many others with whom he worked professionally. I didn’t know about these other offenses: I did not know about his financial settlements with actresses and colleagues; I did not know about his having meetings in his hotel room, his bathroom, or other inappropriate, coercive acts. And if everybody knew, I don’t believe that all the investigative reporters in the entertainment and the hard news media would have neglected for decades to write about it. The behavior is inexcusable, but the abuse of power familiar. Each brave voice that is raised, heard and credited by our watchdog media will ultimately change the game.\n\nLena Dunham Implores Hollywood to “Speak Louder”\n\nIn a Monday op-ed for The New York Times, Girls creator Dunham called for men in Hollywood to speak out against sexually inappropriate behavior, an all-too-familiar experience for women working in the industry. “Mr. Weinstein may be the most powerful man in Hollywood to be revealed as a predator, but he’s certainly not the only one who has been allowed to run wild,” Dunham writes. “His behavior, silently co-signed for decades by employees and collaborators, is a microcosm of what has been happening in Hollywood since always and of what workplace harassment looks like for women everywhere.” You can read Dunham’s full op-ed here.\n\nFrequent Collaborator Judi Dench Speaks Out\n\nDench, who once joked that she had a tattoo of Weinstein because of how much he had helped her career, called the allegations “horrifying” in a statement provided to Newsweek on Monday. “Whilst there is no doubt that Harvey Weinstein has helped and championed my film career for the past 20 years, I was completely unaware of these offenses which are, of course, horrifying, and I offer my sympathy to those who have suffered, and wholehearted support to those who have spoken out,” the actress said.\n\nDirector Kevin Smith: “It Makes Me Feel Ashamed”\n\nSmith, who worked with Weinstein on films at the beginning of his career, such as Dogma and Chasing Amy, admitted he was “ashamed” to have worked with the producer after a Twitter user asked for his thoughts about the accusations.\n\nHe financed the first 14 years of my career - and now I know while I was profiting, others were in terrible pain. It makes me feel ashamed. https://t.co/T0hInW7EqJ — KevinSmith (@ThatKevinSmith) October 9, 2017\n\nRose McGowan Calls for Weinstein Company Resignations\n\nMcGowan, who reportedly reached a settlement with Weinstein after an “episode in a hotel room during the Sundance Film Festival” in 1997, according to the Times report, spoke about the allegations on Twitter and in an interview with The Hollywood Reporter. “Men in Hollywood need to change ASAP,” she told the Reporter. “Hollywood’s power is dying because society has changed and grown, and yet Hollywood male behavior has not.” On Twitter, McGowan said that other members of the Weinstein Company — including Weinstein’s brother and company cofounder, Bob — should resign. “The men of Hollywood need to know they own no woman,” she said in a statement attached to a tweet.\n\nDirector James Gunn Pens a Response\n\nIn an essay published Monday on his Facebook page titled “On Sexual Predators in Hollywood (and the World),” Guardians of the Galaxy director James Gunn wrote about the Weinstein allegations and the larger systemic issues of sexual harassment facing women. In the piece, Gunn writes about how, while chatting with three female friends after the Weinstein news broke, he was disgusted to learn that all three had experienced sexual harassment. Gunn goes on to plead that the report on Weinstein be a turning point not only in Hollywood, but in the world at large. “When someone is coerced sexually it not only affects that person, but the lives of those around that person, like rows of dominoes falling in every direction,” Gunn wrote. “It demolishes trust and comfort in all of society. And evil men are doing this everywhere, every day, in every occupation, and every type of household, all over the world.” Read the director’s full letter below:", "images": ["https://cdn.vox-cdn.com/uploads/chorus_image/image/66669845/1194991176.jpg.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66669036/1211212226.jpg.0.jpg", "https://cdn.vox-cdn.com/thumbor/c76TGlzQsISQDPv3_hlLv-364P0=/0x0:4524x3016/1200x800/filters:focal(1973x686:2695x1408)/cdn.vox-cdn.com/uploads/chorus_image/image/57074659/609773132.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66670109/1197847685.jpg.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66667177/4_17_Desktop_Thumbnail_1.0.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66667782/claire_toohotothandle_netflix_ringer.0.jpg", "https://cdn.vox-cdn.com/thumbor/AimIORGArzNaDG4CBrCm4FfS-sY=/0x0:4524x2369/fit-in/1200x630/cdn3.vox-cdn.com/uploads/chorus_asset/file/9427051/609773132.jpg", "https://cdn.vox-cdn.com/uploads/chorus_image/image/66667603/fink_ringer_illo.0.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAUEBAAAACwAAAAAAQABAAACAkQBADs"], "top_img": "https://cdn.vox-cdn.com/thumbor/AimIORGArzNaDG4CBrCm4FfS-sY=/0x0:4524x2369/fit-in/1200x630/cdn3.vox-cdn.com/uploads/chorus_asset/file/9427051/609773132.jpg", "keywords": [], "authors": ["Miles Surrey", "Kate Halliwell", "Liz Kelly", "Chris Vernon", "Kevin O'Connor", "The Jj Redick Podcast With Tommy Alter", "Claire Mcnear", "Oliver Lee Bateman", "Jason Concepcion", "Oct"], "canonical_link": "https://www.theringer.com/movies/2017/10/9/16450614/harvey-weinstein-sexual-harassment-hollywood-responds", "title": "How Hollywood Is Responding to the Harvey Weinstein Allegations", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Ringer", "article": {"publisher": "https://www.facebook.com/ringer/", "published_time": "2017-10-09T19:32:48-04:00", "modified_time": "2017-10-09T19:32:48-04:00"}, "author": "Miles Surrey", "style-tools": "https://www.theringer.com/style/community/723/739655690adad613b032e69b51e66554/tools.css", "msvalidate.01": "D385D0326A3AE144205C298DB34B4E94", "description": "Four days after The New York Times published its damning report on the Hollywood producer, more and more prominent figures in the industry have spoken out, from Meryl Streep to Kevin Smith to Lena Dunham", "og": {"description": "Four days after The New York Times published its damning report on the Hollywood producer, more and more prominent figures in the industry have spoken out, from Meryl Streep to Kevin Smith to Lena Dunham", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/AimIORGArzNaDG4CBrCm4FfS-sY=/0x0:4524x2369/fit-in/1200x630/cdn3.vox-cdn.com/uploads/chorus_asset/file/9427051/609773132.jpg", "alt": "Harvey Weinstein", "height": 630, "width": 1200}, "site_name": "The Ringer", "title": "How Hollywood Is Responding to the Harvey Weinstein Allegations", "type": "article", "url": "https://www.theringer.com/movies/2017/10/9/16450614/harvey-weinstein-sexual-harassment-hollywood-responds"}, "fb": {"app_id": 549923288395304}, "twitter": {"card": "summary_large_image", "url": "https://www.theringer.com/movies/2017/10/9/16450614/harvey-weinstein-sexual-harassment-hollywood-responds", "title": "How Hollywood Is Responding to the Harvey Weinstein Allegations", "description": "Four days after The New York Times published its damning report on the Hollywood producer, more and more prominent figures in the industry have spoken out, from Meryl Streep to Kevin Smith to Lena Dunham", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/AimIORGArzNaDG4CBrCm4FfS-sY=/0x0:4524x2369/fit-in/1200x630/cdn3.vox-cdn.com/uploads/chorus_asset/file/9427051/609773132.jpg", "alt": "Harvey Weinstein"}, "site": "ringer"}, "sailthru.title": "How Hollywood Is Responding to the Harvey Weinstein Allegations", "sailthru.tags": "general,the-ringer,front-page,movies,pop-culture", "sailthru.description": "Four days after The New York Times published its damning report on the Hollywood producer, more and more prominent figures in the industry have spoken out, from Meryl Streep to Kevin Smith to Lena Dunham", "sailthru.date": "2017-10-09T19:32:48-04:00", "sailthru.image.full": "https://cdn.vox-cdn.com/thumbor/cyrBfgkwx-gOPXv5_EmNPOo7gMc=/0x0:4524x2545/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/57074657/609773132.0.jpg", "sailthru.image.thumb": "https://cdn.vox-cdn.com/thumbor/n1LtV2GMQ9jK-5UXrIs4qoMt9UY=/826x0:3842x3016/200x200/cdn.vox-cdn.com/uploads/chorus_image/image/57074657/609773132.0.jpg", "msapplication-TileImage": "https://cdn.vox-cdn.com/uploads/chorus_asset/file/8991995/favicon-196x196.0.png", "msapplication-TileColor": "#67c385"}, "movies": [], "publish_date": 1507478400.0, "source": "https://www.theringer.com", "summary": ""}