{"url": "www.abc.net.au/news/2018-05-17/meghan-markle-american-tv-actresses-prince-harry-windsor-castle/9766742", "text": "Meghan Markle: Six reasons why she divides people — even Americans\n\nUpdated\n\nIf you thought every American would be celebrating the prospect of a Yankee taking up residence in the Royal household, you'd be mistaken.\n\nAs Prince Harry and Meghan prepared to wed, there had been an astounding level of venom aimed at both of them, on both sides of the Atlantic.\n\nFar from being the happy, feathery event that certainly Kensington Palace and television networks hoped for, the wedding has unpacked layers of discontent among the Queen's subjects and her former subjects alike.\n\nAs Tom Wells of The Sun put it on Twitter: \"This has to be the worst build-up to a Royal wedding since Henry VIII last went down on one knee.\"\n\nThe anti-Meghan outcry has caused no level of surprise and consternation at news outlets and websites that follow the Royals, and even those that marginally mention the Royal couple.\n\nWhile they value the traffic the pair have brought in, digital editors have discovered they can't leave their comments sections unchecked, or else the nastiness takes hold.\n\n\"The most surprising thing about covering Meghan's fashion isn't the fashion at all,\" says Susan Kelley, who created What Kate Wore, the popular site tracking the Duchess of Cambridge's style, and also oversees What Meghan Wore, which features attire and activities.\n\n\"It's been the level of animosity directed at her and the number of comments on the site and on Facebook that couldn't be published because of the tone or language.\"\n\nEven a food writer friend who posted an innocuous \"where to watch the nuptials\" post this week was blindsided by attacks on Meghan.\n\nShe is already the most controversial British Royal bride since Camilla, the Duchess of Cornwall, who many people will never embrace because she succeeded Diana, Princess of Wales.\n\nMeghan readily brings to mind the uproar over Wallis Simpson, the twice-divorced American for whom Edward VIII gave up the throne.\n\nIn retrospect, those women had it much, much easier than Meghan. In watching the Royal drama for the better part of 18 months, I've come up with a list of six objections to her marriage, led by the big one they never had to address.\n\n1. She's bi-racial\n\nThe first, and unmistakable overtone in every conversation about her is racism. Meghan is bi-racial, and identifies herself as such. Her mother Doria is African-American. Her father Thomas is white.\n\nThis is far from unusual in public life. President Barack Obama was bi-racial, with a white mother and black father, although he identified as black.\n\nAcademy Award winning actress Halle Berry is bi-racial. Canadian rapper Drake is bi-racial. So is football star Colin Kaepernick.\n\nAlthough intermarriage was outlawed in many parts of the US during the first two-thirds of the 20th century, Americans who grew up in the 1970s and after are likely to know mixed-race couples, and socialise and go to school with bi-racial kids.\n\nFor a lot of people, especially in major urban and college cities, Meghan's background would only bring on a shrug.\n\nBut, there is an old American saying that one drop of blood makes you black, and, in some of the most bigoted commenters' eyes, makes you unfit to be a princess of the United Kingdom.\n\nSays Kelley: \"I never expected to see the sort of negative, derogatory and outright racist comments we have encountered in writing about Meghan's style.\"\n\nThis is even true when What Kate Wore runs a photo of the Duchess and Meghan at the same event, Kelley says.\n\nKensington Palace tried to attack this head on when Harry and Meghan were first dating in 2016. In an unprecedented statement, the Palace said: \"His girlfriend, Meghan Markle, has been subject to a wave of abuse and harassment. Some of this has been very public — the smear on the front page of a national newspaper; the racial undertones of comment pieces; and the outright sexism and racism of social media trolls and web article comments.\"\n\nSaid the Palace: \"This is not a game — it is her life, and his.\"\n\nThat did little to stop the racist comments, and now Harry and Meghan face a future in which this is a day to day part of their lives.\n\nIf you think it will die down, just look at any internet post that is at all flattering to Camilla. The Diana fans are out in constant force.\n\n2. She's divorced\n\nBut racism isn't the only thing that Meghan deals with.\n\nThe second most-frequently heard objection is that she is divorced, while Harry has never married.\n\nThe critics are conveniently forgetting that Princes Charles and Andrew are also divorced, as is Princess Anne. American first marriages still fail at a rate of 40 per cent to 50 per cent, although the British divorce rate has been dropping.\n\n3. Unbelievably, her fashion\n\nCommenters also have taken Meghan apart for her hairstyle, and fashionably loose-fitting clothing. It doesn't help that she's far more fashion forward than Kate, whose pristine public style often seems to have been voted on by a committee.\n\n4. She 'dumped' her rescue dog\n\nFourth is an objection from animal lovers, who bemoan the fact that she left one of her aged rescue dogs behind when she moved to London from Toronto.\n\n5. She's American\n\nI'm putting her American nationality at fifth, although you might argue that it should rank higher. Lots of us thought that the Royal wedding might cement and repair the \"special relationship\" between the US and Britain — our best for their best.\n\nBut that theory seems as much in tatters as the current political climate. Apparently, Harry was supposed to pick a red, white and blue bride echoing the British flag, not ours.\n\nI've seen Facebook comments from my own American friends asking, \"Why isn't Harry marrying a British girl?\"\n\nThere is plenty of sniping as well from British ex-pats who predict the marriage won't make it past five years, and accuse Meghan of being a gold digger.\n\n6. She's a TV actress\n\nThat final critique applies to Meghan's choice of an acting career. To be honest, I've never watched Suits, save for a glimpse at an episode or two to see what she did on the show.\n\nIn an era when quality television programs have swept over the networks, cable television and streaming services, Suits remains a guilty pleasure for its viewers and a skippable one for the rest of us.\n\nMeghan might be a talented actress, with university degrees in drama and international affairs, but she's never been showcased in the kind of TV that scoops up Emmy Awards and BAFTAs.\n\nWould it make people feel better if Harry was instead marrying one of the better young actresses of our time, such as Emma Stone, Saoirse Ronan or Margot Robbie? Possibly.\n\nIt hasn't gone unremarked that Meghan seems all too willing to ditch her acting career for activism. She won't be like Princess Grace, who fended off many efforts to entice her back to film. For Meghan, been there, done that, now on to charity work.\n\nBut a slightly better professional resume might have quieted some of the haters. If you take all the complaints together, it adds up to one angry beehive. Says Kelley:\n\n\"The volume of comments that couldn't be published on the blogs or that had to be deleted on the respective Facebook pages is far beyond anything I anticipated.\"\n\nAll these reasons might not matter a whit historically. Thanks to the birth of Kate and Williams' children, Harry is way down in the line of succession, so there's only a miniscule chance of a King Harry and Queen Meghan.\n\nThus far, the pair have managed to smile their way through every crisis that takes place, including whether Meghan's father, sadly in poor health, will walk her down the aisle.\n\nBut Meghan has married her prince at a time when the world is divided about almost everything, including her.\n\nUnwittingly, that makes her the perfect Royal bride for our times.\n\nMicheline Maynard is an American journalist and author who threw a breakfast party to watch Princess Diana's wedding, but slept through William and Kate's.\n\nTopics: royal-and-imperial-matters, television-broadcasting, television, internet-culture, popular-culture, united-states, england, united-kingdom\n\nFirst posted", "images": ["https://res.abc.net.au/bundles/2.5.0/images/logo-abc@2x.png", "http://www.abc.net.au/cm/lb/6388890/data/facebook-data.png", "https://www.abc.net.au/news/image/12152572-16x9-220x124.png", "https://res.abc.net.au/bundles/2.5.0/images/icon-search-grey@1x.png", "http://www.abc.net.au/cm/lb/9730574/data/etiquette-custom-image-data.jpg", "http://www.abc.net.au/cm/lb/8458084/data/applenews-data.png", "https://www.abc.net.au/news/image/9761800-3x2-700x467.jpg", "https://res.abc.net.au/bundles/2.5.0/images/icon-menu-grey@1x.gif", "http://www.abc.net.au/cm/lb/4745996/thumbnail/news-podcasts-sidebar-graphic-promo-thumbnail.jpg", "https://www.abc.net.au/news/image/9765966-3x2-700x467.jpg", "https://www.abc.net.au/radio/image/12027716-16x9-220x124.jpg", "http://www.abc.net.au/cm/lb/10757972/data/messenger-data.png", "https://www.abc.net.au/news/image/9765966-16x9-700x394.jpg", "http://www.abc.net.au/cm/lb/6389052/data/youtube-data.png", "http://secure-au.imrworldwide.com/cgi-bin/m?ci=abc-aust&cg=0&cc=1&ts=noscript", "https://www.abc.net.au/news/image/3845350-3x4-340x453.jpg", "https://www.abc.net.au/news/image/9074930-16x9-220x124.jpg", "http://www.abc.net.au/cm/lb/6389068/data/instagram-data.png", "http://www.abc.net.au/cm/lb/8212704/data/news-logo2017-data.png", "https://www.abc.net.au/news/image/9281204-3x2-340x227.jpg", "https://www.abc.net.au/news/image/12150960-16x9-220x124.jpg", "http://www.abc.net.au/cm/lb/6388894/data/twitter-data.png", "https://www.abc.net.au/news/image/9328490-3x2-700x467.jpg", "https://www.abc.net.au/news/image/9398032-3x2-700x467.jpg", "http://www.abc.net.au/cm/lb/8212706/data/news-logo-2017---desktop-print-data.png"], "top_img": "https://www.abc.net.au/news/image/9765966-16x9-700x394.jpg", "keywords": [], "authors": ["Australian Broadcasting Corporation"], "canonical_link": "https://www.abc.net.au/news/2018-05-17/meghan-markle-american-tv-actresses-prince-harry-windsor-castle/9766742", "title": "Meghan Markle: Six reasons why she divides people — even Americans", "meta_data": {"title": "Six reasons Meghan Markle divides people — even Americans", "description": "Meghan Markle has faced plenty of venom on both sides of the Atlantic, in the form of racism, slights on her acting career and even criticism she callously left her rescue dog behind in the rush to shack up with Prince Harry, writes Micheline Maynard.", "keywords": "meghan markle, prince harry, royal wedding, suits, actress meghan markle, hollywood, ivy league", "ICBM": "38,-97", "geo.position": "38;-97", "ContentId": 9766742, "ABC.site": "ABC News", "ABC.editorialGenre": "News & Current Affairs", "ABC.tags": "royal-and-imperial-matters;television-broadcasting;television;internet-culture;popular-culture", "ABC_WCMS_sitesearch_include": "true", "twitter": {"card": "summary", "image": "https://www.abc.net.au/news/image/9765966-16x9-700x394.jpg", "site": "@ABCNews"}, "ABC.productionUnit": "Features", "ABC.ContentType": "CMArticle", "DC.Publisher.CorporateName": "Australian Broadcasting Corporation", "DC.rights": "https://www.abc.net.au/conditions.htm#UseOfContent", "DC.rightsHolder": "ABC licensed", "DC.type": "Opinion", "DC.title": "Six reasons Meghan Markle divides people — even Americans", "DC.creator.CorporateName": "Australian Broadcasting Corporation", "DC.date": "2018-05-17T09:54:31+1000", "DC.format": "text/html", "DC.identifier": "https://www.abc.net.au/news/2018-05-17/meghan-markle-american-tv-actresses-prince-harry-windsor-castle/9766742", "DC.language": "en-AU", "DC.subject": "Human Interest:Royal and Imperial Matters;Information and Communication:Broadcasting:Television Broadcasting;Arts and Entertainment:Television;Information and Communication:Internet Culture;Arts and Entertainment:Popular Culture", "DCTERMS.issued": "2018-05-17T09:54:31+1000", "DCTERMS.modified": "2018-05-19T21:32:37+1000", "DCTERMS.spatial": "east=-97;north=38", "og": {"title": "Six reasons Meghan Markle divides people — even Americans", "description": "Meghan Markle has faced plenty of venom on both sides of the Atlantic, in the form of racism, slights on her acting career and even criticism she callously left her rescue dog behind in the rush to shack up with Prince Harry.", "url": "https://www.abc.net.au/news/2018-05-17/meghan-markle-american-tv-actresses-prince-harry-windsor-castle/9766742", "image": {"identifier": "https://www.abc.net.au/news/image/9765966-16x9-700x394.jpg", "type": "image/jpeg", "width": 700, "height": 394}, "type": "Article", "updated_time": "2018-05-19T21:32:37+1000", "site_name": "ABC News"}, "article": {"published_time": "2018-05-17T09:54:31+1000", "modified_time": "2018-05-19T21:32:37+1000", "publisher": "https://www.facebook.com/abcnews.au", "author": "https://www.abc.net.au/news/micheline-maynard/9597156", "tag": "Popular Culture"}, "apple-mobile-web-app-title": "ABC News", "fb": {"pages": 72924719987}}, "movies": [], "publish_date": 1526486400.0, "source": "http://www.abc.net.au", "summary": ""}