{"url": "https://hollywoodlife.com/2017/04/09/the-arrangement-episode-6-season-1-recap-kyle-cheats-megan/", "text": "Just when Kyle West gets his life together, Terence has to go and ruin his progress. On the April 9 episode of ‘The Arrangement,’ Kyle’s ex professes her love for him, Megan’s director just won’t let her go, and Kyle goes to great lengths to save Terence.\n\nI need an assistant like Kyle has. Nate organizes Kyle’s entire life from his clothes to food to getting a pair of special roller skates off Ebay. Apparently, Kyle was a jam skater back in the day and has to hone his skills before an interview.\n\nAs Megan and Kyle are having breakfast, Lisbeth calls. Kyle doesn’t answer, but you can tell he’s caught off guard. He goes to Terence to talk it out. Lisbeth is going on TV for an interview. According to the terms of the agreement she signed, she’s not supposed to contact Kyle at all.\n\nTerence is pissed that Lisbeth is back in Kyle’s life. She’s a liability. He warns Kyle that she “knows everything about you that nobody is supposed to know.” As much as Terence wants to get involved, Kyle wants to set his own boundaries with Lisbeth. He can’t act like his past doesn’t exist. He admits to Terence that he’s already called Lisbeth back and wished her well.\n\nThe reason for Lisbeth’s call isn’t coincidental. She’s broke and has been kicked off a movie for being late and having meltdowns. She’s spiraling and wants to drag Kyle down with her.\n\nDon’t Be Stupid\n\nMeanwhile, Megan and the director, Nate, are still flirting as they work on the play. Leslie notices and gives Megan a lecture. More than anything else, Megan is under contract and has it made being Kyle’s girlfriend. Don’t be stupid, Leslie advises.\n\nMegan winds up listening to Lisbeth’s interview. Even though she left Kyle on their wedding day, she declares that Kyle is the love of her life! Kyle walks in on Megan listening to all of this and assures her that Lisbeth’s confession doesn’t change anything. “You’re the center of my world,” he says. “That’s not changing.” However, he does basically admit that he’s not completely over Lisbeth. At least he’s being honest!\n\nTerence has an even bigger problem on his hands than Lisbeth. The LAPD detective stops by IHM again to tell Terence that a body’s been found, and she thinks it’s Sophie, Kyle’s former therapist and booty call. Terence, what the heck did you do?!\n\nNate is so in love with Megan. He truly thinks they’re meant to be together and wants her to leave Kyle. She can’t believe what she’s hearing and thinks he’s crazy. This is the same girl who met Kyle West and went to Mexico with him on the same day. She walks out, but Nate ends up in the car. He pleads with her to drive to the desert to spend one night together to see what they have.\n\nThis guy is a stage 5 clinger. Run, Megan, run! Suddenly, a car rear ends them. It’s same car who followed Megan at the bonfire! Megan immediately goes to Kyle and asks if Terence is having her followed. He secretly knows that Terence has been because he goes to confront his mentor the next day at the Institute. He interrupts Terence talking with the security guy, Connor, who killed Sophie.\n\nBlast From The Past\n\nKyle demands that Terence stop having Megan followed. Kyle swears Megan’s not hiding anything and won’t hurt him. Terence storms out. His life is starting to spiral. It just gets worse. When Terence and Connor meet up to talk it out again, Connor shoots himself in the head in front of Terence.\n\nLater, Lisbeth stops by Kyle’s place. Kyle keeps her at a distance, but she manages to get under his skin. “I meant every word,” she tells him about the interview. “I love you. I always will.”\n\nKyle doesn’t say anything like, “I don’t love you anymore.” No, all he says is, “You left.” They kiss! Kyle tells her, “You left. We can’t go back.” Lisbeth urges Kyle that if he wants his relationship with Megan to work, then stay away from Terence and the Institute. If he wants to ruin his relationship, she’s always available.\n\nKyle ends up buying Megan a new Maserati, partly because she needed one and likely because he’s feeling guilty about Lisbeth. While this may seem like an over-the-top present, this is nothing for Kyle. He can afford 100 Maseratis.\n\nA Deal Made By The Devil\n\nTerence meets with the detective. The Sophie case is pretty much closed, but she’s not letting it go. She knows there’s something going on. He’s willing to pay her any amount of money, but she doesn’t want that. She wants something else, rather someone else. The detective wants to have sex with Kyle. That’s all. If Kyle agrees, she’ll drop the investigation.\n\nKyle refuses at first, but Terence goes for the jugular. He tells Kyle to remember everything he’s fixed for him. “I made you and I love you, but I will end you in a heartbeat if I have to,” he says. BOOM. So that’s where Terence really stands.\n\nIn case you didn’t already know, Anika is batsh*t crazy. She initiates a racy rendezvous with Deann in the car, but things take a turn when Anika starts CHOKING Deann! But Deann doesn’t run in the other direction. After the studio tells that Kyle’s directorial debut film isn’t happening, she goes to Anika’s to let loose.\n\nMegan professes her love to Kyle and reveals how happy she truly is with him just as he’s about to do something really shady. To make everything worst, Terence watches the whole encounter between Kyle and the detective. He’s taking creepy to an insanely dark and twisted level. Terence is disgusting. Kyle should get an Oscar for his performance.\n\nWhen it’s over, the light in Kyle’s eyes have darkened. He looks lost. He still makes it to Megan’s play. Megan is incredible. Kyle cries in the audience, but not about Megan’s performance. He’s crying about what he just did and how he has to keep it from Megan. Just when Kyle gets himself out of a hole, Terence pushes him in another one.\n\nHollywoodLifers, what did you think of tonight’s episode of The Arrangement? Let me know!", "images": ["https://i2.wp.com/www.sheknows.com/wp-content/uploads/2020/04/what-i-learned-as-a-17-year-old-girl-in-the-boy-scouts.jpg?resize=230%2C135&ssl=1", "https://pmchollywoodlife.files.wordpress.com/2020/04/rolling-stones-performance-one-world-nbc-ftr.jpg?w=143&h=80&crop=1", "https://scstylecaster.files.wordpress.com/2020/04/bean-bag-chairs.jpg?resize=230%2C135", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=hollywoodlife.com&path=%2F2017%2F04%2F09%2Fthe-arrangement-episode-6-season-1-recap-kyle-cheats-megan%2F&ct=article&lob=hollywoodlife&loc=us&env=desktop&post_id=2542143", "https://pmchollywoodlife.files.wordpress.com/2020/04/lady-gaga-performance-one-world-nbc-ftr.jpg?w=143&h=80&crop=1", "https://pmchollywoodlife.files.wordpress.com/2015/02/avery_arya.jpg?w=64&h=64&crop=1", "https://pmchollywoodlife.files.wordpress.com/2017/04/the-arrangement-tv-recap-ftr-5.jpg", "https://pmchollywoodlife.files.wordpress.com/2018/06/hl_logo.png?w=128", "https://i1.wp.com/www.rollingstone.com/wp-content/uploads/2020/04/office-chairs.jpg?resize=230%2C135&ssl=1", "https://pmchollywoodlife.files.wordpress.com/2020/04/taylor-swift-then-vs-now-shutterstock-ftr.jpg?w=143&h=80&crop=1", "https://pmctvline2.files.wordpress.com/2020/04/lady-gaga-one-world-together-at-home.png?resize=230%2C135", "https://pixel.quantserve.com/pixel?a.1=p-6fKiDaopTGEQg&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://i0.wp.com/www.indiewire.com/wp-content/uploads/2020/04/10546188dy.jpg?resize=230%2C135&ssl=1", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://pmchollywoodlife.files.wordpress.com/2017/04/the-arrangement-tv-recap-ftr-5.jpg", "keywords": [], "authors": ["Avery Thompson", "Melody Fewx", "Lana Parker", "Nick Caruso", "Oscar Hartzog", "Ryan Lattanzio", "Entertainment Director"], "canonical_link": "https://hollywoodlife.com/2017/04/09/the-arrangement-episode-6-season-1-recap-kyle-cheats-megan/", "title": "‘The Arrangement’ Recap: Terence Forces Kyle Down A Dark Path", "meta_data": {"description": "Just when Kyle West gets his life together, Terence has to go and ruin his progress. On the April 9 episode of 'The Arrangement,' Kyle's ex professes her love for him, Megan's director just won't let her go, and Kyle goes to great lengths to save Terence.", "news_keywords": "The Arrangement, TV recaps", "apple-itunes-app": "app-id=1400650284", "generator": "WordPress.com", "og": {"type": "article", "title": "‘The Arrangement’ Recap: Terence Forces Kyle Down A Dark Path", "url": "https://hollywoodlife.com/2017/04/09/the-arrangement-episode-6-season-1-recap-kyle-cheats-megan/", "description": "Just when Kyle West gets his life together, Terence has to go and ruin his progress. On the April 9 episode of ‘The Arrangement,’ Kyle’s ex professes her love for him, Megan&#8217…", "site_name": "Hollywood Life", "image": {"identifier": "https://pmchollywoodlife.files.wordpress.com/2017/04/the-arrangement-tv-recap-ftr-5.jpg", "width": 600, "height": 396, "alt": "The Arrangement Episode 6"}, "locale": "en_US"}, "article": {"published_time": "2017-04-10T03:00:20+00:00", "modified_time": "2017-04-10T03:00:21+00:00"}, "twitter": {"site": "@HollywoodLife", "text": {"title": "‘The Arrangement’ Recap: Terence Forces Kyle Down A Dark Path"}, "image": {"identifier": "https://pmchollywoodlife.files.wordpress.com/2017/04/the-arrangement-tv-recap-ftr-5.jpg?w=600", "alt": "The Arrangement Episode 6"}, "card": "summary_large_image", "creator": "@https://twitter.com/avery__thompson", "title": "‘The Arrangement’ Recap: Terence Forces Kyle Down A Dark Path", "description": "Just when Kyle West gets his life together, Terence has to go and ruin his progress. On the April 9 episode of 'The Arrangement,' Kyle's ex professes her love for him, Megan's director just won't let her go, and Kyle goes to great lengths to save Terence."}, "author": "Avery Thompson", "fb": {"pages": 94724837471}, "application-name": "Hollywood Life", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Latest Hollywood Celebrity & Entertainment News", "msapplication-task": "name=Subscribe;action-uri=https://hollywoodlife.com/feed/;icon-uri=https://pmchollywoodlife.files.wordpress.com/2018/06/hl_logo.png?w=16", "onesignal": "wordpress-plugin", "msapplication-TileImage": "https://pmchollywoodlife.files.wordpress.com/2018/06/hl_logo.png?w=128"}, "movies": [], "publish_date": 1491667200.0, "source": "https://hollywoodlife.com", "summary": ""}