{"url": "www.thehollywoodgossip.com/2018/01/mandy-teefey-speaks-out-mother-of-selena-gomez-wants-to-quash-fe/", "text": "Selena Gomez is back with Justin Bieber.\n\nPlenty of people aren't thrilled with her choice, but her mom Mandy Teefey got so upset that she had a breakdown and was hospitalized over it.\n\nNobody worries like your mom worries, folks.\n\nBut now, Mandy Teefey is opening up and setting the record straight about some of the wild stories about her feud with Selena.\n\nSelena Gomez has been through so, so much.\n\nShe's waging an uphill battle against Lupus that, at times, seems to rob her of her strength and her ability to live her life.\n\nAt present, her rumored feud with her mother doesn't seem to be doing her any favors, either.\n\nWhile no one questions that Mandy Teefey isn't exactly over the moon about the revival of Jelena, some of the stories that have been floating around about their mother-daughter tensions have been ... quite something.\n\nLike rumors that Selena was living with her mother and that her mom had somehow imposed a curfew upon her 25-year-old millionaire celebrity daughter in order to interfere with her romance.\n\nOr rumors that she's \"demanded\" that Selena get a breathalyzer test while dating Bieber, which ... doesn't make any sense. (Selena's no alcoholic)\n\nSpeaking to Gossip Cop, Mandy Teefey wants to clear things up. First, she talks about Selena's battle with Lupus.\n\n\"When you are young, you feel invincible and she had to learn that she was not able to be your typical 20 year old.\"\n\nThat is so sad. But, of course, Mandy is so glad that Selena received a life-saving kidney transplant.\n\n\"Beyond blessed that we had Francia in our life,\" she said.\n\nFrancia Raisa made a truly powerful, selfless choice. And a dangerous one. Having a kidney removed is no joke.\n\nMandy says that, during the surgery, she was a \"wreck inside not only for my daughter, but for Francia and her family.\"\n\nOf course. That had to be a weird feeling. And, understandably, Mandy was very, very emotional throughout the ordeal.\n\n\"I am pretty sure I am banned from that hospital [now].\"\n\nThat's a lot of nice stuff about Francia, but ... how does Mandy describe Selena?\n\n\"Brave and fearless.\"\n\nAbsolutely. To share her struggle with Lupus with the world, to share the news of her kidney transplant surgery, is a big deal.\n\nBut living her life every day, to the fullest, the way that Selana does is truly an act of courage.\n\n\"I was so proud of her bravery.\"\n\nRemember, folks -- that kidney transplant wasn't a cure. Lupus has treatments, but no cure. And Selena's case of Lupus seems to be especially severe.\n\nSo, now that she's being directly interviewed, how does Mandy feel about Selena's latest reunion with the Biebs?\n\n\"Not happy.\"\n\nThat much, we knew, but it sure would have been interesting if Mandy were pretending that it's totally fine.\n\n\"Selena can live her life however she wants as long as she is happy, safe, and healthy.\"\n\nThose are some very reasonable caveats.\n\nBut the relationship that she describes having with Selena isn't exactly the feud that we've been hearing about.\n\n\"Every mother and daughter has disagreements.\"\n\nAnd Mandy denies that her relationship with her daughter began to crumble in 2014 when she stopped being Selena's manager.\n\nWe'd heard reports that Selena's reunion with Bieber was just one source of conflict.\n\n\"We never expected to manage her her whole life. We lost family time because the only time we saw her, we talked business.\"\n\nWe were going to say that sounds like no fun, but Mandy beat us to it.\n\n\"It was no longer fun for any of us, like it was when she was younger and we had to be with her because she was a minor.\"\n\nMandy sounds determined to quash the feud rumors, saying of Selena:\n\n\"She is 25 years old and knows what is at stake with her health. I do not control her the way it has been portrayed.\"\n\nWell, surely no one really believed that Mandy was somehow giving her adult millionaire celebrity daughter a curfew.\n\n\"Selena is an adult and can make her own choices.\"\n\nThat's very true. We don't have to agree with Selena's choices in order to like her, folks.", "images": ["https://www.thehollywoodgossip.com/assets/logo-white-beee066818238b0eb075767349f71cae.png", "https://the-hollywood-gossip-res.cloudinary.com/iu/s--9PDUdgDt--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1515684701/attachment/selena-gomez-mandy-teefey-split.png"], "top_img": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--9PDUdgDt--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1515684701/attachment/selena-gomez-mandy-teefey-split.png", "keywords": [], "authors": ["Simon Delott"], "canonical_link": "https://www.thehollywoodgossip.com/2018/01/mandy-teefey-speaks-out-mother-of-selena-gomez-wants-to-quash-fe/", "title": "Mandy Teefey Speaks Out; Selena Gomez, Mom Look to Quash Beef Rumors", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 277650442346327}, "og": {"site_name": "The Hollywood Gossip", "type": "article", "url": "https://www.thehollywoodgossip.com/2018/01/mandy-teefey-speaks-out-mother-of-selena-gomez-wants-to-quash-fe/", "title": "Mandy Teefey Speaks Out; Selena Gomez, Mom Look to Quash Beef Rumors", "description": "Selena Gomez's mother, Mandy Teefey, is speaking out in light of the rumored feud between the two of them over Selena dating Justin Bieber.", "image": {"identifier": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--p-rpE4xx--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1394537659/selena-gomez-justin-bieber-instagram-embrace.png", "type": "image/png", "width": 630, "height": 516}}, "article": {"published_time": "2018-01-16T11:22:42-05:00", "modified_time": "2018-01-16T11:35:14-05:00", "tag": "Celebrity Gossip", "author": "Simon Delott"}, "twitter": {"site": "thgossip", "card": "summary_large_image", "title": "Mandy Teefey Speaks Out; Selena Gomez, Mom Look to Quash Beef Rumors", "description": "Selena Gomez's mother, Mandy Teefey, is speaking out in light of the rumored feud between the two of them over Selena dating Justin Bieber.", "image": {"src": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--9PDUdgDt--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1515684701/attachment/selena-gomez-mandy-teefey-split.png"}}, "description": "Selena Gomez's mother, Mandy Teefey, is speaking out in light of the rumored feud between the two of them over Selena dating Justin Bieber."}, "movies": [], "publish_date": 1516119762.0, "source": "http://www.thehollywoodgossip.com", "summary": ""}