{"url": "www.dailymail.co.uk/news/article-4684414/Fergie-denies-organising-Beckhams-Buckingham-Palace-party.html", "text": "Advertisement\n\nThe Duke of York 'footed the bill' for Harper Beckham's party which took place at his own private residence in the palace, it has been claimed.\n\nAnd it is not the first time such a party has taken place, despite criticism that Prince Andrew and his former wife Sarah Ferguson were 'treating Buckingham Palace like a theme park'.\n\nA royal source told MailOnline all members of the Royal Family have private quarters in the palace and that guests 'come and go all the time' for private events they fund themselves.\n\nDavid and Victoria's youngest child enjoyed a day at the Queen's residence last week alongside Princess Eugenie and a large group of school friends, with her parents uploading the photos to Instagram on Monday, her sixth birthday.\n\nA representative for the Beckham family yesterday claimed it was Fergie - a long-time friend of their family - who extended the invitation, telling MailOnline: 'Let me be very clear this was a private tea party last week that the Duchess of York organised.'\n\nHowever, the Duchess' official spokesman has distanced her from the sole responsibility of organisation, suggesting Andrew and the whole family were behind the controversial function and that her ex-husband was 'footing the bill', which led to outrage from the Queen's former press secretary, among others.\n\nScroll down for video\n\nThat's some party venue: Harper Beckham holds her balloon at Buckingham Palace. her parents shared the snaps on Instagram on Monday as they wished her a happy sixth birthday, but denied the visit was for the milestone\n\nFriends in high places: Once inside, she posed with her friends and Princess Eugenie in a small drawing room inside the palace at the event, which was organised by the Duchess of York\n\nSomething to say: David later shared another post in which he defended the special party, saying 'this wasn't the palace opening the gates for Harper's birthday party'\n\nProud: David shared another snap of himself cuddling his daughter, who was wearing a cream lace dress after seemingly getting changed\n\nThe Duchess of York (bottom left) is a longstanding friend of the Beckhams and is seen with Victoria (far right) and other Spirce Girls Mel C and Mel B back in 1999\n\nAmong other Instagram tributes from the family, her brother Cruz wrote: 'Dear Harper I can't believe it has been already 6 years yoyo are such a big girl so to the best sister in the world I love you so much have a amazing day'\n\nShe's so loved: Her eldest brother Brooklyn shared this picture, posting: 'Happy birthday to my little sister. Love you so much'\n\nHer spokesman said: 'The Duke of York and the York family hosted a private event at the private apartments of the Duke at Buckingham Palace which was privately catered.'\n\nHe said it was not the Duchess' doing but was a 'private family event' which he said was a 'small family tea'.\n\nThe unprecedented step has divided opinion over the Beckham's seemingly preferential treatment and Dickie Arbiter, the Queen's former press secretary, was highly critical of the party.\n\nHe told the Times: 'What a nonsense. What are they doing there? What is Eugenie having a party there for? What is Sarah York doing, having organised it — allegedly? None of them has got a right to be there. Is it being opened up as a theme park? It devalues what the place is all about.\n\n'Why can't Joe Public, when they go in on the Buckingham Palace tour, why can't there have their pictures taken in the quadrangle?\n\n'That sets a precedent. They don't allow cameras in the summer opening and people can't just walk out in the quadrangle and pose for photographs. So why do the Beckhams get special treatment?'\n\nThe 'indiscreet' publication of the pictures – showing the youngster enjoying the run of the royal residence – caused frustration at the Palace. One image was taken by the former footballer inside Andrew's private office with Princess Eugenie, it is understood.\n\nA royal source added: 'Any costs in terms of refreshments were covered [by Andrew] privately.'\n\nIt is understood that both Andrew and his former wife, the Duchess of York, were at the party.\n\nSources close to the Duchess of York insisted it was a 'family' event, with the invitation being extended by the whole of the York family.\n\n'Members of the Royal Family often invite friends for tea at the palace and the Beckhams are family friends. This was a treat for Harper and some of her friends,' the source said.\n\nHowever, they admitted that the Beckhams' decision to publish photos had not gone down well.\n\n'It was very indiscreet for them to have posted pictures on a public forum of what was a private family event,' they said.\n\nSweet: Harper's mother, Victoria, also shared a Snapchat which showed the enormous pile of presents her daughter received (left)\n\nSomething to say: Some comments were not quite as favourable\n\nGorgeous: While Romeo shared another sweet snap, writing: 'Happy birthday to the best sister in the world!!!!!! I hope you have an amazing day. I love you so much'\n\nEugenie, 27, who is eighth in line to the throne, can be seen kneeling down with her arms around two of Harper's five friends.\n\nUnderneath the picture, David wrote: 'Lucky Harper meeting a real life princess at the Palace x.'\n\nHarper also dressed like royalty for the occasion – in a blue gown like her heroine Princess Elsa from the hit Disney film Frozen.\n\nDetails of the supposedly 'private' tea party were shrouded in secrecy until yesterday morning, when both David and Victoria Beckham decided to treat their combined 55million followers on Instagram to a series of photographs to mark Harper's birthday.\n\nAnother photograph shows Harper on her own, holding a red balloon in the Palace's central quadrangle, with the message from mother Victoria: 'Our little birthday princess x Kisses.'\n\nAs the pictures went viral – being viewed several million times within hours – both the Beckhams and Buckingham Palace came under fire online. One critic wrote: 'If you have enough money you can buy anything!!'\n\nAnother said: 'Is this a new commercial venture by the Royal Family or do all little princesses now get an invite?'\n\nSweet: The boys all helped to put a doll's house together for their youngest sibling\n\nWell wishers: Lots of fans wrote kind messages alongside the latest posts\n\n'Happy birthday baby girl': Victoria, 43, had taken to Instagram to document the celebrations that took place ahead of her daughter Harper's sixth birthday on Monday\n\nRoyal author Robert Jobson last night warned that Buckingham Palace should not be seen as a 'party venue for millionaires', particularly when the Queen is about to receive £370million of public money for a top-to-toe refit.\n\nHe said: 'It seems odd to me that if you have the money or connections then the Palace – a building funded by the British taxpayer – can be used in this way for a selected few. If it is just for the rich and famous it is simply not right.\n\n'The Palace is the venue for glittering state occasions but when it is used – or misused like this – surely the public is entitled to know how it came about, who organised it, was money paid and why it is only open to rich and famous ex-footballers.'\n\nThe sports star yesterday posted a further picture of himself and Harper at the Palace, this time with his mother Sandra.\n\nFamily day: The fashion designer shared a group shot of herself, David and their loved ones as they got together to mark Harper's special day\n\n'Posh Spice or Dawn French?': Victoria revealed she and her footballer beau had been trying out their cake decorating skills, but appeared to mock David's efforts with her fans\n\nHe wrote: 'One last picture of the birthday girl ... Just to be clear this wasn't the Palace opening the gates for Harper's birthday party, this was a tea party where us and other guests were invited, so it was a beautiful thing to do with my mum, Harper plus a few school friends... We were honored [sic] to be able to [be] there...'\n\nAsked to explain why the tea party was held, a Buckingham Palace spokesman confirmed the 'private' event.\n\nHe said: 'From time to time members of the Royal Family who reside at royal residences invite guests to visit privately.'\n\n'Mums had a little too many Pimms!': David, meanwhile, suggested everybody had been in high spirits at the bash as he poked fun at his mother Sandra\n\nLoving life: It's not the first time the Beckhams have been at the palace. Victoria received an OBE for her contribution to fashion from the Duke of Cambridge back in April\n\nProud moment: Victoria's husband-of-17-years David received his OBE at Buckingham Palace in 2003 for services to football, with Victoria by his side\n\nLovely: Sources close to the family told MailOnline before Christmas that Victoria, 42, was 'delighted and humbled for the recognition' when she picked up her gong\n\nClose: Meanwhile, in an interview with Esquire magazine back in 2012, David said that he now counts Princes William and Harry as friends - pictured in 2010\n\nVIP invite: David and Victoria arriving at Westminster Abbey for the wedding of Prince William to Kate Middleton, in London, UK on April 29, 2011\n\nOde: The famous family also nicknamed their former £10million Hertfordshire residence 'Beckingham palace,' before putting it up for sale in 2013\n\nThe Duchess of York is no stranger to controversy, after she was secretly filmed offering to sell access of Prince Andrew for £500,000\n\nThe Duchess of York is no stranger to controversy, after she was secretly filmed offering to sell access to Prince Andrew for £500,000.\n\nA News of the World video in 2010 showed Sarah Ferguson promising to introduce an undercover reporter posing as a wealthy businessman to the Prince, who has been the UK's special representative for international trade and investment since 2001.\n\nDuring a covert film of the agreement, the Duchess was apparently handed a $40,000 US (£27,000) cash down payment.\n\nShe was filmed telling him how to transfer £500,000 to her UK bank account and said: 'Then that, is then like, then you open up all the channels whatever you need, whatever you want, and then that's what and then you meet Andrew and that's fine. And that's, that's when you really open up whatever you want.'\n\nThe paper said that, despite the Prince knowing nothing about the deal, the Duchess claimed to have discussed it with him: 'Andrew said to me, 'Tell him £500,000'.\n\n'He knows that he's had to underwrite me up to now because I've got no money. So if you want to meet him in your business, look after me and he'll look after you ... you'll get it back tenfold.'\n\nThe Duchess later said she was 'devastated' and 'regretful' about the incident.", "images": ["https://i.dailymail.co.uk/i/pix/2017/07/10/19/42300DFD00000578-4681190-Well_wishers_Lots_of_fans_wrote_kind_messages_alongside_the_late-a-91_1499712333659.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/11/10/4225FAE800000578-4684414-_Posh_Spice_or_Dawn_French_Victoria_revealed_she_and_her_footbal-a-16_1499765859466.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/10/11/423060DF00000578-4681190-image-a-103_1499682261057.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/20/27331384-0-image-a-22_1587150056520.jpg", "https://i.dailymail.co.uk/i/furniture/misc/logo_cookie_reg.png", "https://i.dailymail.co.uk/i/pix/2017/07/10/19/422FE7C000000578-4681190-image-a-83_1499712333341.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/10/16/09B76129000005DC-4681190-image-m-3_1499699815988.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/11/09/4236FF0C00000578-4684414-image-a-4_1499762099773.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/10/19/423060F600000578-4681190-Sweet_The_boys_all_helped_to_put_a_doll_s_house_together_for_the-a-88_1499712333367.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/11/10/4225FB2400000578-4684414-image-a-14_1499765859072.jpg", "https://i.dailymail.co.uk/1s/2020/04/18/10/27348844-0-image-a-6_1587203459353.jpg", "https://i.dailymail.co.uk/1s/2020/04/16/18/27283520-0-image-a-13_1587059349556.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/10/19/4231CE9500000578-4681190-image-a-90_1499712333655.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/10/19/42266BB100000578-4681190-_Mums_had_a_little_too_many_Pimms_David_meanwhile_suggested_ever-a-96_1499712334223.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/10/08/422F816500000578-0-image-a-6_1499671868649.jpg", "https://i.dailymail.co.uk/i/sitelogos/logo_mol.gif", "https://i.dailymail.co.uk/i/pix/2017/07/10/19/422FD93E00000578-4681190-Lovely_Sources_close_to_the_family_told_MailOnline_before_Christ-a-100_1499712335693.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/10/19/4231DF5500000578-4681190-image-a-82_1499712333341.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/11/10/422FFC1E00000578-4684414-Close_Meanwhile_in_an_interview_with_Esquire_magazine_back_in_20-a-18_1499765859626.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/13/27316454-0-image-a-18_1587125714890.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/19/27330756-0-image-a-6_1587148551167.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/10/13/4231B90D00000578-4681190-image-a-123_1499689489981.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/10/08/422F740B00000578-0-image-m-3_1499671993882.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/15/27321548-0-image-a-37_1587134123891.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/10/11/422FEA7600000578-4681190-image-a-85_1499680971499.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/11/10/42300DF900000578-4684414-image-a-15_1499765859402.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.dailymail.co.uk/i/pix/2017/07/10/11/422FA8E100000578-4681190-That_s_some_party_venue_Harper_Beckham_got_the_royal_treatment_i-a-78_1499680971300.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/10/19/422FD9FA00000578-4681190-Loving_life_It_s_not_the_first_time_the_Beckhams_have_been_at_th-a-97_1499712335355.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://i.dailymail.co.uk/1s/2020/04/18/09/27348120-0-image-a-6_1587200255933.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/10/11/422FA8F700000578-4681190-Her_brother_Cruz_wrote_Dear_Harper_I_can_t_believe_it_has_been_a-a-81_1499680971335.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/11/10/42274D9B00000578-4684414-Family_day_The_fashion_designer_shared_a_group_shot_of_herself_D-a-12_1499765858972.jpg", "https://i.dailymail.co.uk/i/furniture/facebook/DailyMail/DailyMail.png", "https://i.dailymail.co.uk/i/pix/2017/07/10/11/423060E800000578-4681190-image-a-102_1499682251654.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/11/10/42377EB500000578-0-image-a-21_1499765865611.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/10/11/422FAB4700000578-4681190-Proud_David_shared_another_snap_of_himself_cuddling_his_daughter-a-95_1499682176254.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/11/27313170-0-image-m-25_1587119028862.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/10/19/4225FAF100000578-4681190-_Happy_birthday_baby_girl_Victoria_43_had_taken_to_Instagram_to_-a-92_1499712333779.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/10/19/422FEA7A00000578-4681190-Something_to_say_Some_comments_were_not_quite_as_favourable-a-86_1499712333363.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/10/08/422F79AC00000578-0-image-a-15_1499673180342.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/10/19/4231DF4D00000578-4681190-image-a-81_1499712333340.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/11/10/422FD97D00000578-4684414-Proud_moment_Victoria_s_husband_of_17_years_David_received_his_O-a-11_1499765858688.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/01/27298132-0-image-a-10_1587083448170.jpg", "https://i.dailymail.co.uk/1s/2020/04/16/19/27283952-0-image-m-10_1587059996422.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/10/11/422FAC2800000578-4681190-She_s_so_loved_Her_eldest_brother_Brooklyn_shared_this_sweet_sna-a-86_1499680971512.jpg", "https://i.dailymail.co.uk/1s/2020/04/16/13/27269924-0-image-a-34_1587041887123.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/10/11/422FB35E00000578-4681190-Friends_in_high_places_Once_inside_she_posed_with_her_friends_an-a-79_1499680971305.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/10/19/422FA9C800000578-4681190-Gorgeous_While_Romeo_shared_another_sweet_snap_writing_Happy_bir-a-87_1499712333365.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/11/10/4231CCBD00000578-4684414-image-a-17_1499765859614.jpg", "https://i.dailymail.co.uk/1s/2020/04/17/20/27332258-0-image-a-25_1587151978215.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/11/10/4231DF5900000578-4684414-image-a-13_1499765859035.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/11/10/422FF8D100000578-4684414-Ode_The_famous_family_also_nicknamed_their_former_10million_Hert-a-19_1499765859792.jpg", "https://i.dailymail.co.uk/i/pix/2017/07/10/19/422FFD4200000578-4681190-VIP_invite_David_and_Victoria_arriving_at_Westminster_Abbey_for_-a-99_1499712335679.jpg"], "top_img": "https://i.dailymail.co.uk/i/pix/2017/07/11/10/42377EB500000578-0-image-a-21_1499765865611.jpg", "keywords": [], "authors": ["Rebecca English", "Rebecca English Royal Correspondent", "Susie Coen For The Daily Mail", "Paddy Dinham For Mailonline"], "canonical_link": "https://www.dailymail.co.uk/news/article-4684414/Fergie-denies-organising-Beckhams-Buckingham-Palace-party.html", "title": "Fergie denies organising Beckhams' Buckingham Palace party", "meta_data": {"keywords": "dailymail,news,Victoria Beckham,David Beckham", "news_keywords": "dailymail,news,Victoria Beckham,David Beckham", "original-source": "https://www.dailymail.co.uk/news/article-4684414/Fergie-denies-organising-Beckhams-Buckingham-Palace-party.html", "description": "David and Victoria's youngest child enjoyed a day at the palace last week with a large group of school friends, and the photos were posted to Instagram on Monday, her sixth birthday.", "channel": "News", "doc-class": "Living Document", "verify-v1": "DXwlrsxbqxSv+FTFkWUfgflBvFJfx2YbNf/HmABrVyY=", "msvalidate.01": "12E6B4B813EB44C9BFC8F6A21F1D01F5", "y_key": "1a7e912afbfcab2f", "MSSmartTagsPreventParsing": "true", "twitter": {"account_id": 15438913, "card": "summary_large_image", "title": "Fergie denies organising party for the Beckhams at Buckingham Palace", "description": "David and Victoria's youngest child enjoyed a day at the palace last week with a large group of school friends, and the photos were posted to Instagram on Monday, her sixth birthday.", "url": "https://www.dailymail.co.uk/news/article-4684414/Fergie-denies-organising-Beckhams-Buckingham-Palace-party.html", "image": "https://i.dailymail.co.uk/i/pix/2017/07/11/10/42377EB500000578-0-image-a-21_1499765865611.jpg", "app": {"id": {"iphone": 384101264, "ipad": 400442503}}}, "articleid": 4684414, "author": "Rebecca English", "divclasspage": "articlePage", "mol": {"headline": "Andrew isn't the only Royal to host private parties... 'guests are coming and going all the time'! Duke 'footed the bill' for Harper Beckham princess tea, and it's not the first time such an event has taken place"}, "article": {"publisher": "https://www.facebook.com/DailyMail", "published_time": "2017-07-11T09:34:35+0100", "modified_time": "2017-07-11T18:56:22+0100", "section": "News", "tag": "Fergie denies organising Beckhams Buckingham Palace party", "author": "https://www.facebook.com/DailyMail"}, "mobile-web-app-capable": "yes", "fb": {"app_id": 146202712090395, "pages": "1622758588037001,164305410295882"}, "og": {"site_name": "Mail Online", "title": "Fergie denies organising party for the Beckhams at Buckingham Palace", "type": "article", "description": "David and Victoria's youngest child enjoyed a day at the palace last week with a large group of school friends, and the photos were posted to Instagram on Monday, her sixth birthday.", "url": "http://www.dailymail.co.uk/~/article-4684414/index.html", "image": {"identifier": "https://i.dailymail.co.uk/i/pix/2017/07/11/10/42377EB500000578-0-image-a-21_1499765865611.jpg", "width": 636, "height": 382}, "video": {"identifier": "https://videos.dailymail.co.uk/video/mol/2017/04/21/9087066864224940920/1024x576_MP4_9087066864224940920.mp4", "type": "video/mp4", "width": 636, "height": 358}}, "al": {"android": {"url": "dailymail-fb://article/4684414/", "package": "com.dailymail.online", "app_name": "Daily Mail Online"}, "ios": {"url": "dailymail-fb://article/4684414/", "app_store_id": 384101264, "app_name": "MailOnline"}}}, "movies": [], "publish_date": 1499762075.0, "source": "http://www.dailymail.co.uk", "summary": ""}