{"url": "https://tv.avclub.com/how-mtv-s-the-challenge-became-one-of-tv-s-most-rivetin-1798284279", "text": "The cast of Battle Of The Exes II\n\nFor most of the history of television, the barrier to syndication—and to profitability—has been 100 episodes. The shows that have made it to that mark are an unusual group. Many were big hits. Some found small cult audiences. Still others just hung on as best they could and never posted numbers quite low enough to be canceled. In 100 Episodes, we examine the shows that made it to that number, considering both how they advanced and reflected the medium and what contributed to their popularity. This entry covers MTV’s The Challenge, which started in 1998 and completed its 26th season this year.\n\nAdvertisement\n\nMTV’s long-running reality competition The Challenge has earned a reputation for stasis due to the frequency with which the same cohort of Bunim-Murray Productions alumni participates. For 17 years and 26 seasons, reality pioneer Bunim-Murray has been rounding up cast members from its Road Rules and The Real World franchises and pitting them against each other for cash and prizes, often with the same faces returning again and again. Although the lack of cast churn makes The Challenge seem static, the show has evolved more dramatically than any reality competition on the dial. Shows like Big Brother and Top Chef remain more or less identical to how they began. Meanwhile, The Challenge has changed its format, its host, and even its genre. It has gone from being an average, competent reality-adventure show to a heavily serialized, reality-based workplace drama.\n\n\n\nThe Challenge technically premiered in June 1998, but its earliest incarnation couldn’t be more different than what the show is now. The debut season didn’t even have the word “challenge” in its title. Road Rules: All Stars was Bunim-Murray’s first formal cross-pollination of its successful reality brands, and it grew out of a playful franchise rivalry in which each season’s Road Rules gang would try to prank the Real World cast currently in production. All Stars followed Road Rules’ standard format except that instead of a group of collegiate unknowns, an assorted quintet of former Real World housemates teamed up for an action-packed road trip with the promise of a “handsome reward” awaiting them at the final destination. All Stars had no eliminations, duels, or cash prizes, and the primary draw was watching Real World’s spoiled homebodies in more taxing, goal-focused scenarios. The show didn’t feature bone-crushing physical challenges, and was instead fueled by Amazing Race-style travel excursions such as sheep shearing and spending the night in a purportedly haunted mental hospital.\n\nThe Road Rules facsimile format remained intact until the fifth season, 2002’s Real World/Road Rules Challenge: Battle Of The Seasons, in which the producers eliminated the Winnebago trips and began housing the cast in swanky, isolated villas. The new format inverted the show’s original concept; rather than expose the coddled Real World housemates to a relatively harsh life on the road, the Road Rules cast members were granted a taste of the tony Real World lifestyle. The change was all the more significant because of when it took place—as Bunim-Murray was in production on Real World: Las Vegas, the season in which that show completed its transformation from an earnest examination of difference to a boozy bacchanal. The massive success of the Las Vegas season, which embodied the city’s den-of-iniquity image, affirmed The Real World’s tonal shift. And as The Challenge started to resemble The Real World, it naturally developed its forebear’s appetite for hook-ups, blow-ups, and drunken debauchery.\n\n\n\nBy Battle Of The Seasons, The Challenge had gone from a friendly rivalry to a fierce competition after three seasons as a six-on-six face-off between teams representing Road Rules and Real World, a face-off Road Rules almost always won. Battle Of The Seasons kept the franchise rivalry component, but the cast was expanded considerably, up from 12 contestants to 32, each of them paired up with housemates from their respective seasons. Seasons was also the first year The Challenge tapped into the contestants’ greed. In the early seasons, even the six-on-six faceoffs, producers promised an extravagant reward for winning, but it’s framed as secondary to the friendships formed, fears conquered, and life lessons learned. Seasons incented its cast mates up front with a $300,000 cash pool.\n\nSeasons also offers early glimpses of the serialized storytelling that has come to characterize The Challenge at its best. In the third episode, “Musical Inner-Tube Tango,” the entire cast turns against Real World: Seattle alum Stephen Williams, who strong-arms his way to a victory in a pool game by allegedly hitting female competitors in the face. Anyone else might have been able to chalk up the behavior to heat-of-the-moment adrenaline, but not Williams, whose Real World legacy was an equally blithe assault on a female castmate. At that point, The Challenge’s internal continuity was in its infancy, but Williams’ radioactivity is an early example of how Real World and Road Rules mythology shaped The Challenge’s storytelling. Williams was later voted off, as Seasons introduced Survivor-style democratic eliminations to the show, which would later be replaced with sudden-death physical duels as elimination rounds.\n\nThe Challenge didn’t begin to take its present shape until its 12th season, 2006’s Real World/Road Rules Challenge: Fresh Meat. After shuffling hosting duties between an assortment of Bunim-Murray affiliates and X Games athletes, BMX biker T.J. Lavin was hired as The Challenge’s permanent host. As the subtitle suggests, Fresh Meat was the first Challenge season to feature newbies who had not appeared on The Real World or Road Rules. The concept was a risky one since the show had spent years emphasizing the appeal of familiar personalities exposed to unfamiliar stressors. But it was a necessary experiment given that the Road Rules cast pipeline was drying up after MTV placed Road Rules on hiatus due to its flagging ratings. Though there are currently more than 200 former Real World cast members, as opposed to only 90 Road Rules cast members, Road Rules experience is a better predictor of Challenge success. Bunim-Murray occasionally has great luck casting Real World housemates with athletic prowess, but the company has repeatedly said it doesn’t consider The Challenge when casting a Real World season. Road Rules is a magnet for the sporty, adventurous types that take especially well to The Challenge’s physical and mental endurance tests. Unsurprisingly, the new Fresh Meat cast members, the first to sign up specifically to appear on The Challenge, adapted well to the competition and became recurring contestants.\n\n\n\nFresh Meat was instrumental to The Challenge’s serialization, and marked the beginning of its evolution into a workplace drama. Fresh Meat (and 2010’s Fresh Meat II) gave The Challenge many of its most enduring characters, those who rose from unknowns to fan favorites as the show’s serialized storytelling took root. The new additions included Evan Starkman, Kenny Santucci, Evelyn Smith, and Diem Brown, who would go on to make a combined 29 appearances in 15 seasons of the show. The four of them have collided and collaborated over years of being put through The Challenge’s wringer, and they’ve forged emotionally complex relationships, as have many of the recurring cast mates.\n\nMany of those relationships formed in the following season, 2007’s Real World/Road Rules Challenge: The Duel, which premiered only a month after Fresh Meat’s finale and proved to be another seminal season in The Challenge’s evolution. The season marked the first appearance from the legendary Johnny “Bananas” Devenanzio, who made his first Challenge appearance almost immediately after shooting Real World: Key West. He was sent home in the first episode of the season, a humiliation he has seemingly dedicated his life to neutralizing. Since The Duel, Devenanzio has appeared in 11 seasons of The Challenge, sitting out only three times since becoming eligible to compete. He won five of the 11 seasons on which he appeared, thanks in part to essentially writing the rule book for The Challenge’s complex political and social dynamics.\n\nAdvertisement\n\nTo the extent The Challenge has a “main cast,” it began to form during The Duel. The season also featured Paula Meronek, one of Devenanzio’s Key West housemates, Fresh Meat’s Starkman and Santucci, Chris “C.T.” Tamburello of Real World: Paris, and Real World: Chicago’s Aneesa Ferreira, who if not for the zealous Devenanzio, would hold the title for most appearances with 10 seasons under her belt. And those are just a few of the Challenge diehards that appeared on The Duel. Of The Duel’s 20 competitors, 13 of them participated in at least five of the subsequent 10 seasons, and Devenanzio appeared in eight of the 10.\n\nThe conventional wisdom regarding The Challenge began to solidify at this point, with Bunim-Murray taking heat from fans and the press for allowing cast members to repeatedly circle back to the show, a practice that sets The Challenge apart from the typical, annually restocked reality competitions. The producers weren’t the only ones scrutinized. As The Challenge progressed with the polarizing Devenanzio as a near-constant presence, the cast members were frequently mocked. The conversation shifted to how ridiculous it was that, for cast members like Devenanzio and Ferreira, participating in The Challenge every season is what passes for steady employment in the age of reality stardom. That’s a fair criticism, but one that misses the point of what makes the show work. The Challenge isn’t like a job for its cast, it is a job, which is why it has developed the characteristics of a drama about a highly dysfunctional workplace.\n\nAdvertisement\n\nThe main cast members practically have lifetime appointments to the show because they’ve met the necessary job criteria, the most important of which is dedication to The Challenge. Cast members have to be available to be spirited away to Prague or Phuket with little notice and for an indefinite length of time, an unworkable arrangement for anyone with children or a traditional job. Participation in The Challenge is a fraught proposition for anyone in a happy, stable romantic relationship with someone outside the Bunim-Murray network. Relationships back home routinely crumble when the young, attractive, and boozy cast members convene, which is why cast members often talk about cutting all romantic ties before leaving to compete on the show.\n\nRecurring cast members are also required to have fiercely competitive natures, high thresholds for pain, and boundless enthusiasm for action sports. The Challenge has become a grueling, physical gauntlet in which painful injuries are par for the course. Each season builds to a triathlon-inspired race that takes the dizzying heights, deep waters, high altitudes, frigid temperatures, and endurance tests common to Challenge missions and amplifies them. The final missions are often so punishing, the show’s medical team is forced to rush in with stretchers and oxygen tanks to evacuate ailing competitors. Although Bunim-Murray theoretically has access to hundreds of potential candidates, the nature of the show makes participation unappealing, if not impossible, for all but those who have committed to making The Challenge their life’s work.\n\nAs The Challenge became a job for its best-known cast members, it took on the same dynamics of a workplace, complete with the constant formation and dissolution of strategic alliances, rivalries, friendships, and flings. The show developed a harsh, abusive workplace culture that, while awful, closely resembles traditional corporate environments. The Challenge’s office politics are due largely to Devenanzio’s influence, under which the Real World-Road Rules rivalry was supplanted by the idea that, irrespective of how they came to The Challenge, veterans must align against rookies. That shift turned The Challenge into a who-you-know game in which a lack of relationships outside the game makes upward mobility practically impossible for newbies.\n\n\n\nAdvertisement\n\nBackstabbing is rampant in The Challenge, and because of the cast continuity, grudges die hard. As experienced players, the cast members should have thick skin with regard to the game. Instead, they treat every maneuver that adversely affects them as a deeply personal slight. In The Challenge, a player’s vote to send another into an elimination duel is almost never viewed as a dispassionate strategic choice. It’s viewed as a referendum on the strength and quality of the relationship between the two. And those relationships don’t end when the cameras go off because so many of the cast members spend time together when the show is not in production. The Bunim-Murray network is infamously incestuous, and much of The Challenge’s cast maintains outside friendships, romantic relationships, and beefs with their Bunim-Murray colleagues. The interactions that aren’t documented become part of the mythology once the cameras are back on.\n\nThe serialized, workplace drama framework allows The Challenge to tell longitudinal relationship stories most reality competitions cannot. Unlike the relationships forged in a show like Survivor, a finite experience with complete strangers, the relationships in The Challenge have length and depth. The friendships endure, and the romantic pairings aren’t fly-by-night showmances, they’re refreshingly layered and messy. The producers have learned to capitalize on these relationships by conceptualizing seasons around them. In the Rivals and Battle Of The Exes seasons, cast mates are paired up based on past conflicts or ill-advised hook-ups, and must work through their differences to ensure their shot at the prize money. As cynical as the practice sounds, building The Challenge around its relationships yields real human drama, like in Brown’s relationship with Tamburello, which became The Challenge’s most affecting ongoing storyline.\n\n\n\nAdvertisement\n\nAfter appearing in Fresh Meat, Brown returned to participate in The Duel, which was filmed not long after Brown received a round of radiation therapy that sent her cancer into remission. She meets Tamburello, a Real World: Paris alum and future Challenge legend, and they take a shine to each other. Before long Brown and Tamburello are an item, and she’s crediting him with helping to restore the confidence and self-esteem she lost when her hair fell out due to chemotherapy. In one of The Challenge’s most poignant moments, Tamburello kisses Brown for the first time after encouraging her to remove her wig. Later, Brown gathers the courage to take off the wig during a mission, revealing the regrown pixie that had made her feel so self-conscious. Brown and Tamburello dated for a year and a half after The Duel, then broke up when Brown decided to focus on her career.\n\nAdvertisement\n\nGet More: The Challenge: Battle of the Exes 2, The Challenge: Battle of the Exes 2, Full Episodes\n\nHad Brown and Tamburello met on any other reality competition, they would have likely gone their separate ways. But as Challenge colleagues, they had to continue seeing each other whether or not their relationship was harmonious at the time. When they’re happy, they give the impression that they would have fallen in love no matter where or how they had met. When they fight, there’s genuine, relatable emotions on both sides. Tamburello was justifiably hurt when Brown chose her career over their relationship and declined to attend the funeral of his murdered brother. But empathizing with Brown was just as easy. It’s understandable that someone who spent years of her life fighting intractable ovarian cancer would experience anxiety about achieving her professional goals, and would dread attending a funeral for a young person whose life was cut short. The couple made its final appearance in this year’s Battle Of The Exes II, where they appear to be in a loving, peaceful place. But it doesn’t last long. Tamburello gladly leaves the competition with her when her illness leaves her unable to continue beyond the third episode. Brown died in November 2014, and Tamburello was by her side in her final days.\n\n\n\nAdvertisement\n\nBrown and Tamburello’s relationship is a perfect example of the serialization that makes The Challenge so fascinating at its best. After years of wringing drama out of shuffling strangers together, reality producers have slowly figured out that they don’t necessarily have to build character relationships from scratch every season. Just as it’s interesting to watch people forge new relationships under stressful circumstances, it’s also interesting to see already solid relationships tested in unexpected ways, which is why The Amazing Race became such a hit. Other reality competitions have flirted with recurring characters and novel character dynamics, but none has gone so far as The Challenge. Because of The Challenge’s workplace dynamic, it can offer the best of both worlds. New relationships take shape, then are either buttressed or bruised by continued participation in the game as alliances are negotiated and renegotiated.\n\nThe Challenge’s transformation hasn’t been completely for the better, and the same changes that bolstered the storytelling have also made the show’s tone and environment increasingly toxic. The show’s strong emphasis on athletic achievement is to blame. By making the missions so physically demanding, The Challenge producers rob themselves of the opportunity to cast older or less athletically gifted cast members. By contrast, Survivor, The Challenge’s only direct peer, has grown less physically arduous over its 30-season run. Survivor increasingly relies on puzzle challenges that, in addition to lending themselves to suspenseful, neck-and-neck editing, allow for a more generationally diverse group of competitors that has yielded winners as old as 57. This fall’s new season of Survivor will feature the oldest cast in the show’s history. The Challenge could never pull that off, which is a shame because one of the joys of this kind of show is seeing how cast members use their strengths, like charm or leadership, to compensate for their athletic weaknesses. In The Challenge, the only way to win is to win, and even the most estimable athletes often find themselves ill-prepared.\n\nAdvertisement\n\nGet More: MTV Shows\n\nThe focus on athleticism has made The Challenge a sporty boys club, subtly (when not outright) hostile toward women, the out-of-shape, the differently abled, and the uncoordinated. As the missions have gotten more physically taxing, there’s been an uptick in insults and verbal abuse directed at cast members who fall short during competition. It’s extremely common to hear contestants of both genders offering gendered exhortations like “be a man” and “grow some balls” if a player’s performance is lacking. In some cases even less is required, as in 2010’s The Challenge: Cutthroat, when a drunken Laurel Stucky unleashes a vicious tirade against fellow Fresh Meat alum Eric Banks—who isn’t even on her team—and shames him for being overweight. The incident takes place in a hot tub as two female cast mates make out nearby, making the clip a perfect miniature model of the Bunim-Murray brand.\n\n\n\nAdvertisement\n\nGet More: The Challenge (Season 20), Full Episodes\n\nLike Stucky’s heinous outburst, many of The Challenge’s interpersonal conflicts are fueled by alcohol, which the producers make readily available. Free-flowing booze has long been a fixture on The Real World, and bad choices have frequently ensued as a result of overconsumption. But the stakes are higher for The Challenge because the environment is defined by unchecked machismo and it’s all too easy for the sanctioned physical violence during a competition to spill over into an assault back at the villa. Fist fights are not uncommon in an average Challenge season, and people have been seriously injured in stupid, drunken skirmishes. One of the show’s most indelibly violent moments came in the 18th season, 2009’s The Ruins, when a surly, soused Brad Fiorenza provoked Darrell Taylor, a decision he would later come to regret after Taylor, a trained boxer, lost his composure and showered him with blows to the face. Both men were sent home, but in a reflection of a larger reality television trend, the producers have gotten increasingly lax over the years about how much physical violence between cast mates warrants direct intervention. No matter how violent a competitor’s past appearances on the show, they’re always welcomed back.\n\n\n\nAdvertisement\n\nGet More: The Challenge (Season 18), Full Episodes\n\nThe producers were recently accused of specifically failing to make The Challenge a safe environment for female cast members. Tonya Cooley, formerly of Real World: Chicago, filed a civil suit against MTV, Bunim-Murray, and cast mates Starkman and Santucci following her appearance on 2009’s Real World/Road Rules Challenge: The Ruins, alleging the men sexually assaulted her with a toothbrush while she was incapacitated and the producers made no attempt to stop it. The suit was later settled out of court, but fellow Ruins cast member Susie Meister attested to the allegedly unsafe environment in an essay, recalling a harrowing encounter during one of her four appearances on the show.\n\n\n\nDuring a previous season, two cast members drunkenly came into my bedroom, woke me up, and one of them climbed the ladder to my bunk bed. He later said he was just being “playful” and “having a good time,” but the behavior was still aggressive and unwelcome. After I said no, yelled no, and swore at him, he still refused to descend the ladder and leave the room. I punched him and he fell to the floor. The other cast members called for me to be sent home for violence and one male cast member said that “I shouldn’t come on these shows if I don’t want to party.” Almost everyone on the cast felt it was I, not he, who had acted inappropriately. I was not sent home, and production was supportive of me. I do not know if the reason I was not sent home was because I was defending myself or because the incident wasn’t caught on camera, and thus would have made my dismissal confusing for the show’s “plot.”\n\nAdvertisement\n\nMeister’s nuanced essay speaks to why The Challenge can be so alluring, even at its worst, and how producers managed to talk her into four appearances. She liked being told she was worth watching on television, and each time the producers assured her she had good odds of winning. She hates the job, but can’t resist whenever the bosses want to put her back on active duty, a description that probably applies to most of Meister’s colleagues. The shame of it is that while The Challenge was becoming a great workplace drama, it was also becoming a terrible workplace.\n\nIt’s a dysfunctional environment that should ring familiar for anyone who watched UnREAL, Lifetime’s terrifically dark drama set behind the scenes of a Bachelor-style reality dating competition called Everlasting. The Bachelor makes the perfect source material for UnREAL’s meditation on the massive gap between the romantic fantasy reality dating shows peddle and the ugly process of creating that fantasy. But in terms of how reality TV producers let their morals fall by the wayside, UnREAL is more thematically akin to The Challenge than it is to The Bachelor.\n\nAdvertisement\n\nMore often than not, participants in reality competitions do so once, then go on to lead normal lives with normal jobs. The Challenge’s elite players are lifers, far closer to being producers without the title than unwitting participants. Like UnREAL’s conflicted producer Rachel (Shiri Appleby), they must reconcile the guilt of being complicit in creating a toxic and frequently dangerous work environment with the tawdry thrills that come with participation. And like Rachel, they keep coming back for more. The show’s 27th season, currently in post-production, will feature a group mostly comprised of long-time Challenge staffers (including Devenanzio and Ferreira) paired with their blood relatives. At this point, The Challenge cast members are staying in an abusive relationship to collect paychecks, but that means the only difference between them and most working stiffs is a more heavily stamped passport.", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/bhk29ypwphjmujgxbw7b.jpg"], "top_img": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/bhk29ypwphjmujgxbw7b.jpg", "keywords": [], "authors": [], "canonical_link": "https://tv.avclub.com/how-mtv-s-the-challenge-became-one-of-tv-s-most-rivetin-1798284279", "title": "How MTV’s The Challenge became one of TV’s most riveting workplace dramas", "meta_data": {"google-site-verification": "P13oAn8o8LB6FVCJWKsHWXvxfbR-SJrmvox6EgULpUs", "ir-site-verification-token": "-1270174611", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0,maximum-scale=10.0", "ROBOTS": "INDEX, FOLLOW", "msapplication-square70x70logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/cfeerdkqdvairskc2jmv.png", "msapplication-square150x150logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_200,q_80,w_200/cfeerdkqdvairskc2jmv.png", "keywords": "TV, MTV, The Real World, The Challenge, Road Rules, 100 Episodes, TV Club", "news_keywords": "TV, MTV, The Real World, The Challenge, Road Rules, 100 Episodes, TV Club", "twitter": {"url": "https://tv.avclub.com/how-mtv-s-the-challenge-became-one-of-tv-s-most-rivetin-1798284279", "card": "summary_large_image", "site": "AVTVClub", "title": "How MTV’s The Challenge became one of TV’s most riveting workplace dramas", "description": "For most of the history of television, the barrier to syndication—and to profitability—has been 100 episodes. The shows that have made it to that mark are an unusual group. Many were big hits. Some found small cult audiences. Still others just hung on as best they could and never posted numbers quite low enough to be canceled. In 100 Episodes, we examine the shows that made it to that number, considering both how they advanced and reflected the medium and what contributed to their popularity. This entry covers MTV’s The Challenge, which started in 1998 and completed its 26th season this year.", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/bhk29ypwphjmujgxbw7b.jpg"}, "description": "For most of the history of television, the barrier to syndication—and to profitability—has been 100 episodes. The shows that have made it to that mark are an unusual group. Many were big hits. Some found small cult audiences. Still others just hung on as best they could and never posted numbers quite low enough to be canceled. In 100 Episodes, we examine the shows that made it to that number, considering both how they advanced and reflected the medium and what contributed to their popularity. This entry covers MTV’s The Challenge, which started in 1998 and completed its 26th season this year.", "og": {"title": "How MTV’s The Challenge became one of TV’s most riveting workplace dramas", "type": "article", "url": "https://tv.avclub.com/how-mtv-s-the-challenge-became-one-of-tv-s-most-rivetin-1798284279", "description": "For most of the history of television, the barrier to syndication—and to profitability—has been 100 episodes. The shows that have made it to that mark are an unusual group. Many were big hits. Some found small cult audiences. Still others just hung on as best they could and never posted numbers quite low enough to be canceled. In 100 Episodes, we examine the shows that made it to that number, considering both how they advanced and reflected the medium and what contributed to their popularity. This entry covers MTV’s The Challenge, which started in 1998 and completed its 26th season this year.", "locale": "en_US", "site_name": "TV Club", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/bhk29ypwphjmujgxbw7b.jpg"}, "fb": {"app_id": 280492615405243}}, "movies": ["/ajax/inset/iframe?id=youtube-video-BTKMRvINb4c&start=0", "/ajax/inset/iframe?id=youtube-video-5n3WfQqrMy4&start=0", "/ajax/inset/iframe?id=youtube-video-s2WDxVKt8Bc&start=0"], "publish_date": null, "source": "https://tv.avclub.com", "summary": ""}