{"url": "https://www.latimes.com/entertainment/tv/showtracker/la-et-st-the-keepers-20170524-story.html", "text": "They call themselves retired grandma Nancy Drews. One is a former emergency room nurse, the other a longtime elementary school teacher.\n\nThey make notes on coffee filters instead of index cards and wear clam diggers and sensible sneakers.\n\nBut thanks in part to the amateur sleuth work of Gemma Hoskins and Abbie Schaub, the 47-year-old unsolved murder of a young Catholic nun is gaining national attention. Earlier this year the Baltimore County Police Department conducted DNA tests on the exhumed body of a priest in relation to the case. And now, with the debut last Friday of Netflix’s “The Keepers,” the seven-part docu-series in which the two are central figures, Hoskins and Schaub are being treated like Cagney and Lacey.\n\nThe two were classmates at Archbishop Keough High School in the 1960s, where Sister Cathy Cesnik served as their teacher. But the nun disappeared suddenly on Nov. 7, 1969, after driving to a local shopping center to buy some Muhly’s dinner rolls, cash a paycheck and purchase an engagement gift for her sister. She never returned home, and her car was found directly across the street from where she lived, parked haphazardly, the rear jutting out into the road. The tires were caked with mud, and a twig hung from the steering wheel. The Muhly’s bag was still inside the vehicle.\n\nAdvertisement\n\nThe driveway across from Sister Cathy Cesnik’s apartment where her car was found abandoned. (Amy Kaufman / Los Angeles Times)\n\nCesnik’s body wasn’t discovered until Jan. 3, 1970, abandoned in a snowy, wooded area just a few miles from where she lived.\n\nHer death remained a sad, murky mystery until Hoskins got a call from a former Baltimore Sun reporter searching for anyone who had been a student of Cesnik’s.\n\nHoskins, wanting to help reporter Tom Nugent figure out who had hurt Cesnik, posted a message to a Facebook page for Keough High alumni, but was berated for muddying up a space usually filled with birth and anniversary announcements with such an unpleasant topic. One person, however, came to Hoskins’ defense: Schaub.\n\nAdvertisement\n\nIt wasn’t long before the two started a new Facebook group, this one seeking justice for Cesnik.\n\nAmateur sleuths\n\nHoskins has always liked true-crime stories; she’s watched “Dateline” and “20/20” every Friday night for years. But it wasn’t until this mystery turned up in her own backyard that she realized just how adept she was at detective work.\n\nThe grave site of Father Joseph Maskell shortly after his body was exhumed on Feb. 28, 2017. (John Benam)\n\nFollowing tips often submitted through the Facebook page, Hoskins and Schaub began seriously investigating Cesnik’s death, which led to the theory explored in “The Keepers” that the teacher was killed after students confided in her about sexual abuse taking place at Keough. Numerous subjects interviewed by Hoskins and Schaub say they were molested by Father Joseph Maskell, who served as the school’s chaplain, counselor and religion teacher.\n\nAdvertisement\n\nThe two made a good team: Schaub, the retired nurse, had a knack for research. Through Google, she learned how to access public records, digging up old court documents, sifting through microfilm and even filing Freedom of Information Act requests. She kept all of her findings in organized spreadsheets and file folders, some days working for up to 10 hours on the investigation.\n\nHoskins, meanwhile, preferred to do the face-to-face work. If a new Maskell survivor popped up, she’d be the one to go and conduct the interview. She wasn’t afraid of knocking on doors or flirting to get information.\n\nGemma Hoskins sits on her patio with her dog, Teddy. (Amy Kaufman / Los Angeles Times)\n\n“Gemma and I are opposite souls,” explains Schaub, 65, who was on a vacation in West Virginia the week before the release of “The Keepers.” “She is outgoing, confident and knows everybody in the community. I am far more of an introvert. I am keen to find substantive, hard facts. I want to see a paper trail. I don’t really like cold-calling people. So her strengths are my weaknesses.”\n\nAdvertisement\n\nDirector Ryan White, who began work on the series after the release of his and Ben Cotner’s 2014 documentary, “The Case Against 8,” immediately saw cinematic potential in the pair. But it wasn’t always smooth sailing. Often he and Hoskins would butt heads. She jokes that she told White she was quitting the project about a dozen times.\n\n“We always knew Gemma would come back, so I never took her seriously,” he says with a laugh as he rides inside a car making its way through Baltimore’s suburbs. He’s showing a reporter key spots from “The Keepers”: Keough’s soon-to-be-shuttered campus (now plastered with “no trespassing” signs and patrolled by security guards), the haunted house-esque rectory where the priest Maskell once lived, Cesnik’s apartment and the shopping village where she was last seen, which is now home to both a Family Dollar and a Dollar General store.\n\nA ‘no trespassing’ sign has been posted at the entrance of Seton Keough High School. (Amy Kaufman / Los Angeles Times)\n\n“Can we stop at Dunkin’ Donuts?” White asks, halting the tour to pull into a drive-through and pick up the drink that fueled him throughout production: A large black cold brew.\n\nAdvertisement\n\n“This was not fun to make,” he says, sipping on his iced coffee. “It’s been very eye opening for me about an institution that I had respect for and had a very positive experience with. I was raised with values by my mom in that church. It’s been very disappointing.”\n\nSchaub feels the same way. For one, she’s been disheartened to learn how difficult it is to get information from public sources. She recently put her daughter’s name on an outstanding FOIA request in case she dies before the government gets back to her. And talking to scores of sexual abuse victims has taken a toll.\n\nIt’s been worrisome. I’ve lost a lot of sleep. It’s a very strange twist of life, but something in me says I have a duty and obligation to see this through. Abbie Schaub\n\n“I have always struggled whether or not it was a good thing to open this Pandora’s box of pain and misery and memories, because I have been concerned that reopening this might be more emotional pain and someone might hurt themselves and the outcome would be a bad one,” she admits. “It’s been stressful. It’s been worrisome. I’ve lost a lot of sleep. It’s a very strange twist of life, but something in me says I have a duty and obligation to see this through.”\n\nAdvertisement\n\nUnearthing the past\n\nHoskins’ journey began with the motivation to find justice for Cesnik, but grew into a quest to expose long-buried secrets of sexual abuse by Father Maskell against some of her fellow Keough classmates.\n\nShe had no idea about the molestation allegations until two anonymous women — Jane Doe and Jane Roe — filed a $40-million civil lawsuit against Maskell in 1994. The case was thrown out because the statute of limitations had expired.\n\nAt school, Hoskins had never had much interaction with Maskell. She thought he was just a nerdy priest.\n\nAdvertisement\n\n“He reminds me of — what is that new show that Kiefer Sutherland is in? ‘Designated Survivor’! You know how nerdy he looks in that? That’s Maskell, exactly,” she says, sitting in a rocker inside the Ocean City apartment she shares with her dog, Teddy, an Australian labradoodle.\n\nIt was when she learned that the Maskell allegations might be tied to Cesnik that Hoskins took a greater interest in the case. As a teenager, she’d been terrified of the nuns who taught at her all-girls private school. They were old and serious, the white headdresses framing their faces so tightly it looked painful. There was a rumor that one of them didn’t have any toes.\n\nThe apartment building where Sister Catherine Cesnik last lived. (Amy Kaufman / Los Angeles Times)\n\nBut Cesnik was different. She was in her 20s, pretty and charismatic. She used the Socratic method and bused her students to downtown Baltimore to see a production of Franco Zeffirelli’s “Romeo and Juliet.” Hoskins felt so close to her that when school let out for the summer, she and some classmates took a pizza over to the nun’s apartment.\n\nAdvertisement\n\nIt was the last time Hoskins would see the woman who inspired her to become an elementary school teacher. When she found out about the murder, she felt sick.\n\n“The idea of her laying there for two months just makes me want to scream,” she says, “because she was so special. I can’t imagine her beautiful body and face — her presence — laying in the snow. It wasn’t right.”\n\nToday, a small metal placard has been drilled onto an ivy-covered tree near where Cesnik’s body was found:\n\nIn Memory Of\n\nAdvertisement\n\nCathy Cesnik\n\n1942 — 1969\n\nwith Love & Appreciation!\n\nIt would be hard to find the memorial if you weren’t with someone who had been there before. The tree is located on private land, hidden about 50 yards off the street in some woods thick with underbrush.\n\nAdvertisement\n\n“Back when Cathy was found, this was just a place where people dumped their garbage. All these trees weren’t here,” says White, pointing through the greenery.\n\nHe estimates he’s been to this spot, about 20 minutes south of downtown Baltimore, 50 times since he started working on “The Keepers.” His mother was raised just a few miles from here, and his aunt was a student at Keough. In 2014, when Jane Doe revealed her identity — Jean Hargadon Wehner — members of White’s family realized they’d been childhood friends with her and passed along the news.\n\nA placard to commemorate Sister Cathy Cesnik has been placed on a tree in the area where her body was found. (Amy Kaufman / Los Angeles Times)\n\n“Mom is constantly sending me bad articles as ideas for documentaries,” says White, 35, who lives in Los Angeles’ Atwater Village. “She definitely hit it out of the park with this one.”\n\nAdvertisement\n\nThough he’d left the church by the time he went to college at Duke University, White was raised a staunch Catholic. He was a eucharistic minister, assisting the priest in giving out communion. His youth group traveled to Honduras every couple of years on mission trips.\n\nSo making a story set in Baltimore, a city with deep ties to the religion, piqued his interest. He set up a meeting with Wehner, who became central to the series, and soon began traveling to the city for a week every month, staying in his uncle’s attic for free.\n\nA safe place\n\nSince filming on the documentary was finished, Hoskins, after 64 years of living in Baltimore county — and seeing Schaub several times a week — decided to move permanently to Ocean City. It’s a resort town where hundreds of thousands of tourists crowd the sand during the summer, picking up steamed crabs and salt water taffy on the wooden boardwalk.\n\nHoskins feels safe here. Her diabetes is causing her eyesight to deteriorate, and she no longer has peripheral vision. Soon, she won’t be able to drive. But she’ll be able to use the local mobility van for free. And she can see the ocean from the patio of her two-bedroom place, which she’s filled with shabby chic decor. There’s a lot of distressed wood and aquamarine. The couch has a tropical palm leaf print. In the corner, there’s a chair she upholstered with the T-shirt she bought at a Billy Joel and Elton John concert.\n\nAdvertisement\n\nA chair Gemma Hoskins made from a concert t-shirt of Elton John and Billy Joel. (Amy Kaufman / Los Angeles Times)\n\nIt also makes for a good place to study. She recently decided to pursue a criminal justice degree through a local community college. She can take courses online from her rocker and just finished criminology this spring. When she graduates, she’d like to start working for a private investigator.\n\nLooking back on the last few years, Hoskins feels confident that she and Schaub have made a dent in the cold case. Recently, she says, Baltimore County Police Officer Robin Teal asked to meet with them to hear about what kind of information they’d gathered. (Teal did not respond to a request for comment.)\n\n“She told us, ‘You have done my homework for me,’” says Hoskins. “As we were leaving, she said we’d given her some really good smoking guns. She calls me probably once a week. But we just hope it isn’t a PR thing because of the documentary.”\n\nAdvertisement\n\nGemma Hoskins’ living room in Ocean City, Maryland. (Amy Kaufman / Los Angeles Times)\n\n“The Keepers” has garnered strong reviews from critics and is already inciting the Archdiocese of Baltimore. On its Facebook page, the organization says it does not “dispute the abuse committed by Fr. Maskell, but ‘The Keepers’ premise and conclusion are wrong.” It also published a lengthy question-and-answer segment discussing the archdiocese’s “Efforts to Protect Children and Promote Healing for Victims of Abuse.”\n\nIt’s for this very reason that Hoskins thinks “The Keepers” could end up having a bigger impact than recent crime stories like “Making a Murderer,” “The Jinx” and “Serial.”\n\n“This is something in a really sad, distraught world that everybody can agree on: Who wants to see children hurt?” she says. “This is something that has nothing to do with politics or where you live. It’s doing the right thing for kids. … How can that not be a good thing? I think that with Cathy dying so young, she could have had such an impact on our lives — but she’s having a bigger one now. And maybe that was the way it was supposed to be. My life is so rich because of hers.”\n\nAdvertisement\n\nInvestigating Cesnik’s death, Hoskins says, has given her purpose. Her husband died when she was 35, and she’s fought loneliness ever since. She was only with him for five years — a relationship that took her completely by surprise. At 30, she was single and overweight, facing a future of health struggles because of her diabetes. But then she met Ernie, a bearded Kenny Loggins-lookalike with an affinity for flannel. He was so taken with her that one day, when she left a box of tampons in the bathroom, he drove to the elementary school where she taught just to drop them off.\n\nHis devotion perplexed her. “He must think I have money,” she thought.\n\nBut Ernie had his own issues. Before they’d met, he’d fallen off a telephone pole on the job for a local cable company and accidentally kicked himself in the groin. Now, one of his testicles was the size of an orange.\n\nIt was cancer, and by the time Hoskins insisted he visit the doctor, it had already metastasized.\n\nAdvertisement\n\nStill, they wed. She stayed by his side until his death in 1989.\n\n“I think he’s got his hand on my shoulder all the time. And Cathy — I think she’s driving the bus,” she says, her eyes watering. “My teeth are in this thing. I love that woman and [Maskell] was a monster and I’m going to see what I can do about it. I feel like this is what I’m here for.”\n\namy.kaufman@latimes.com\n\nFollow me on Twitter @AmyKinLA\n\nAdvertisement\n\nALSO\n\nRobert De Niro, Michelle Pfeiffer wrestle with the tragic tale of Bernie Madoff in HBO’s ‘Wizard of Lies’\n\nIt took Robin Swicord 10 years to get a directing job after ‘The Jane Austen Book Club.’ Why?\n\n‘13 Reasons Why’ is affecting America’s classrooms. Teachers tell us their stories\n\nAdvertisement\n\nFor Amy Schumer’s ‘Snatched,’ it was Goldie Hawn as mom or bust", "images": ["https://ca-times.brightspotcdn.com/dims4/default/90aafcf/2147483647/strip/true/crop/2048x1152+0+0/resize/840x473!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F84%2F6b%2F2e488b5999d6a947b7ab62bc1b26%2Fla-1495153806-63qdas74cd-snap-image", "https://ca-times.brightspotcdn.com/b9/f5/1c9278c94a439e28f5150c679d6f/logo-full-black.svg", "https://ca-times.brightspotcdn.com/dims4/default/ddd067e/2147483647/strip/true/crop/1600x900+0+0/resize/840x473!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ff0%2Fb1%2Fb2f180e9641d36fe23ac2a99fe3a%2Fla-1495169150-q1hcofditj-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/60aaa3d/2147483647/strip/true/crop/1600x900+0+0/resize/840x473!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa9%2F4b%2F3c8a18b182abdfc6d67e114fd1dc%2Fla-1495167668-gc3xicuq3w-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/6e4f356/2147483647/strip/true/crop/2048x1151+0+0/resize/840x472!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F8c%2F6a%2F4a5dcc219dd8679e15041e32548c%2Fla-1495152443-tkk1f0vz8l-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/dd334c3/2147483647/strip/true/crop/2048x1152+0+0/resize/840x473!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F45%2F60%2F55a4293304351885028d9180dff0%2Fla-1495153448-q6n9etupzm-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/e8289be/2147483647/strip/true/crop/2048x1152+0+0/resize/840x473!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F3b%2F44%2Faaae1e13ca21cb41e2c17d9754e0%2Fla-1495153600-gge60bkrja-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/c623a81/2147483647/strip/true/crop/1152x1152+448+0/resize/100x100!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F1a%2F31%2F28f0d171a9c1a821bbd43fae6356%2Fimg-535db9e3-turbine-la-bio-amy-kaufman", "https://ca-times.brightspotcdn.com/dims4/default/37cae55/2147483647/strip/true/crop/2048x1075+0+38/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F89%2F21%2F3fd0565aa3bc3b65384c10acae24%2Fla-1495597177-jyonb5faeq-snap-image", "https://ca-times.brightspotcdn.com/0e/c6/b86a8b4b43a793259deb28a32a56/latlogoinverse.svg", "https://ca-times.brightspotcdn.com/dims4/default/9a5447d/2147483647/strip/true/crop/2048x1152+0+0/resize/840x473!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F89%2F21%2F3fd0565aa3bc3b65384c10acae24%2Fla-1495597177-jyonb5faeq-snap-image", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://ca-times.brightspotcdn.com/dims4/default/74a4c4e/2147483647/strip/true/crop/2048x1152+0+0/resize/840x473!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fc1%2Fff%2F93282442f3a076d23a7d43008287%2Fla-1495154255-ovlt0i7ny5-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/f8c066e/2147483647/strip/true/crop/2048x1152+0+0/resize/840x473!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fec%2F03%2F91b069b68ba231f7ad6f5f10c198%2Fla-1495153952-31s518h7gk-snap-image"], "top_img": "https://ca-times.brightspotcdn.com/dims4/default/37cae55/2147483647/strip/true/crop/2048x1075+0+38/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F89%2F21%2F3fd0565aa3bc3b65384c10acae24%2Fla-1495597177-jyonb5faeq-snap-image", "keywords": [], "authors": ["Staff Writer", "Amy Kaufman Covers Film", "Celebrity", "Pop Culture At The Los Angeles Times. She Is The Author Of The New York Times Bestseller", "Bachelor Nation", "Inside The World Of America S Favorite Guilty Pleasure."], "canonical_link": "https://www.latimes.com/entertainment/tv/showtracker/la-et-st-the-keepers-20170524-story.html", "title": "Meet the ‘grandma Nancy Drews’ behind ‘The Keepers,’ Netflix’s newest true-crime series", "meta_data": {"og": {"title": "Meet the 'grandma Nancy Drews' behind 'The Keepers,' Netflix's newest true-crime series", "url": "https://www.latimes.com/entertainment/tv/showtracker/la-et-st-the-keepers-20170524-story.html", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/37cae55/2147483647/strip/true/crop/2048x1075+0+38/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F89%2F21%2F3fd0565aa3bc3b65384c10acae24%2Fla-1495597177-jyonb5faeq-snap-image", "url": "https://ca-times.brightspotcdn.com/dims4/default/37cae55/2147483647/strip/true/crop/2048x1075+0+38/resize/1200x630!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F89%2F21%2F3fd0565aa3bc3b65384c10acae24%2Fla-1495597177-jyonb5faeq-snap-image", "width": 1200, "height": 630, "type": "image/jpeg", "alt": "la-1495597177-jyonb5faeq-snap-image"}, "description": "They call themselves retired grandma Nancy Drews.", "site_name": "Los Angeles Times", "type": "article"}, "article": {"author": "https://www.latimes.com/people/amy-kaufman", "content_tier": "metered", "published_time": "2017-05-24T10:00:00", "opinion": "false", "section": "Television"}, "twitter": {"card": "summary_large_image", "creator": "@AmyKinLA", "description": "They call themselves retired grandma Nancy Drews.", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/0715803/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F89%2F21%2F3fd0565aa3bc3b65384c10acae24%2Fla-1495597177-jyonb5faeq-snap-image", "alt": "la-1495597177-jyonb5faeq-snap-image"}, "site": "@latimes", "title": "Meet the 'grandma Nancy Drews' behind 'The Keepers,' Netflix's newest true-crime series"}, "fb": {"app_id": 119932621434123, "pages": 5863113009, "profile_id": "latimesent"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=5", "description": "The story of the two amateur sleuths so central to the Netflix docu-series 'The Keepers,' about the 47-year-old unsolved murder of a young Catholic nun.", "keywords": "unsolved murder, Gemma Hoskins, Abbie Schaub, Cathy Cesnik,The Keepers, Baltimore, Netflix, abusive priests, Sister Cathy, Archbishop Keough High School", "brightspot.contentId": "00000169-0cb8-dbbe-a16f-4ef855810000", "brightspot.cached": "false"}, "movies": [], "publish_date": 1495555200.0, "source": "https://www.latimes.com", "summary": ""}