{"url": "https://wwd.com/beauty-industry-news/beauty-features/think-tank-ces-beauty-11105784/", "text": "To say that technology has “disrupted” beauty is an understatement. Our personal-care devices are all connected — and the quality of biometric data they are able to collect has doubled. Whether it’s how we brush our hair or our teeth, beauty tools can track the behaviors and patterns of our daily life. At the same time, technologies like smart mirrors, augmented reality and machine learning are making the consumer experience more intuitive, custom and inspiring than ever before. But this is all just a foreshadowing of what’s coming next.\n\nThis year at CES — the annual mecca for technology and innovation — Beauty Tech stole the spotlight with five trends that are sure to reshape consumer decisions and preferences forever. The beauty routine is about to get a massive digital makeover — and only those who stay ahead of the curve will survive.\n\nDIY Beauty\n\nDIY is rapidly invading the beauty space — making it likely that the beauty expert as we now know it might soon be irrelevant. Technologies designed to put consumers in charge of their own skin emerged this year at CES: from intelligent masks and moisture sprays that put spa-quality facial treatments in the palm of your hand to a bespoke skin-care formulator that lets you create your own cream. The customer is becoming the creator, empowered to create their own fresh, chemical-free cosmetics, not to mention 3-D-printed custom nails.\n\nAll this is aimed at saving people time while tackling concerns over the transparency of ingredients, offering a clean and high-quality solution to consumers. And in an age when brands are losing customers due to a lack of personalization, customizability matters — both to consumers and the beauty marketers seeking to keep sales strong.\n\nDemocratized Dermatology\n\nSpeaking of saving time, personal skin readers mark the dawn of a new era for consumers, dermatologists and beauty companies alike. A simple scan or even a selfie is all consumers need to analyze and understand their unique skin condition, as well as to receive personalized skin-care recommendations. Powered by artificial intelligence, these devices are able to go as deep as the inner skin and make recommendations based on variables like hydration or melanin levels. Skin-based UV sensors will also be able to soon protect us from overexposure to the sun, having developed so quickly that they now come in the form of nail stickers.\n\nWith such level of awareness and prevention, consumers are bound be become much more knowledgeable about their skin health. And with some of these scanners treating wrinkles, blemishes, or dark spots directly — they might replace dermatologists altogether sometime in the near future.\n\nContextualized Reflection\n\nWhat’s not going away anytime soon? Smart mirrors. Using artificial intelligence and augmented reality, they allow consumers to virtually try on lipstick and eye shadow by projecting the products onto their reflection. Although AR for cosmetics isn’t new, it was the premise of an expanded experience that made its debut at CES this year: real-time beauty contextualization. Smart mirrors will be everywhere — retail, airports, as well as in your bathroom and hotel room — and they will become an integral part of consumers’ daily beauty routine. The new models not only identify the exact shade of foundation you need based on your face or complexion, but also based on sunlight, weather and other contextual factors such as fashion, makeup or vegan trends on social media. That’s not it: Smart mirrors will also let you virtually change your hair color and pair your look with clothing and accessories. Last but not least, they will also provide beauty training through interactive touch or a voice assistant integration.\n\nEnabling commerce via smart mirrors, screens and glass could be a cash cow for beauty brands; after all, offering a seamless purchase option immediately after a virtual try-on is a smart way to close the loop. Partnering with manufacturers seems like the most logical step in making this a reality, but beauty brands must not forget the importance of investing in owning contextual data. Beauty consumers like to be relevant in context — whether it’s for everyday usage, if they’re traveling, or going to an event.\n\nIntuitive Merchandizing\n\nSmart mirrors aren’t the only innovations taking place at the store level. Shelves are also becoming more intuitive, sensing a consumer’s approach and responding with dynamic content based on the products they touch and pick up, which enhances the shopping experience. The display is a continuation of meeting the consumer’s needs, showing other products that match the brand, intent, or characteristics of the item they picked. This element of surprise is important, but the technology is particularly interesting as it’s less intrusive than a push notification to smartphones.\n\nWith this shift from push to pull tactics that simulate personal selling, consumers will need to be marketed to in a way that also encourages them to interact with products. For instance, brands can use Nano technology to turn packaging paper into a connected layer that directly communicates with a shopper’s smartphone. A platform introduced by Aichure is actually able to substitute the consumer’s face into a brand’s beauty ads or editorials, something that’s straight out of an episode of Netflix’s “Black Mirror.” It’s personalization at a whole new level — and great news for Instagram influencer wannabes!\n\nData Camouflaging\n\nWith so much data out there, there are so many way to target the specific needs of customers. And the more consumers engage — through any of their connected devices — the more machines learn and enable a more thoughtful approach to messaging. Deep learning for cosmetics is so sophisticated that AI assistants can now understand and cater to unique facial geometrics, eye shapes and skin tones with minimal human input. There are opportunities for beauty companies to take this even further and approach their data stack like “Color Camouflaging,” using specific data points to counteract problems and create tailored solutions that look and feel seamless. The best way to do that is by building holistic data management systems that collect first-party consumer and product information, as well as real-time environmental stats, such as hyper-local air quality. Any aspect of the customers’ lives that can affect the skin, hair and makeup is an opportunity to educate, inspire and influence buying decisions.\n\nVery little of that data is leveraged in CRMs or e-commerce — at least, not yet. With so many exciting technologies to explore, beauty companies will soon find themselves in a race toward another digital transformation. As new technology is introduced at a lightning-fast pace, they must tap into the new data sets that are now available and leverage their digital channels to sharpen the ways they target — and ultimately connect with — their consumers.\n\nBenjamin Lord is global director at Kinetic–WPP, and serves as a digital adviser to companies including L’Oréal, Chanel, LVMH and others.", "images": ["https://pmcwwd.files.wordpress.com/2020/04/img_7122-2.jpg?crop=0px%2C163px%2C1920px%2C1282px&resize=158%2C104", "https://scontent-iad3-1.cdninstagram.com/v/t51.2885-15/sh0.08/e35/s640x640/93691666_614432342489366_5390988364525715391_n.jpg?_nc_ht=scontent-iad3-1.cdninstagram.com&_nc_cat=102&_nc_ohc=6mWrRxcWC6EAX8feR9t&oh=fabeaad127515ae0880290299444496e&oe=5EC4666F", "https://i2.wp.com/www.sheknows.com/wp-content/uploads/2020/04/what-i-learned-as-a-17-year-old-girl-in-the-boy-scouts.jpg?resize=230%2C135&ssl=1", "https://pmcwwd.files.wordpress.com/2020/04/cartier-display-maillon-watch-cartier.jpg?w=158&h=104&crop=1", "https://scontent-dfw5-2.cdninstagram.com/v/t51.2885-15/sh0.08/e35/p640x640/93501041_696301777799514_793621335634950871_n.jpg?_nc_ht=scontent-dfw5-2.cdninstagram.com&_nc_cat=106&_nc_ohc=HrCtowB4ZfsAX-cBU1P&oh=71ca9f2ca44c4df81c0e428721ab5bd4&oe=5EC6DD1E", "https://pmcwwd.files.wordpress.com/2020/04/olay-skincaring-kits-1.jpg?w=158&h=104&crop=1", "https://scontent-lax3-2.cdninstagram.com/v/t51.2885-15/sh0.08/e35/p640x640/93179013_147813256779078_818824745119598157_n.jpg?_nc_ht=scontent-lax3-2.cdninstagram.com&_nc_cat=106&_nc_ohc=K6oFJ4TfNaQAX9qpQEv&oh=d05618a87d8763dd3341c6d95b6e7e5c&oe=5EC73165", "https://fairchildlive.files.wordpress.com/2019/11/cvent_2000x844-1.jpg?resize=230%2C135", "https://pmcwwd.files.wordpress.com/2020/04/suits-featured-1.jpg?w=158&h=104&crop=1", "https://pmcwwd.files.wordpress.com/2018/04/gucci-artlab-13.jpg?w=158&h=104&crop=1", "https://pmcwwd.files.wordpress.com/2020/04/wwd04172020pageone.jpg?w=355&h=534&crop=1", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=wwd.com&path=%2Fbeauty-industry-news%2Fbeauty-features%2Fthink-tank-ces-beauty-11105784%2F&ct=article&lob=wwd&loc=us&env=desktop&post_id=11105784", "https://s0.wp.com/wp-content/themes/vip/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://pmcwwd.files.wordpress.com/2020/04/20200401_230500-copy.jpg?crop=0px%2C256px%2C1838px%2C1225px&resize=158%2C104", "https://pmcwwd.files.wordpress.com/2020/04/shutterstock_editorial_10603222bc.jpg?crop=0px%2C305px%2C3000px%2C2001px&resize=158%2C104", "https://pmcwwd.files.wordpress.com/2020/04/sustainability-coronavirus-1-1.jpg?w=158&h=104&crop=1", "https://s2.wp.com/wp-content/themes/vip/pmc-wwd-2016/static/images/footer/pmc-logo.png", "https://pmcwwd.files.wordpress.com/2020/04/rc-041529-2-1.jpg?w=158&h=104&crop=1", "https://pmcwwd.files.wordpress.com/2020/04/sustainability.jpg?crop=1730px%2C125px%2C3737px%2C2491px&resize=158%2C104", "https://pmcwwd.files.wordpress.com/2020/04/mandy-moore-portrait-jg-001.jpg?crop=2px%2C246px%2C1364px%2C910px&resize=158%2C104", "https://scontent-iad3-1.cdninstagram.com/v/t51.2885-15/sh0.08/e35/s640x640/93578972_934882160266463_1086504454955178200_n.jpg?_nc_ht=scontent-iad3-1.cdninstagram.com&_nc_cat=111&_nc_ohc=BwAbvSahn1gAX8n44e3&oh=8e24d955ce73870c36aad150bcf54639&oe=5EC3DC83", "https://ct.pinterest.com/v3/?tid=2612680468235&pd[em]=&noscript=1", "https://pmcwwd.files.wordpress.com/2020/03/sbg8a80.bt6221-2020-hd-1.jpg?w=158&h=104&crop=1", "https://robbreportedit.files.wordpress.com/2020/04/digital-smoker-1.jpg?resize=230%2C135", "https://secure.bred4tula.com/158629.png", "https://pmcwwd.files.wordpress.com/2016/05/selfridges-retail-department-store-052716.jpg?w=158&h=104&crop=1", "https://pmcwwd.files.wordpress.com/2020/03/top-banner-collapsed-desk.jpg", "https://pmcwwd.files.wordpress.com/2020/04/zhaviaward.jpg?w=158&h=104&crop=1", "https://pmcwwd.files.wordpress.com/2018/01/youcam-featured.jpg?w=640&h=415&crop=1", "https://pmcwwd.files.wordpress.com/2020/03/free-article-desktop-1.jpg", "https://pmcwwd.files.wordpress.com/2018/11/cartier-bell-boys.jpg?crop=0px%2C1056px%2C5504px%2C3674px&resize=158%2C104", "https://www.facebook.com/tr?id=1378822052216463&ev=PageView&noscript=1", "https://pmcwwd.files.wordpress.com/2020/03/bhldnmockup.png?w=142&h=92&crop=1", "https://pmcwwd.files.wordpress.com/2019/06/fathers-day-2019-081.jpg?crop=0px%2C0px%2C1539px%2C1027px&resize=158%2C104", "https://pixel.quantserve.com/pixel/p-31f3D02tYU8zY.gif", "https://pmcwwd.files.wordpress.com/2020/03/hyke-f20-ho-01.jpg?crop=0px%2C64px%2C1366px%2C912px&resize=158%2C104", "https://beacon.krxd.net/event.gif?event_id=MJc8mrqd&event_type=pageview", "https://pmcwwd.files.wordpress.com/2020/04/thumbnail_phidel-duo-pic.jpg?crop=0px%2C0px%2C960px%2C640px&resize=158%2C104", "https://pmcwwd.files.wordpress.com/2020/04/shutterstock_editorial_9241366fs.jpg?w=158&h=104&crop=1", "https://s2.wp.com/wp-content/themes/vip/pmc-wwd-2016/static/images/footer/footer-devices.png", "https://i0.wp.com/sourcingjournal.com/wp-content/uploads/2020/04/tukacad_station_work_from_home_office.jpg?resize=230%2C135#038;quality=98&ssl=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pmcwwd.files.wordpress.com/2018/07/bench_springsummer2018_campaign_00006.jpg?w=158&h=104&crop=1", "https://pmcwwd.files.wordpress.com/2020/03/top-banner-expanded-desk.gif", "https://scontent-dfw5-1.cdninstagram.com/v/t51.2885-15/sh0.08/e35/s640x640/93887713_1529930430507041_4966498293040815975_n.jpg?_nc_ht=scontent-dfw5-1.cdninstagram.com&_nc_cat=105&_nc_ohc=h_hyX0w3YQcAX-XEmor&oh=3b679b6a08fc1627d3086f5386ef2e7b&oe=5EC739C3", "https://pmcfootwearnews.files.wordpress.com/2020/04/ashton-kutcher-mask-sweatshirt-shorts.jpg?resize=230%2C135", "https://pmcwwd.files.wordpress.com/2020/04/shutterstock_editorial_10611411c.jpg?w=394&h=263&crop=1", "https://pixel.wp.com/b.gif?v=noscript", "https://dc.ads.linkedin.com/collect/?pid=609602&fmt=gif", "https://pmcwwd.files.wordpress.com/2020/04/24-hour-soup-kitchen.jpg?crop=0px%2C0px%2C1800px%2C1201px&resize=158%2C104"], "top_img": "https://pmcwwd.files.wordpress.com/2018/01/youcam-featured.jpg?w=640&h=415&crop=1", "keywords": [], "authors": ["Benjamin Lord", "Ellen Thomas", "Kali Hays", "Jason Grunberg", "Tiffany Ap"], "canonical_link": "https://wwd.com/beauty-industry-news/beauty-features/think-tank-ces-beauty-11105784/", "title": "Think Tank: Latest Beauty Tech Signals Industry Makeover", "meta_data": {"viewport": "width=device-width", "description": "Benjamin Lord, global director at Kinetic-WPP, explains.", "fb": {"pages": 19457049254}, "news_keywords": "Artificial Intelligence, beauty, Consumer Behavior, Think Tank", "cXenseParse": {"pmc-lob": "wwd", "pmc-page_type": "article", "articleid": 11105784, "author": "Benjamin Lord", "pmc-category": "Beauty Features", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-01-17T11:30:51"}, "pmc-tag": "Artificial Intelligence,beauty,Consumer Behavior,Think Tank", "title": "Think Tank: Latest Beauty Tech Signals Industry Makeover", "pageclass": "article", "pmc-vertical": "beauty-industry-news", "pmc-is_free": "yes"}, "generator": "WordPress.com", "og": {"type": "article", "title": "Think Tank: Latest Beauty Tech Signals Industry Makeover", "url": "https://wwd.com/beauty-industry-news/beauty-features/think-tank-ces-beauty-11105784/", "description": "Benjamin Lord, global director at Kinetic-WPP, explains.", "site_name": "WWD", "image": {"identifier": "https://pmcwwd.files.wordpress.com/2018/01/youcam-featured.jpg?w=640&h=415&crop=1", "width": 1200, "height": 802, "alt": "YouCam Makeup Perfect Corp. CES 2018 augmented reality"}, "locale": "en_US"}, "article": {"published_time": "2018-01-17T16:30:51+00:00", "modified_time": "2018-01-17T16:36:12+00:00"}, "twitter": {"site": "@wwd", "text": {"title": "Think Tank: Latest Beauty Tech Signals Industry Makeover"}, "image": {"identifier": "https://pmcwwd.files.wordpress.com/2018/01/youcam-featured.jpg?w=640&h=415&crop=1", "alt": "YouCam Makeup Perfect Corp. CES 2018 augmented reality"}, "card": "summary_large_image", "title": "Think Tank: Latest Beauty Tech Signals Industry Makeover", "description": "Benjamin Lord, global director at Kinetic-WPP, explains."}, "author": "Benjamin Lord", "content_type": "Article", "post_id": 11105784, "title": "Think Tank: Latest Beauty Tech Signals Industry Makeover", "published_at": "2018-01-17 11:30:51", "image": "https://pmcwwd.files.wordpress.com/2018/01/youcam-featured.jpg?w=300&h=200&crop=1", "tags": "Think Tank", "topics": "Beauty Features", "verticals": "Beauty", "body": "To say that technology has “disrupted” beauty is an understatement. Our personal-care devices are all connected — and the quality of biometric data they are able to collect has doubled. Whether it’s how we brush our hair or our teeth, beauty tools can track the behaviors and patterns of our daily life. At the same time, technologies like smart mirrors, augmented reality and machine learning are making the consumer experience more intuitive, custom and inspiring than ever before. But this is all just a foreshadowing of what’s coming next.\r\n\r\nThis year at CES — the annual mecca for technology and innovation — Beauty Tech stole the spotlight with five trends that are sure to reshape consumer decisions and preferences forever. The beauty routine is about to get a massive digital makeover — and only those who stay ahead of the curve will survive.\r\n\r\nDIY Beauty\r\n\r\nDIY is rapidly invading the beauty space — making it likely that the beauty expert as we now know it might soon be irrelevant. Technologies designed to put consumers in charge of their own skin emerged this year at CES: from intelligent masks and moisture sprays that put spa-quality facial treatments in the palm of your hand to a bespoke skin-care formulator that lets you create your own cream. The customer is becoming the creator, empowered to create their own fresh, chemical-free cosmetics, not to mention 3-D-printed custom nails.\r\n\r\nAll this is aimed at saving people time while tackling concerns over the transparency of ingredients, offering a clean and high-quality solution to consumers. And in an age when brands are losing customers due to a lack of personalization, customizability matters — both to consumers and the beauty marketers seeking to keep sales strong.\r\n\r\nDemocratized Dermatology\r\n\r\nSpeaking of saving time, personal skin readers mark the dawn of a new era for consumers, dermatologists and beauty companies alike. A simple scan or even a selfie is all consumers need to analyze and understand their unique skin condition, as well as to receive personalized skin-care recommendations. Powered by artificial intelligence, these devices are able to go as deep as the inner skin and make recommendations based on variables like hydration or melanin levels. Skin-based UV sensors will also be able to soon protect us from overexposure to the sun, having developed so quickly that they now come in the form of nail stickers.\r\n\r\nWith such level of awareness and prevention, consumers are bound be become much more knowledgeable about their skin health. And with some of these scanners treating wrinkles, blemishes, or dark spots directly — they might replace dermatologists altogether sometime in the near future.\r\n\r\nContextualized Reflection\r\n\r\nWhat’s not going away anytime soon? Smart mirrors. Using artificial intelligence and augmented reality, they allow consumers to virtually try on lipstick and eye shadow by projecting the products onto their reflection. Although AR for cosmetics isn’t new, it was the premise of an expanded experience that made its debut at CES this year: real-time beauty contextualization. Smart mirrors will be everywhere — retail, airports, as well as in your bathroom and hotel room — and they will become an integral part of consumers’ daily beauty routine. The new models not only identify the exact shade of foundation you need based on your face or complexion, but also based on sunlight, weather and other contextual factors such as fashion, makeup or vegan trends on social media. That’s not it: Smart mirrors will also let you virtually change your hair color and pair your look with clothing and accessories. Last but not least, they will also provide beauty training through interactive touch or a voice assistant integration.\r\n\r\nEnabling commerce via smart mirrors, screens and glass could be a cash cow for beauty brands; after all, offering a seamless purchase option immediately after a virtual try-on is a smart way to close the loop. Partnering with manufacturers seems like the most logical step in making this a reality, but beauty brands must not forget the importance of investing in owning contextual data. Beauty consumers like to be relevant in context — whether it’s for everyday usage, if they’re traveling, or going to an event.\r\n\r\nIntuitive Merchandizing\r\n\r\nSmart mirrors aren’t the only innovations taking place at the store level. Shelves are also becoming more intuitive, sensing a consumer’s approach and responding with dynamic content based on the products they touch and pick up, which enhances the shopping experience. The display is a continuation of meeting the consumer’s needs, showing other products that match the brand, intent, or characteristics of the item they picked. This element of surprise is important, but the technology is particularly interesting as it’s less intrusive than a push notification to smartphones.\r\n\r\nWith this shift from push to pull tactics that simulate personal selling, consumers will need to be marketed to in a way that also encourages them to interact with products. For instance, brands can use Nano technology to turn packaging paper into a connected layer that directly communicates with a shopper’s smartphone. A platform introduced by Aichure is actually able to substitute the consumer’s face into a brand’s beauty ads or editorials, something that’s straight out of an episode of Netflix’s “Black Mirror.” It’s personalization at a whole new level — and great news for Instagram influencer wannabes!\r\n\r\nData Camouflaging\r\n\r\nWith so much data out there, there are so many way to target the specific needs of customers. And the more consumers engage — through any of their connected devices — the more machines learn and enable a more thoughtful approach to messaging. Deep learning for cosmetics is so sophisticated that AI assistants can now understand and cater to unique facial geometrics, eye shapes and skin tones with minimal human input. There are opportunities for beauty companies to take this even further and approach their data stack like “Color Camouflaging,” using specific data points to counteract problems and create tailored solutions that look and feel seamless. The best way to do that is by building holistic data management systems that collect first-party consumer and product information, as well as real-time environmental stats, such as hyper-local air quality. Any aspect of the customers’ lives that can affect the skin, hair and makeup is an opportunity to educate, inspire and influence buying decisions.\r\n\r\nVery little of that data is leveraged in CRMs or e-commerce — at least, not yet. With so many exciting technologies to explore, beauty companies will soon find themselves in a race toward another digital transformation. As new technology is introduced at a lightning-fast pace, they must tap into the new data sets that are now available and leverage their digital channels to sharpen the ways they target — and ultimately connect with — their consumers.\r\n\r\nBenjamin Lord is global director at Kinetic–WPP, and serves as a digital adviser to companies including L'Oréal, Chanel, LVMH and others.", "application-name": "WWD", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Women's Wear Daily brings you breaking news about the fashion industry, designers, celebrity trend setters, and extensive coverage of fashion week.", "msapplication-task": "name=Subscribe;action-uri=https://wwd.com/feed/;icon-uri=https://pmcwwd.files.wordpress.com/2018/06/a9597fffaf6885dd6f870d1269ef3b72.png?w=16", "onesignal": "wordpress-plugin", "msapplication-TileImage": "https://pmcwwd.files.wordpress.com/2018/06/a9597fffaf6885dd6f870d1269ef3b72.png?w=128"}, "movies": [], "publish_date": 1516206651.0, "source": "https://wwd.com", "summary": ""}