{"url": "https://en.wikipedia.org/wiki/Hayden_Christensen", "text": "Canadian actor and producer\n\nHayden Christensen (born April 19, 1981)[1] is a Canadian actor and producer. He began his career on Canadian television at the age of 13, then diversified into American television in the late 1990s. He was praised for his acting as Sam in Life as a House (2001), earning Golden Globe Award and Screen Actors Guild Award nominations. Christensen gained international fame for his portrayal of Anakin Skywalker / Darth Vader in the Star Wars prequel trilogy films, Star Wars: Episode II – Attack of the Clones (2002) and Star Wars: Episode III – Revenge of the Sith (2005). His honours for these films include a nomination for the Saturn Award for Best Actor and the Cannes Film Festival Revelation Award. He also received critical acclaim for his portrayal of Stephen Glass in the film Shattered Glass.\n\nEarly life\n\nChristensen was born in Vancouver, British Columbia, to Alie, an American speechwriter, and David Christensen, a Canadian computer programmer and communications executive.[1][2] His father is of Danish descent, and his mother has Swedish and Italian ancestry.[2] Christensen is one of four children, with three actor siblings: older brother Tove, older sister Hejsa, and younger sister Kaylen.[1][3] Christensen was an athlete in high school, playing hockey competitively and tennis on a provincial level.[4]\n\nHe spent summers on Long Island with his maternal grandmother, Rose Schwartz, and attended the Actors Studio in New York City; he studied as well at the Arts York drama program at Unionville High School in Markham, Ontario.[5] After accompanying his older sister to her agent's office after she landed a role in a Pringles commercial, he began being cast in commercials as well, including for Triaminic cough syrup in 1988.[5]\n\nCareer\n\n1993–2005\n\nChristensen made his acting debut in September 1993, when, at the age of 12, he played a supporting role on the German-Canadian television series Macht Der Leidenschaft/Family Passions.[6] The following year, he had a minor role in John Carpenter's In the Mouth of Madness.[6] From 1995 through 1999, he appeared in several films and television series, including Harrison Bergeron, Forever Knight, Goosebumps, The Virgin Suicides, and Are You Afraid of the Dark?[6]\n\nHe acquired wider notice while starring in Fox Family Channel's television series Higher Ground in 2000, portraying a teen who was sexually molested by his stepmother, and then turned to drugs in his despair.[6][7]\n\nChristensen's critically acclaimed portrayal of a misunderstood teenager in Life as a House (2001) earned him Golden Globe and SAG Award nominations, as well as the National Board of Review's award for Breakthrough Performance of the Year.[8][9][10] However, the performance did not receive widespread public notice.[7] In 2002, Christensen made his London theatre debut with Jake Gyllenhaal and Anna Paquin in This Is Our Youth.[11]\n\nHe went on to receive positive reviews for 2003's Shattered Glass, which tells the true story of journalist Stephen Glass, who was discovered to be fabricating stories as a writer for The New Republic and other publications.[12][13] Peter Travers of Rolling Stone wrote, \"Hayden Christensen is sensational as Glass, finding the wonder boy and the weasel in a disturbed kid flying high on a fame he hasn't earned.\"[14] In 2005, Christensen made his Broadway debut when he appeared briefly in a 10-minute play.\n\nIn 2005, he took part in the fifth annual \"24 Hour Plays\" benefit, which raises cash for nonprofit groups in the Big Apple.[15]\n\nStar Wars\n\nChristensen in 2005\n\nOn May 12, 2000, Christensen announced that he would be starring as an adult Anakin Skywalker in Star Wars: Episode II – Attack of the Clones (2002) and Star Wars: Episode III – Revenge of the Sith (2005), Skywalker was previously portrayed by Jake Lloyd as a child in Star Wars: Episode I - The Phantom Menace (1999). The casting director reviewed about 1,500 other candidates before director George Lucas selected Christensen.[16] Lucas is quoted as saying that he chose Christensen because he \"needed an actor who has that presence of the Dark Side\". This was essential to solidify the story that Lucas was trying to tell: Anakin Skywalker's fall from grace and transformation into Darth Vader.\n\nDuring the production of Revenge of the Sith, Christensen asked Lucas if a special Vader suit could be constructed to fit his own body, rather than have a different actor don one of the original sets of Vader armour worn by David Prowse.[17] Lucas agreed, and a suit was engineered to fit Christensen's frame, even including extensions to allow for the actor to attain Vader's 6 ft 6 in (1.98 m) height. His voice as the \"robotic\" Vader, however, was dubbed over by James Earl Jones, who first made the voice famous in the original trilogy.[18]\n\nStock footage of Christensen was used in the 2004 DVD-release edition of Return of the Jedi, where he was inserted to replace Sebastian Shaw as the force ghost of the redeemed Anakin Skywalker.[19] This was one of the most controversial changes.[20][21] Lucas wanted Anakin's inner person to return to who he was before he turned to the dark side.[22] Christensen insisted this was done without his knowledge, an act that was confirmed by Lucasfilm itself in the featurette \"Return of the Jedi: What has changed?\" as seen on the official website to commemorate the 2006 DVDs.[23]\n\nHis performance in both Episode II and III received generally mixed reviews by critics[24][25][26][27] (earning him the Golden Raspberry Award for Worst Supporting Actor in both films).[28][29][30]\n\nChristensen was named in both People magazine's 50 Most Beautiful People and Teen People's 25 Hottest Stars under 25.[31] For his performance in Episode III, he won the MTV Movie Award for Best Villain.[32]\n\nIn 2019, Christensen returned to the role of Anakin Skywalker, providing a surprise cameo of the character's voice in Star Wars: The Rise of Skywalker.\n\n2006–present\n\nJumper in Rome in 2006 Christensen with then–girlfriend Rachel Bilson filmingin Rome in 2006\n\nBetween 2006 and 2007, he starred in Awake, with Jessica Alba, which tells the story of a man who remains awake but paralyzed during heart surgery,[6][33] and co-starred in Factory Girl, opposite Sienna Miller and Guy Pearce.[6][34] Christensen next co-starred with Samuel L. Jackson, Jamie Bell, and Rachel Bilson in the film Jumper, the story of a young man who discovers he has the ability to teleport; the film was released on February 14, 2008.[35][36] Bilson and Christensen co-starred again in the same segment of the film New York, I Love You.[37] Christensen appeared opposite Mischa Barton in Virgin Territory, which was released directly-to-DVD in North America on August 26, 2008.[38] The film, based on The Decameron, is about a group of people who escape the Black Plague epidemic by hiding out in a Tuscan villa in Italy.[39]\n\nIn October 2009, Christensen started shooting the horror film Vanishing on 7th Street, directed by Brad Anderson, with Thandie Newton and John Leguizamo.[40][41] Christensen appeared in the crime drama Takers with Idris Elba and Paul Walker, released in the United States on August 27, 2010.[42] Quantum Quest: A Cassini Space Odyssey is the fourth film in which Christensen stars with Samuel L. Jackson.\n\nIn 2010, Christensen sued USA Network over allegations that they stole his idea for the TV show Royal Pains. The suit alleges that Christensen met with USA to pitch a similar series entitled Housecalls. During the meeting, Christensen alleges, he was never informed that a similar program was in development.[43][44] Although a federal judge at first dismissed Christensen's lawsuit in 2011, in June 2012, the 2nd Circuit Court of Appeals reversed this decision and remanded the case back to the district court for further proceedings, in what was considered a legal victory for Christensen.[45]\n\nOn May 20, 2013, during the Cannes Film Festival, the Russian company Enjoy Movies announced the creation of Glacier Films, an alliance company with Christensen and his brother Tove. Over a three-year period, Glacier Films intends to make 11 \"micro-budget\" movies costing $1.5M each. The first project, American Heist, starring Christensen, Adrien Brody and Jordana Brewster, started filming in June 2013. It is a remake of Steve McQueen's The Great St. Louis Bank Robbery.[46] In 2014, he starred in the American-Chinese-Canadian film Outcast, an action drama, alongside Nicolas Cage.[47]\n\nIn 2015, Christensen starred in the film 90 Minutes in Heaven co-starring Kate Bosworth and directed by Michael Polish based on the best-selling novel by the same name. In 2015, filming began of an ureleased WW2 Nazi zombies horror movie titled Untöt, set to star Christensen. [48] In 2017, he was in the film First Kill alongside Bruce Willis. In 2018 he appeared in the Canadian-American romantic comedy Little Italy with Emma Roberts and in the same year was in The Last Man.\n\nPersonal life\n\nIn 2007, Christensen began dating actress Rachel Bilson, with whom he filmed the movie Jumper. They became engaged on December 25, 2008.[49][50] In mid-2010, they broke up, but began dating again a few months later.[51][52][53][54] On October 29, 2014, Bilson gave birth to their daughter Briar Rose.[55] Christensen and Bilson separated in September 2017.[56]\n\nIn 2007, Christensen bought a farm near Uxbridge, Ontario.[57][58] He noted in 2008 that he had been renovating the property himself and devoting time to learning about \"livestock, crops, and agricultural machinery\".[57] In November 2013, Christensen collaborated with Canadian fashion chain RW&Co to release a men's clothing line inspired by his farm.[59]\n\nAn avid Toronto Maple Leafs fan,[60] Christensen performed a public service announcement for Do Something's Teens for Jeans Campaign in 2008.[61] He modelled in Louis Vuitton's advertising,[62] and was also named as the face of Lacoste's newest fragrance, Lacoste Challenge.[63] He was featured in RED's Lazarus Effect Campaign, which is intended to increase awareness for its efforts to fight AIDS in Africa.[64][65]\n\nFilmography", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Dragon-149393.svg/27px-Dragon-149393.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Hayden-cfda2010-0004%281%29_%28cropped%29.jpg/220px-Hayden-cfda2010-0004%281%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/22/Hayden_Christensen_05-2005.jpg/220px-Hayden_Christensen_05-2005.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/28px-Video-x-generic.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/cf/Flag_of_Canada.svg/32px-Flag_of_Canada.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/BilsonChristensenNov06.jpg/190px-BilsonChristensenNov06.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/8/8a/Hayden-cfda2010-0004%281%29_%28cropped%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/8/8a/Hayden-cfda2010-0004%281%29_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Hayden_Christensen", "title": "Hayden Christensen", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/8/8a/Hayden-cfda2010-0004%281%29_%28cropped%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}