{"url": "https://www.elitedaily.com/entertainment/celebrity/khloe-kardashians-revenge-body-trailer-video/2083086", "text": "Please do me a solid and do not watch the Season 2 Trailer of Khloé Kardashian's Revenge Body if you're hungover from four glasses of weirdly affordable wine and one family-sized box of Cheerios. Trust me. You'll cry. Khloé's hit series following the weight loss journies of varying contestants is back, and the sneak peek is so, so emotional.\n\nI don't know, you guys. Blame it my own insecurities growing up as someone who could always stand to lose a few pounds. Blame it on the fact my literal job is to closely follow the Kardashians' lives which has created an inflated sense of personal connection to their family. Blame it on the fact I'm almost 30 years old and don't have anything besides cereal in my house as a source of nourishment... but this trailer really, really got me.\n\nHere's the premise of the show in a freaking nutshell. As you guys know, Khloé found fitness as a means to cope with her anxiety and take control of her life. Over the past few years, we've watched her totally transform into a freak-in-a-good-way workout fiend, and become a sculpted warrior. For her, it began around the time her marriage started to unravel with ex-husband Lamar Odom, resulting in what she now calls her \"revenge body.\"\n\nSounds like a hit TV show premise, right?\n\nRIGHT!\n\nIn the show, Khloé and a team of trainers help contestants get the body of their dreams as a way to combat the people and things in their lives that dragged them down in the past.\n\nIMBd summarizes,\n\nShe's [Khloe] giving them the chance to reinvent themselves from the inside out, with the help of a team of elite trainers, stylists and nutritionists. Each hourlong episode follows the participants' progress to transform their bodies and empower their confidence in 12 weeks, leading to final reveals and chances to defy those who doubted them.\n\nOK. Do you guys feel adequately prepared to watch the trailer now? Take a breath.\n\nHere you go.\n\nE! Entertainment on YouTube\n\nI'll give you a minute.\n\nWHICH IS YOUR FAVORITE PART? Is it when the dance instructor yells, \"Don't you want to prove your mom wrong?!\" Or when Khloé says it's not just about a hot body – it's about body, mind, and soul?? OR IS IT WHEN THE GUY DANCES IN THE SHOE STORE???\n\nFor me, it's when Khloé lets that lucky human touch her butt... not that this is about Khloé's butt...\n\nBut also, can we be the most real for a second? Think back before KUWTK was a thing. How would you guys feel if you were a young 20-something girl and your sister was Kim Freaking Kardashian, the breakout sex-icon of your generation? Probably a little insecure, don't you think?\n\nKhloé explains in the trailer,\n\nMy entire life I've been compared to my sisters. I don't look like them. I was chubby and tall. I lost a lot of confidence in myself. I found new me in this happiness and I want to share it with other people.\n\nSing it, sister.\n\nThis season's contestants also are totally inspiring and have deeply touching and relatable pasts that somehow led them to Khloé.\n\nIn the final moments of the trailer, we catch glimpses of body transformation reveals, people crying, and a quick shot of an engagement ring. I mean, this show packs personal inspiration, romance, AND a Kardashian... if that doesn't sound like your next favorite series, then Khloé and I literally can't help you.\n\nCheck out the entire Gen Why series and other videos on Facebook and the Bustle app across Apple TV, Roku, and Amazon Fire TV.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/elite-daily/2017/09/28123623/Khloe-Kardashian-revenge-body.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/elite-daily/2017/09/28123623/Khloe-Kardashian-revenge-body.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/elite-daily/2017/09/28123623/Khloe-Kardashian-revenge-body.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/entertainment/celebrity/khloe-kardashians-revenge-body-trailer-video/2083086", "title": "Khloe Kardashian's 'Revenge Body' Season 2 Trailer Is Actually So Emotional", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/entertainment/celebrity/khloe-kardashians-revenge-body-trailer-video/2083086", "type": "article", "title": "Khloé Kardashian's 'Revenge Body' Season 2 Trailer Is Actually So Emotional – VIDEO", "description": "Please do me a solid and do not watch the Season 2 Trailer of Khloé Kardashian's Revenge Body if you're hungover from four glasses of weirdly affordable wine and one family-sized box of Cheerios. Trust me. You'll cry. Khloé's hit series following…", "image": {"identifier": "https://imgix.bustle.com/elite-daily/2017/09/28123623/Khloe-Kardashian-revenge-body.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "Please do me a solid and do not watch the Season 2 Trailer of Khloé Kardashian's Revenge Body if you're hungover from four glasses of weirdly affordable wine and one family-sized box of Cheerios. Trust me. You'll cry. Khloé's hit series following…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}