{"url": "https://en.wikipedia.org/wiki/Grammy_Award", "text": "Gramophone magazine, see For the award recognizing achievement in the Latin music industry, see Latin Grammy Award . For the classical music award presented bymagazine, see Gramophone Award\n\nAccolade by the National Academy of Recording Arts and Sciences of the United States\n\nA Grammy Award (stylized as GRAMMY, originally called Gramophone Award), or Grammy, is an award presented by The Recording Academy to recognize achievements in the music industry. The trophy depicts a gilded gramophone. The annual presentation ceremony features performances by prominent artists, and the presentation of those awards that have a more popular interest. The Grammys are the second of the Big Three networks' major music awards held annually (between the American Music Awards in fall, and Billboard Music Awards in summer).\n\nIt is considered one of the four major annual American entertainment awards, along with the Academy Awards (film), the Emmy Awards (television), and the Tony Awards (theater and Broadway).\n\nThe first Grammy Awards ceremony was held on May 4, 1959, to honor and respect the musical accomplishments by performers for the year 1958. Following the 2011 ceremony, the Academy overhauled many Grammy Award categories for 2012.\n\nThe 62nd Annual Grammy Awards were held on January 26, 2020, at the Staples Center in Los Angeles.\n\nHistory [ edit ]\n\nThe Grammys had their origin in the Hollywood Walk of Fame project in the 1950s.[1][2] As the recording executives chosen for the Walk of Fame committee worked at compiling a list of important recording industry people who might qualify for a Walk of Fame star, they realized there were many more people who were leaders in their business who would not earn a star on Hollywood Boulevard. The music executives decided to rectify this by creating an award given by their industry similar to the Oscars and the Emmys. This was the beginning of the National Academy of Recording Arts and Sciences After it was decided to create such an award, there was still a question of what to call it; one working title was the Eddie, to honor the inventor of the phonograph, Thomas Edison. They eventually settled on using the name of the invention of Emile Berliner, the gramophone, for the awards, which were first given for the year 1958.[3][4][5]\n\nThe first award ceremony was held simultaneously in two locations on May 4, 1959 - Beverly Hilton Hotel in Beverly Hills California, and Park Sheraton Hotel in New York City,[6] and 28 Grammys were awarded. The number of awards given grew and fluctuated over the years with categories added and removed, at one time reaching over 100.[7] The second Grammy Awards, also held in 1959, was the first ceremony to be televised,[8] but the ceremony was not aired live until the 13th Annual Grammy Awards in 1971.[9]\n\nGramophone trophy [ edit ]\n\nThe gold-plated trophies, each depicting a gilded gramophone, are made and assembled by hand by Billings Artworks in Ridgway, Colorado. In 1990 the original Grammy design was revamped, changing the traditional soft lead for a stronger alloy less prone to damage, making the trophy bigger and grander.[10] Billings developed a zinc alloy named grammium, which is trademarked.[11] The trophies with the recipient's name engraved on them are not available until after the award announcements, so \"stunt\" trophies are re-used each year for the broadcast.[12][13]\n\nBy February 2009, a total of 7,578 Grammy trophies had been awarded.[14]\n\nCategories [ edit ]\n\nThe \"General Field\" are four awards which are not restricted by genre.\n\nAlbum of the Year is awarded to the performer, songwriter(s), and the production team of a full album if other than the performer.\n\nRecord of the Year is awarded to the performer and the production team of a single song if other than the performer.\n\nSong of the Year is awarded to the songwriter(s) of a single song.\n\nBest New Artist is awarded to a promising breakthrough performer who releases, during the Eligibility Year, the first recording that establishes the public identity of that artist (which is not necessarily their first proper release).\n\nOf the three artists who won all four awards, two of them won all four at once: Christopher Cross in 1980, and Billie Eilish in 2020 making her the youngest artist to do so at the age of 18. Adele won the Best New Artist award in 2009 and the other three in 2012 and 2017.\n\nOther awards are given for performance and production in specific genres, as well as for other contributions such as artwork and video. Special awards are given for longer-lasting contributions to the music industry.\n\nBecause of the large number of award categories (78 in 2012, 81 in 2013 and 82 in 2014), and the desire to feature several performances by various artists, only the ones with the most popular interest - typically about 10 to 12, including the four General Field categories and one or two categories in the most popular music genres (i.e. pop, rock, country, rap) - are presented directly at the televised award ceremony. The many other Grammy trophies are presented in a pre-telecast 'Premiere Ceremony' earlier in the afternoon before the Grammy Awards telecast.\n\n2012 category restructuring [ edit ]\n\nOn April 6, 2011, The Recording Academy announced a drastic overhaul of many Grammy Award categories for 2012.[15] The number of categories was cut from 109 to 78. The most important change was the elimination of the distinction between male and female soloists and between collaborations and duo/groups in various genre fields (pop, rock, R&B, country, and rap). Also, several categories for instrumental soloists were discontinued. Recordings in these categories now fall under the general categories for best solo performances.\n\nIn the rock field, the separate categories for hard rock and metal albums were combined and the Best Rock Instrumental Performance category was eliminated due to a waning number of entries.\n\nIn R&B, the distinction between best contemporary R&B album and other R&B albums has been eliminated. They now feature in one, general Best R&B Album category.[16]\n\nIn rap, the categories for best rap soloist and best rap duo or group have been merged into the new Best Rap Performance category.\n\nThe most eliminations occurred in the roots category. Up to and including 2011, there were separate categories for various regional American music forms, such as Hawaiian music, Native American music and Zydeco/Cajun music. Due to the consistently low number of entries for these categories, The Recording Academy decided to combine all these music variations into the new Best Regional Roots Music Album, including polka, which lost its own separate category in 2009.[17][18]\n\nIn the same genre field, the traditional and contemporary blues categories and the traditional and contemporary folk categories each were consolidated into one per genre, due to the number of entries and given the challenges in distinguishing between contemporary folk and Americana, and contemporary and traditional blues. In the world music genre field, the traditional and contemporary categories also merged.\n\nIn the classical genre field, its main category Best Classical Album was discontinued because most recipients in this category had also won in one of the other classical categories for the same album. Classical recordings are now eligible for the main Album of the Year category.\n\nThere were also a few minor name changes to better reflect the nature of the separate categories. It was determined by the Recording Academy that the word \"gospel\" in the gospel genre field tends to conjure up the images and sounds of traditional soul gospel and leaves out the current contemporary Christian music (CCM). Therefore, the genre field and some categories were renamed as Gospel/Contemporary Christian Music.[19]\n\nSince 2012 there have been a small number of adjustments made to the list of categories and genre fields. The number of categories has gone up from 78 in 2012 to 84 in 2017.[20]\n\nEntry process and selection of nominees [ edit ]\n\nMedia companies registered with the National Academy of Recording Arts and Sciences and individual members of NARAS (artists and other professionals working in the industry who meet certain criteria) may enter recordings for consideration. Entries are made online and a physical copy of the work is sent to NARAS. Once a work is entered, reviewing sessions are held, involving more than 150 experts from the recording industry, to determine whether the work is entered in the correct category.\n\nThe resulting lists of eligible entries are circulated to Voting Members, each of whom may vote to nominate in the general fields (Record of the Year, Album of the Year, Song of the Year, and Best New Artist) and in no more than nine out of 30 other fields on their ballots. The five recordings that earn the most votes in each category become the nominees, while in some categories (craft and specialized categories) there are review committees in place that determine the final 5 nominees.[21] There may be more than five nominees if there is a tie in the nomination process.\n\nWhereas members of the Academy of Motion Picture Arts and Sciences are generally invited to screenings or are sent DVDs of films nominated for Oscars, NARAS members do not receive nominated recordings. Instead, they receive access to a private online listening function.\n\nFinal voting [ edit ]\n\nAfter nominees have been determined, final voting ballots are sent to NARAS voting members, who may then vote in the general fields and in no more than nine of the 30 fields. Members are encouraged, but not required, to vote only in their fields of expertise. Ballots are tabulated secretly by the major independent accounting firm Deloitte Touche Tohmatsu.[21] Following the tabulation of votes the winners are announced at the Grammy Awards. The recording with the most votes in a category wins and it is possible to have a tie (in which case the two or more nominees who tie are all considered winners). Winners are presented with the Grammy Award and those who do not win are given a medal for their nomination.\n\nIn both voting rounds, Academy members are required to vote based upon quality alone, and not to be influenced by sales, chart performance, personal friendships, regional preferences or company loyalty. The acceptance of gifts is prohibited. Members are urged to vote in a manner that preserves the integrity of the Academy and their member community. Although registered media companies may submit entries they may not vote in either round of voting.\n\nThe eligibility period for the 62nd Annual Grammy Awards is October 1, 2018, to August 31, 2019.[22]\n\nGrammy Legend [ edit ]\n\nA special Grammy Award of merit is awarded intermittently to recognize \"ongoing contributions and influence in the recording field\".[23] It has been called the Grammy Legend Award and the Grammy Living Legend Award at different ceremonies. As of 2018, only fourteen solo musicians and one band have received this award.\n\nSalute to Industry Icons Award [ edit ]\n\nThe Salute to Industry Icons Award honors those who have made innovate contributions to the music industry.[24][25] Recipients include:\n\nIn Memoriam [ edit ]\n\nIn past decades, the remarks given by the president of The Recording Academy has been followed by an In Memoriam segment. The segment was aired during the last hour of the broadcast and was later preceded by the final commercial break of the broadcast.\n\nVenue [ edit ]\n\nPrior to 1971 the Grammy Award ceremonies were held in different locations on the same day. Originally New York City and Los Angeles were the host cities. Chicago joined being a host city in 1962, and then Nashville became the fourth location in 1965.\n\nThe 1971 ceremony, held at the Hollywood Palladium in Los Angeles, was the first to take place in one location. The ceremony was then moved to Madison Square Garden's Felt Forum in New York City, and then Nashville's Tennessee Theatre in the following two years. Then from 1974 to 2003, the Grammys were held in various venues in New York City and Los Angeles. Notable locations included New York City's Madison Square Garden and Radio City Music Hall; and Los Angeles’ Shrine Auditorium, the Staples Center and the Hollywood Palladium.\n\nIn 2000 the Staples Center became the permanent home of the award ceremonies. The Grammy Museum was built across the street from Staples Center in LA Live to preserve the history of the Grammy Awards. Embedded on the sidewalks at the museum streets are bronze disks, similar to the Hollywood Walk of Fame, honoring each year's top winners, Record of the Year, Best New Artist, Album of the Year, and Song of the Year. Since 2000, the Grammy Awards have only take place outside of Los Angeles twice, with New York City's Madison Square Garden hosting the awards in 2003 and in 2018.[26]\n\nThe annual awards ceremony at the Staples Center forces sports teams such as Los Angeles Kings, Los Angeles Lakers, Los Angeles Clippers and Los Angeles Sparks to play an extended length of road games.\n\nLeading winners [ edit ]\n\nWith 31 Grammy Awards, Sir Georg Solti is the artist with the most Grammy wins.[27] Alison Krauss is the biggest winner among female artists with 27 awards.[28] U2, with 22 Grammy Awards, holds the record for most awards won by a group.[29]\n\nCriticism [ edit ]\n\nThe Grammy Awards has received criticism from prominent recording artists and music journalists.\n\nCommercialism [ edit ]\n\nWhen Pearl Jam won a Grammy in the category Best Hard Rock Performance in 1996, the band's lead singer Eddie Vedder commented on stage: \"I don't know what this means. I don't think it means anything.\"[30] Glen Hansard, leader of the Irish rock group The Frames, stated in 2008 that the Grammys represent something outside of the real world of music \"that's fully industry based\". He said he wasn't that interested in attending that year's ceremony, even though he had been nominated for two different awards.[31] Maynard James Keenan, lead singer of metal band Tool, did not attend the Grammy Awards ceremony to receive one of their awards. He explained his reasons:[32]\n\nI think the Grammys are nothing more than some gigantic promotional machine for the music industry. They cater to a low intellect and they feed the masses. They don't honor the arts or the artist for what he created. It's the music business celebrating itself. That's basically what it's all about.\n\nThey have also been criticized for generally awarding or nominating more commercially successful albums rather than critically successful ones.[33][34] In 1991, Sinead O'Connor became the first musician to not win a Grammy, boycotting the ceremony after being nominated for Record of the Year, Best Female Pop Vocal Performance, and Grammy Award for Best Alternative Music Performance. O'Connor would go on to win the latter category.[35] She said that her reasoning came from the Grammys' extreme commercialism.[36]\n\nGrammy Snubs [ edit ]\n\nIn 2011, Los Angeles Times journalist Randall Roberts criticised the exclusion of Kanye West's My Beautiful Dark Twisted Fantasy from Album of the Year category nominations for the 54th Grammy Awards. He described West's album as \"the most critically acclaimed album of the year, a career-defining record\".[37] Roberts went on to criticize the Grammy Awards for being \"mired in the past\" and out of touch with \"new media\" and trends amongst music listeners such as music sharing, stating:[37]\n\nThe major nominations for the 54th annual awards clearly show that the recording academy has been working overtime to be all-inclusive, but more significantly, they also reveal a deep chasm between its goals and the listening habits of the general population... [T]he focus is still on the old music industry model of cash-cow hits, major label investments and commercial radio...\n\nIn an article for Time, journalist Touré also responded to the snub and expressed his general displeasure with the awards, stating \"I don't pretend to understand the Grammys. I have never been able to discern a consistent logic around who gets nominated or who gets statues. I comprehend the particular logic of the Oscars, but not the big awards for music. My normal state of confusion around what drives Grammy decisions was exponentialized this week when, to the shock of many, Kanye's masterpiece My Beautiful Dark Twisted Fantasy was not nominated for a Grammy for Album of the Year.\"[38] He went on to compare understanding the Grammy Awards to Kremlinology and commented on The Recording Academy's exclusion of more \"mature\" hip hop albums as Album of the Year nominees, noting that it occasionally opts to nominate \"pop-friendly\" hip hop albums instead.[38]\n\nIn a 2011 profile for The New York Times following the 53rd Grammy Awards, frontman Justin Vernon of indie band Bon Iver was asked his opinion of the Grammys and how he would react to a nomination for his group, to which he responded:[39]\n\nYou know I was thinking about that a couple of months ago, someone asked me that, and I was like \"I would go and I would\" – and I don't think the Bon Iver record is the kind of record that would get nominated for a Grammy – \"I would get up there and be like, 'This is for my parents, because they supported me,' because I know they would think it would be stupid of me not to go up there. But I kinda felt like going up there and being like: \"Everyone should go home, this is ridiculous. You should not be doing this. We should not be gathering in a big room and looking at each other and pretending that this is important.\" That's what I would say.\n\nHe reaffirmed this sentiment and commented about the Grammys, saying:[39]\n\n[Ninety-eight] percent of the people in that room, their art is compromised by the fact that they're thinking that, and that they're hoping to get that award. And who is that award given by? It's like they think it's literally handed down by the musical-history gods. And I don't know who the voters are. Like, I have a friend who's a voter who was like, \"I had to be a voter because I don't trust the other voters.\" And I was like, \"Me either!\" And it's just not important and people spend too much time thinking about it.\n\nBon Iver subsequently received four nominations in November for the 54th Grammy Awards.[39] After winning the award, Vernon said in his acceptance, \"It's really hard to accept this award. There's so much talent out here [...] and there's a lot of talent that's not here tonight. It's also hard to accept because you know, when I started to make songs I did it for the inherent reward of making songs, so I'm a little bit uncomfortable up here.\"[40]\n\nIn his article \"Everything Is Praised Again\", Jon Caramanica of The New York Times criticized Grammy voters for being \"conservative\" and disregarding more \"forward-looking\" music, and wrote in response to the 54th Grammy Awards, \"for the umpteenth time, the Grammys went with familiarity over risk, bestowing album of the year honors (and several more) on an album that reinforced the values of an older generation suspicious of change.\"[41] He cited the Grammy successes of Lauryn Hill's The Miseducation of Lauryn Hill (1998), Norah Jones' Come Away with Me (2003), and Adele's 21 (2011) as examples of \"the Grammys dropp[ing] a boatload of awards on a young female singer-songwriter and her breakthrough album\". Of Kanye West's absence from the ceremony, Caramanica stated, \"He didn't even bother to show up for the broadcast, which was well enough, because hip-hop was almost completely marginalized.\"[41]\n\nIn an article for The Huffington Post, music executive and author Steve Stoute criticized the Recording Academy and the Grammy Awards for having \"lost touch with contemporary popular culture\" and noted \"two key sources\" for it: \"(1) over-zealousness to produce a popular show that is at odds with its own system of voting and (2) fundamental disrespect of cultural shifts as being viable and artistic.\"[42] Stoute accused them of snubbing artists with more cultural impact, citing respective losses by the critical and commercial successes in Eminem's The Marshall Mathers LP (2000) and Kanye West's Graduation (2007) in the Album of the Year category, and stated:[42]\n\nAs an institution that celebrates artistic works of musicians, singers, songwriters, producers and technical specialists, we have come to expect that the Grammys upholds all of the values that reflect the very best in music that is born from our culture. Unfortunately, the awards show has become a series of hypocrisies and contradictions, leaving me to question why any contemporary popular artist would even participate. [...] While there is no doubt in my mind of the artistic talents of Steely Dan or Herbie Hancock, we must acknowledge the massive cultural impact of Eminem and Kanye West and how their music is shaping, influencing and defining the voice of a generation. It is this same cultural impact that acknowledged the commercial and critical success of Michael Jackson's Thriller in 1984.\n\nFormatting [ edit ]\n\nThe Grammys' eligibility period – which runs from October 1 to September 30 each year[43] – is also a perennial source of complaints and confusion. Because records that are released in the last quarter of a given year are not eligible for that year's awards (the submissions and first round ballots are underway at that time), fans often think a favorite artist has been snubbed (e.g., Adele, whose 25 was released in November 2015 and so was not nominated that year despite massive sales[44]). Conversely, the same issue means that the Grammys often recognize work that no longer feels current by the time it wins. Taylor Swift's 1989, for example, won Album of the Year in 2016, even though the album was released in October 2014. The same was the case with Adele’s 25. It was released in November 2015 but received the award in 2017.[45]\n\nRacism in Grammy Awards [ edit ]\n\nThe Grammys have also been accused of being unfavorable and racist to black recording artists. Canadian artist Drake accused the awards in a 2017 interview of seeing him only as a rapper and not as a pop-music artist due to his previous work and heritage. He criticized the snubbing of \"One Dance\" for the prestigious award of Record of the Year and the nomination of \"Hotline Bling\" for Best Rap Song and Best Rap/Sung Performance despite it not being a rap song.[46] The Atlantic's Spencer Kornhaber accused the Grammys of \"sidelining a black visionary work in favor of a white traditionalist one\".[47] Drake did not attend the 2017 Awards Ceremony where he was nominated. He had a performance in Manchester, England on February 12, 2017, the same night as the ceremony. Frank Ocean was vocal about boycotting the same Grammy Awards and did not submit his album for awards consideration as a protest.[48]\n\nThe Grammys were also criticized after the 59th Annual Grammy Awards when Adele's 25 won Album of the Year over Beyonce's album Lemonade, which many music publications felt should have won the award. Steve Knopper of Rolling Stone magazine believed that she lost due to the Grammy voters being all white males and as well as for her pro-Black performance during the Super Bowl 50 halftime show.[49] USA Today also criticized Beyonce's loss stating that \"black artists have struggled to win album of the year\". They also felt 25 won only due to the album's record-breaking sales rather than having a cultural significance and a large impact that Lemonade had in 2016.[50] Singer Adele also expressed that Lemonade should have won over her for Album of the Year, stating in her acceptance speech. In her acceptance speech during the show, she stated:\n\nI can't possibly accept this award. And I'm very humbled and I'm very grateful and gracious. But my artist of my life is Beyonce. And this album to me, the Lemonade album, is just so monumental. Beyonce, it's so monumental. And so well thought out, and so beautiful and soul-baring and we all got to see another side to you that you don't always let us see. And we appreciate that. And all us artists here adore you. You are our light.\n\n[51]\n\nMistreatment of female artists [ edit ]\n\nThe Grammys have also received criticism for their treatment of female artists. Notably at the 60th Grammy Awards, New Zealand singer Lorde made media headlines after turning down an offer to perform at the ceremony. She rumored that she was invited to perform alongside several other artists in a tribute to Tom Petty but was refused a solo slot, despite being nominated for the Album of the Year Award and stated that each of the male nominees were allowed solo performances. Lorde's mother also criticized the Grammys, pointing out an article which stated that only nine percent of nominees at the previous six Grammy Awards were women.[52] Following the 60th ceremony, many media outlets reported that the ceremony had failed women, specifically pointing to the most nominated female artist SZA who did not win in any of her five nominated categories and to the Best Pop Solo Performance category which was composed of four female nominees but won by Ed Sheeran.[53] In an interview, Neil Portnow, President of the Recording Academy attracted controversy by stating that female artists need to \"step up\" in order to win awards. Portnow's comments drew criticism from many female musicians including Pink, Katy Perry, Vanessa Carlton, Sheryl Crow, Iggy Azalea, Halsey and Charli XCX.[54] They also prompted the hashtag #GrammysSoMale on social media.[55]\n\nThe same issue that happened to singer Lorde would occur again before 61st Annual Grammy Awards where singer Ariana Grande decided to not perform and attend that years ceremony over a disagreement over the song choices for the singer's performance. It was reported that Grande felt \"insulted\" when producers refused to allow the singer to perform her latest single \"7 Rings\". They compromised by having the singer perform the song as part of a medley under the condition that the producers chose the second song, causing Grande to pull out of the show. It was also speculated that the same stipulations were not imposed on the other performers of the show.[56] A few days later, the singer broke her silence when she accused Grammy producer Ken Ehrlich for lying about why she dropped out of the show. Ehrlich stated that Grande \"felt it was too late for her to pull something together\". Grande responded stating:\n\nI can pull together a performance over night and you know that, Ken, it was when my creativity & self expression was stifled by you, that I decided not to attend. I hope the show is exactly what you want it to be and more.\n\n[57]\n\nDespite the controversy, Grande ended up winning that night for Best Pop Vocal Album and in 2020 performed at the 62nd Annual Grammy Awards where she was nominated for five awards, including Album of the Year but ended up losing every award she was nominated for to Billie Eilish.[58]\n\n2020 controversy [ edit ]\n\nRecording Academy CEO Deborah Dugan was placed on leave after allegations of misconduct on January 16, 2020 just ten days before the 62nd Annual Grammy Awards. Dugan would immediately file a lawsuit against the National Academy of Recording Arts and Sciences after she was wrongfully fired for alleging sexual harassment claims of a female worker and irregularities with the Grammy nominations.[59] On the nominations for the 61st Annual Grammy Awards, Dugan stated that the voting process was an \"outrageous conflict of interest\" with several nominated artists sitting on the voting boards of their prospective categories. She stated that \"one artist who initially ranked 18 out of 20 in the 2019 'Song of the Year' category ended up with a nomination\". She also stated that few artists like Ed Sheeran and Ariana Grande had the votes to be nominated for the category, but were ultimately omitted.[60]\n\nTV broadcasts and ratings [ edit ]\n\nPrior to the first live Grammys telecast in 1971 on ABC, a series of filmed annual specials in the 1960s called The Best on Record were broadcast on NBC. The first Grammy Award telecast took place on the night of November 29, 1959, as an episode of the NBC anthology series NBC Sunday Showcase, which was normally devoted to plays, original TV dramas, and variety shows. Until 1971, awards ceremonies were held in both New York and Los Angeles, with winners accepting at one of the two. Pierre Cossette bought the rights to broadcast the ceremony from the National Academy of Recording Arts and Sciences and organized the first live telecast.[61] CBS bought the rights in 1973 after moving the ceremony to Nashville, Tennessee; the American Music Awards were created for ABC (by the late Dick Clark) as a result.\n\nThe Recording Academy announced on June 21, 2011, that it had reached a new deal with CBS to keep the awards show on the network for another 10 years. As part of the new contract, the network would also air a \"nominations concert\" special in the last week of November where the nominees are released during the special that is exclusive to CBS, rather than the traditional early-morning press conference with a release of the nominations seen with most major awards ceremonies which any network takes as part of a press pool. This was pulled off after the 2016 concert due to low ratings and criticism about the announcement format, and as of the 2017 nominations, they are revealed during a roundtable conversation about the nominations with Recording Academy representatives during CBS This Morning. In 2016, the Grammys became the first awards show to be broadcast live in all U.S. territories, and for decades, alongside the Academy Awards, Primetime Emmy Awards and Tony Awards, have aired live in more than 150 countries worldwide.\n\nFrom 2004 to 2019, the Grammys were held on the second Sunday of February (the week after the Super Bowl), with two exceptions: if that day was February 14 (Valentine's Day), it was moved to the following day; if it was a Winter Olympics year, it was held earlier on the last Sunday of January (the week before the Super Bowl). Starting in 2020, the Academy Awards ceremony will move back to the second Sunday of February, forcing the Grammys to move back to the last Sunday of January to avoid a conflict with either the Oscars or the Super Bowl.[62][63] To allow sufficient time for preparation, the cutoff date for eligible recordings will move from September 30 to August 31. This change means the eligibility period for the 2020 awards is eleven months (October 1, 2018 – August 31, 2019), a month shorter than usual.[64]\n\nViewership by year [ edit ]\n\nThe Grammys and record sales [ edit ]\n\nWhen the televised Grammys came into renown in 1975, a relationship between Grammy Award winners and subsequent record sales began.[81] Many articles of Billboard magazine communicate the commercial impact of winning a Grammy—improved record sales.[82]\n\nHowever, it was not until after 1984 that Grammy recipients' records displayed a substantial increase in sales. This was largely due to an agreement made by NARAS and the National Association of Record Merchandisers (NARM). Under this agreement \"record labels provided stickers, posters and other point-of-purchase material emblazoned 'Grammy Nominee' or 'Grammy Award Winner' that retailers could use in order to improve marketing effects.\"[81]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/22px-Commons-logo.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Audio_a.svg/30px-Audio_a.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/30px-Wikidata-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/7/77/Grammy_Award_2002.jpg/220px-Grammy_Award_2002.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Billie_Eilish_MTV_2019_2_%28cropped%29.png/116px-Billie_Eilish_MTV_2019_2_%28cropped%29.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/timeline/cb5badf44813a75e18b3df69953ea69a.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Staples_Center_-_panoramio.jpg/200px-Staples_Center_-_panoramio.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/06/Wiktionary-logo-v2.svg/30px-Wiktionary-logo-v2.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/30px-Flag_of_the_United_States.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Ambox_current_red.svg/40px-Ambox_current_red.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/7/77/Grammy_Award_2002.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/7/77/Grammy_Award_2002.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Grammy_Award", "title": "Grammy Award", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/7/77/Grammy_Award_2002.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}