{"url": "https://en.wikipedia.org/wiki/List_of_awards_and_nominations_received_by_Black_Mirror", "text": "Wikipedia list article\n\nBlack Mirror is a British science fiction anthology series created by Charlie Brooker. Premiering on 4 December 2011, the first two series aired on British network Channel 4, as did the special \"White Christmas\", whereas the following three series were released on the American streaming platform Netflix. There are twenty-two episodes in the show's first five series, and an additional interactive film Bandersnatch has also been released.[1] Inspired by The Twilight Zone, each episode of Black Mirror is standalone and explores the common theme of technology and its side-effects.[2]\n\nBlack Mirror has received positive reception from critics[a] and has been nominated for eighty-four awards, winning twenty-five of them. The most acclaimed episodes are \"USS Callister\", which won four Emmy Awards, and \"San Junipero\", which won two. Additionally, the interactive film Black Mirror: Bandersnatch won two Emmy Awards. As actors rarely appear in more than one episode, the only people to receive multiple awards for their work on the show are writer Charlie Brooker, who has won six, and executive producer Annabel Jones, who has won three. The series has been nominated for fourteen British Academy Film Awards, winning two, and fifteen Emmy Awards, winning nine.\n\nStatistics [ edit ]\n\nEpisodes [ edit ]\n\nThirteen of the show's twenty-two episodes have received awards or nominations, including those given to specific people for their work on the episode. The interactive film Black Mirror: Bandersnatch has also received awards and nominations.\n\nPeople [ edit ]\n\nEighteen people have received two or more nominations for their work on Black Mirror.\n\nNumber of awards and nominations by person Person Role Awards Nominations Charlie Brooker Executive producer; writer 7 13 Annabel Jones Executive producer 4 7 Joel Collins Production designer 2 5 Kenny Clark Sound editor 2 4 Russell McLean Visual effects producer 2 4 Michael Maroussas Dialogue editor 2 3 Tim Cavagin Re-recording mixer 1 2 William Bridges Writer 1 2 Tanya Lodge Make-up designer 1 2 John Rodda Sound mixer 1 2 Louise Sutton Producer 1 2 Jesse Plemons Actor 0 3 Bryce Dallas Howard Actor 0 2 Justin Hutchinson-Chatburn Visual effects supervisor 0 2 Seamus McGarvey Director of photography 0 2 Cristin Milioti Actor 0 2 Stephan Pehrsson Director of photography 0 2 Jimmi Simpson Actor 0 2 Letitia Wright Actor 0 2\n\nArt Directors Guild Awards [ edit ]\n\nThe Art Directors Guild present the ADG Excellence in Production Design Awards for American film, television and other media with outstanding production design.[14]\n\nBAFTA Awards [ edit ]\n\nThe British Academy of Film and Television Arts (BAFTA) was founded in 1947 under the name British Film Academy to recognise excellence in the British film industry. In 1958, they merged with the Guild of Television Producers and Directors, and began to give awards to British television programmes.[18] In 2000, television awards were split into the British Academy Television Awards, given for work in production, and the British Academy Television Craft Awards, presented for technical achievements.[19]\n\nBAFTA Television Awards [ edit ]\n\nBAFTA Television Awards and nominations received by Black Mirror Year Category Nominee(s) Result Ref. 2018 Best Single Drama \"Hang the DJ\" Nominated [20] Best Actor Joe Cole (Episode: \"Hang the DJ\") Nominated Best Supporting Actor Jimmi Simpson (Episode: \"USS Callister\") Nominated 2019 Best Single Drama Black Mirror: Bandersnatch Nominated [21]\n\nBAFTA Television Craft Awards [ edit ]\n\nBAFTA Craft Awards and nominations received by Black Mirror Year Category Nominee(s) Result Ref. 2012 Best Production Design Joel Collins and Daniel May (Episode: \"Fifteen Million Merits\") Nominated [22] 2014 Best Single Drama Black Mirror (Episode: \"Be Right Back\") Nominated [23] 2017 Best Make Up and Hair Design Tanya Lodge (Episode: \"San Junipero\") Won [24] Best Special, Visual and Graphic Effects Justin Hutchinson-Chatburn, Framestore, Glassworks, Baseblack (Episode: \"Playtest\") Nominated Best Costume Design Susie Coulthard (Episode: \"San Junipero\") Nominated Best Photography and Lighting – Fiction Seamus McGarvey (Episode: \"Nosedive\") Nominated 2018 Sound: Fiction John Rodda, Tim Cavagin, Kenny Clark, Michael Maroussas (Episode: \"USS Callister\") Nominated [25] Photography & Lighting: Fiction Stephan Pehrsson (Episode: \"USS Callister\") Nominated Production Design Joel Collins, Phil Sims (Episode: \"USS Callister\") Nominated Special, Visual Effects & Graphics Dneg TV, Jean-clement Soret, Russell McLean, Joel Collins (Episode: \"Metalhead\") Won Writer: Drama Charlie Brooker (Episode: \"Hang the DJ\") Nominated 2019 Best Special, Visual And Graphic Effects Black Mirror: Bandersnatch Nominated [26] Editing: Fiction Tony Kearns (Episode: Black Mirror: Bandersnatch) Nominated [27]\n\nBlack Reel Awards [ edit ]\n\nEstablished in 2000 and presented by the Foundation for the Augmentation of African-Americans in Film, the Black Reel Awards are presented for African-American excellence in film and television. Initially limited to Hollywood, awards are now given to worldwide media.[28]\n\nBroadcast Awards [ edit ]\n\nThe Broadcast Awards, associated with the magazine Broadcast, are a series of awards given to British television programmes.[30]\n\nBroadcast Awards and nominations received by Black Mirror Year Category Nominee(s) Result Ref. 2013 Best Single Drama \"The National Anthem\" Nominated [31] 2016 Best Single Drama \"White Christmas\" Nominated [32] 2018 Best Single Drama \"San Junipero\" Won [33]\n\nCinema Audio Society Awards [ edit ]\n\nThese awards are presented by the American Cinema Audio Society for sound mixing in film and television.[34]\n\nCinema Audio Society Awards and nominations received by Black Mirror Year Category Nominee(s) Result Ref. 2017 Outstanding Achievement in Sound Mixing for Television Movies and Mini-Series Adrian Bell, Martin Jensen, Philip Clements, Rory de Carteret (Episode: \"San Junipero\") Nominated [35] 2018 Outstanding Achievement in Sound Mixing for a Television Movie or Mini-Series John Rodda, Tim Cavagin, Dafydd Archard, Will Miller, Nick Baldock and Sophia Hardman (Episode: \"USS Callister\") Won [36]\n\nEmmy Awards [ edit ]\n\nEmmy Awards are given by the Academy of Television Arts & Sciences, an organisation founded in 1946, for television shows broadcast or available for download and streaming in America. The main award is the Primetime Emmy Award, whilst Creative Arts Emmy Awards are given in technical, creative and craft categories, and International Emmy Awards are presented to shows airing outside of the U.S.[37][38][39]\n\nEmmy Awards [ edit ]\n\nInternational Emmy Awards [ edit ]\n\nFangoria Chainsaw Awards [ edit ]\n\nThe Fangoria Chainsaw Awards are given to horror and thriller films. In association with the fan magazine Fangoria, the awards have been given annually since 1992.[47]\n\nFangoria Chainsaw Awards and nominations received by Black Mirror Year Category Nominee(s) Result Ref. 2017 Best TV Series Black Mirror Nominated [48] 2019 Best Streaming Premiere Film David Slade (Black Mirror: Bandersnatch) Nominated [49]\n\nGold Derby Awards [ edit ]\n\nGold Derby is an American awards prediction website founded in 2000.[50] The Gold Derby Awards for television began in 2004.[51]\n\nGold Derby Awards and nominations received by Black Mirror Year Category Nominee(s) Result Ref. 2017 Best TV Movie \"San Junipero\" Won [52][53] Best Miniseries/TV Movie Actress Bryce Dallas Howard (Episode: \"Nosedive\") Nominated Best Miniseries/TV Movie Supporting Actress Gugu Mbatha-Raw (Episode: \"San Junipero\") Nominated 2018 Best TV Movie \"USS Callister\" Won [54][55] Best Miniseries/TV Movie Actor Jesse Plemons (Episode: \"USS Callister\") Nominated Best Miniseries/TV Movie Actress Cristin Milioti (Episode: \"USS Callister\") Nominated Best Miniseries/TV Movie Supporting Actor Jimmi Simpson (Episode: \"USS Callister\") Nominated\n\nGolden Reel Awards [ edit ]\n\nThe Golden Reel Awards are presented by the Motion Picture Sound Editors, an American organisation founded in 1953. The awards are given for excellence in sound editing.[56]\n\nGolden Reel Awards and nominations received by Black Mirror Year Category Nominee(s) Result Ref. 2018 Outstanding Achievement in Sound Editing — Episodic Long Form – Dialogue/ADR Kenny Clark, Michael Maroussas (Episode: \"USS Callister\") Won [57] Outstanding Achievement in Sound Editing — Episodic Long Form – Effects/Foley Kenny Clark (Episode: \"USS Callister\") Nominated\n\nHugo Awards [ edit ]\n\nThe Hugo Awards are a series of science fiction awards which have been presented by the World Science Fiction Society since 1953.[58] Formats recognised include literature, film and serial works.[59]\n\nHugo Awards and nominations received by Black Mirror Year Category Nominee(s) Result Ref. 2017 Best Dramatic Presentation, Short Form Charlie Brooker, Owen Harris (Episode: \"San Junipero\") Nominated [60] 2018 Best Dramatic Presentation, Short Form William Bridges, Charlie Brooker and Toby Haynes (Episode: \"USS Callister\") Nominated [61]\n\nIGN Awards [ edit ]\n\nThese awards are given by IGN Entertainment, an entertainment media company specialising in video games.[62]\n\nIGN Awards and nominations received by Black Mirror Year Category Nominee(s) Result Ref. 2018 Best Streaming Exclusive Black Mirror Nominated [63] Best TV Episode \"San Junipero\" Won [64]\n\nProducers Guild of America Awards [ edit ]\n\nThe Producers Guild of America have held annual awards to recognise American film, television and new media since 1990.[65]\n\nSaturn Awards [ edit ]\n\nThe Academy of Science Fiction, Fantasy and Horror Films present the Saturn Awards for works of science fiction, fantasy and horror. Since 1973, the awards have been presented to American films, television programmes and other media.[69]\n\nVisual Effects Society Awards [ edit ]\n\nThe American Visual Effects Society present the Visual Effects Society Awards to films, television shows, video games and commercials with outstanding visual effects.[71]\n\nVisual Effects Society Awards and nominations received by Black Mirror Year Category Nominee(s) Result Ref. 2017 Outstanding Visual Effects in a Photoreal Episode Justin Hutchinson-Chatburn, Russell McLean, Grant Walker, Christopher Gray (Episode: \"Playtest\") Nominated [72] 2018 Outstanding Animated Character in an Episode or Real-Time Project Steven Godfrey, Stafford Lawrence, Andrew Robertson, Lestyn Roberts (Episode: \"Metalhead\") Nominated [73]\n\nOther awards [ edit ]\n\nNotes [ edit ]\n\n^ [3] series 2 received an 86% rating[4] and \"White Christmas\" received a 93% rating.[5] Series 3 holds an 86% rating on Rotten Tomatoes[6] and a score of 82 on [7] series 4 holds an 84% rating on Rotten Tomatoes[8] and a score of 72 on Metacritic.[9] Bandersnatch holds a 72% rating on Rotten Tomatoes[10] and a score of 61 on Metacritic.[11] Series 5 holds a rating of 63% on Rotten Tomatoes[12] and a score of 63 on Metacritic.[13] On Rotten Tomatoes , series 1 received a 97% rating,series 2 received an 86% ratingand \"White Christmas\" received a 93% rating.Series 3 holds an 86% rating on Rotten Tomatoesand a score of 82 on Metacritic series 4 holds an 84% rating on Rotten Tomatoesand a score of 72 on Metacritic.holds a 72% rating on Rotten Tomatoesand a score of 61 on Metacritic.Series 5 holds a rating of 63% on Rotten Tomatoesand a score of 63 on Metacritic.", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Charlie_Brooker.jpg/180px-Charlie_Brooker.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Cscr-featured.svg/20px-Cscr-featured.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Bryce_Dallas_Howard_June_2018.jpg/170px-Bryce_Dallas_Howard_June_2018.jpg", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Charlie_Brooker.jpg/1200px-Charlie_Brooker.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/db/Jesse_Plemons_%2820769593584%29.jpg/170px-Jesse_Plemons_%2820769593584%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Letitia_Wright_by_Gage_Skidmore.jpg/150px-Letitia_Wright_by_Gage_Skidmore.jpg", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Charlie_Brooker.jpg/1200px-Charlie_Brooker.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_awards_and_nominations_received_by_Black_Mirror", "title": "List of awards and nominations received by Black Mirror", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Charlie_Brooker.jpg/1200px-Charlie_Brooker.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}