{"url": "https://variety.com/2017/film/reviews/blade-runner-2049-review-1202576220/", "text": "The world as we know it has nearly caught up to the one Ridley Scott imagined when he directed the 2019-set “Blade Runner,” and yet, for all the influence the dystopian cult favorite has had on other sci-fi movies, Scott’s vision of Los Angeles still looks as mind-blowingly futuristic now as it did in 1982. That may well explain why its sequel, the Denis Villeneuve-directed “Blade Runner 2049,” doesn’t feel the need to reinvent the world in which it takes place, but instead is free to delve deep into the existential concerns suggested by the earlier film, as screenwriters Hampton Fancher (who also co-wrote the original) and Michael Green raise evocative questions about human-android relations and the nuances that will one day be used to tell them apart.\n\nSure as it is to delight “Blade Runner” fans, this stunningly elegant follow-up doesn’t depend on having seen the original — and like 2010’s “Tron: Legacy,” may actually play better to those who aren’t wedded to the franchise’s muddled off-screen mythology. As it happens, in both tone and style, the new film owes more to slow-cinema maestro Andrei Tarkovsky than it does to Scott’s revolutionary cyberpunk sensibility. In fact, at 2 hours and 44 minutes, “Blade Runner 2049” clocks in at three minutes longer than the austere Russian auteur’s “Stalker.” But Villeneuve earns every second of that running time, delivering a visually breathtaking, long-fuse action movie whose unconventional thrills could be described as many things — from tantalizing to tedious — but never “artificially intelligent.”\n\nWhereas it took five different versions for Ridley Scott to satisfyingly answer the question raised by Philip K. Dick’s speculative-fiction novel, “Do Androids Dream of Electric Sheep?” (four of which suggest the director himself didn’t quite recognize what was most fascinating about his own film), Villeneuve gets it right on his first attempt, operating from the premise that when androids dream, their innermost desire is to be human. Following that thread to its natural conclusion, Villeneuve has crafted a slick, 21st-century Pinocchio story, in which a replicant yearns to be a real boy — although that’s just one facet of the film’s many dimensions. Make no mistake: Whereas the original “Blade Runner” was (eventually) embraced for its unrealized potential, its sequel ranks as one of the great science-fiction films of all time.\n\nTogether with DP Roger Deakins (in the most spectacular of their three collaborations) and a gifted team of design artists (led by “Spectre” production designer Dennis Gassner), Villeneuve offers a bracing vision of where humankind is headed, iconically lit in amber, neon hues and stark fluorescent white. Those are not necessarily the colors one associates with film noir. But then, “Blade Runner 2049” could hardly be considered a conventional example of the style, using its obligatory blaster-pistol shootouts and gymnastic hand-to-hand combat (nods to the original) to lend excitement to its more profound philosophical agenda — aided by Benjamin Wallfisch and Hans Zimmer’s atmospheric score, which features a few nice synth jazz stretches, but leans more on bass-vibrating Dolby flatulence than what might typically be called music.\n\nJust as Villeneuve did with his previous feature, 2016’s “Arrival,” whose piercingly emotional core elevated its pulp alien-invasion premise, in “Blade Runner 2049,” he subverts the genre in favor of a rich inquiry into the nature of the soul itself. The film’s true concerns are perhaps best illustrated by a superficially kinky, yet surprisingly tender three-way sex scene between a human, a replicant and a state-of-the-art companion hologram as each of the parties seeks its own desired form of connection.\n\nComing to the world of blockbusters from an art cinema background, Villeneuve doesn’t deal in the conventional idea of suspense, where a difficult goal must be achieved on an imminent deadline; rather, he operates via a kind of dramatic suspension, in which he challenges attention-deficit audiences to adapt to his unnaturally attenuated pace. Certainly, if anything has changed in the almost three decades since “Blade Runner,” it’s the speed at which modern people are expected to process things, and yet, in “Blade Runner 2049,” the simplest actions take an impossibly long time (consider the almost sadistically drawn-out sequence in which a key character retrieves a personal object from a long-ago hiding place, fulfilling an expectation audiences have put together minutes earlier).\n\nAs the film opens, the year, of course, is 2049. Sea levels have risen, air quality has worsened and unchecked waste has turned everything south of Los Angeles into a seemingly horizonless scrap heap (San Diego is literally a dump). But apart from that, the world hasn’t changed that much in the 30 years since we last saw Harrison Ford’s Rick Deckard, a bounty hunter tasked with “retiring” renegade android slaves — or “skin jobs” — who realized in that film’s final scene that he might be one as well (depending on whom you believe, and which version you watch).\n\n“Blade Runner 2049” lays the debate to rest, focusing on a younger and unequivocally robotic model, officer KD6-3.7 (Ryan Gosling). Considerably bulked up since last year’s “La La Land,” the naturally charismatic Gosling is back in the somewhat off-putting zero-emotion mode of “Drive” and “Only God Forgives,” channeling the nihilistic cool Alain Delon demonstrated in hit-man masterpiece “Le Samouraï” to create a character who’s every bit as cool, and twice as inscrutable.\n\nUndeniably handsome though he is, there’s always been something amiss in Gosling’s closely spaced, slightly misaligned eyes, suggesting a “synthetic” human who’s 99% perfect, but still just a bit off. That subtle flaw serves the actor well as “K,” a rule-abiding Blade Runner who takes orders from plausibly tough LAPD Lt. Joshi (Robin Wright). Putting her “House of Cards” severity to excellent use, Wright is the standout in an all-around terrific (and largely female) supporting cast. (With any luck, a small but impactful role from Israeli-Palestinian actress Hiam Abbass could draw attention to her performance in “In Syria.”)\n\nGoing through with a routine mission to apprehend/eliminate an early-model Nexus-8, K makes a startling discovery — one that threatens to undermine the delicate sense of order between humans and the now million-fold class of android slaves. As it is, the replicants’ submission depends on their built-in expiration dates and the understanding that they were created to serve their masters. Any number of things could throw this system into turmoil, though Joshi has reason to fear that this one will incite a replicant uprising, and so orders K to destroy the evidence.\n\nExcept K disobeys, returning to the remote protein farm where the opening fight took place and discovering there a clue that ties him to characters from the original film (whereas the signature object in “Blade Runner” was an origami unicorn, here it’s a carved wooden horse). Still, the links are hazy, since a huge electromagnetic pulse wiped out nearly all digital records a quarter-century earlier — the so-called “Blackout” of 2022 — forcing K to do some old-fashioned sleuthing that will lead him to Deckard himself, hiding out in what remains of the city of Las Vegas.\n\nVilleneuve and Deakins outdo themselves in depicting the topography and skylines of a vastly transformed western United States — a now-grungy country whose government has clearly been co-opted by its most powerful business interests, while its citizens are distracted in the pursuit of their own pleasure (as depicted by body-objectifying advertisements and sculptures, reminiscent of “A.I.’s” hyper-sexualized Rouge City). Practically all-powerful in 2019, the Tyrell Corporation went bankrupt less than a decade later, and is now controlled by a reclusive scientist named Niander Wallace (chameleonic Jared Leto, who here assumes a burly beard and Nick Offerman-like accent to match, not to mention milky eyes and an elaborate levitating-camera system to supply his vision).\n\nFrom his ultra-modern corporate lair, Wallace is forever trying to innovate replicant technology, referring to his creations — including his ruthless favorite, Luv (Sylvia Hoeks) — as his “angels,” and hoping to engineer one with that most dangerous ability of all. In a world where man plays god, the ultimate goal — or “miracle” — would be giving these synthetic humans the power to reproduce themselves. (As it happens, that preoccupation with A.I. attempting to create life also serves as the central theme of Ridley Scott’s “Alien” prequels, where the underlying phobia has to do with humans engineering androids with the potential to surpass them.)\n\nThe scientific particulars of “Blade Runner 2049” are only nominally interesting, whereas its science-fiction framework allows for audiences to interpret the allegory as they see fit. Certainly, there’s an obvious parallel to past slave-holding societies, in which the dominant race or class has cited its dubious superiority in order to rationalize the harsh treatment of so-called “sub-humans.” Again, K knows he’s a replicant, but also imagines himself as something of a Christ figure in a godless world. But then, when dealing with replicants, from Deckard to the Sean Young character he detected decades ago, hasn’t the issue always been their uncanny ability to delude themselves?\n\nThat’s where K’s designed-for-his-pleasure hologram Joi (Cuban actress Ana de Armas) comes in: She’s relatively new to the whole A.I. game, programmed to be submissive, and yet, Villeneuve devotes a significant portion of the film to observing the process by which she attempts to establish her own identity and emotions. Opposite Gosling’s almost entirely blank-faced performance, Joi effectively represents the soul of the film — as do Luv, in her own misguided way, and “Wetlands” star Carla Juri, as a “memory maker” of mysterious provenance. It’s perhaps the central irony of “Blade Runner 2049,” which depicts a future where humans have gone astray, while new-and-improved androids know precisely what they want: to be human.", "images": ["https://pmcvariety.files.wordpress.com/2017/09/blade-runner-20492.jpg?w=1000", "https://s3.amazonaws.com/heartbeat.pmc.com/track?host=variety.com&path=%2F2017%2Ffilm%2Freviews%2Fblade-runner-2049-review-1202576220%2F&ct=article&lob=variety&loc=us&env=desktop&post_id=1202576220&comment_count=86", "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY"], "top_img": "https://pmcvariety.files.wordpress.com/2017/09/blade-runner-20492.jpg?w=1000", "keywords": [], "authors": ["Peter Debruge"], "canonical_link": "https://variety.com/2017/film/reviews/blade-runner-2049-review-1202576220/", "title": "Film Review: ‘Blade Runner 2049’", "meta_data": {"theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-title": "Variety", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://s2.wp.com/wp-content/themes/vip/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "'Arrival' director Denis Villeneuve picks up 30 years after the cult classic left off, diving deep into the existential concerns of androids", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199}, "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202576220, "author": "Peter Debruge", "pmc-category": "Reviews", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-09-29T06:00:52"}, "pmc-tag": "Blade Runner 2049,Denis Villeneuve,Ryan Gosling", "title": "Film Review: ‘Blade Runner 2049’", "pageclass": "article", "pmc-vertical": "film", "pmc-primary-category": "Reviews", "pmc-primary-vertical": "film", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress.com", "og": {"type": "article", "title": "Film Review: ‘Blade Runner 2049’", "url": "https://variety.com/2017/film/reviews/blade-runner-2049-review-1202576220/", "description": "The world as we know it has nearly caught up to the one Ridley Scott imagined when he directed the 2019-set “Blade Runner,” and yet, for all the influence the dystopian cult favorite has had on oth…", "site_name": "Variety", "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/09/blade-runner-20492.jpg?w=1000", "width": 1000, "height": 563, "alt": "Blade Runner 2049"}, "locale": "en_US"}, "article": {"published_time": "2017-09-29T13:00:52+00:00", "modified_time": "2017-09-29T13:11:04+00:00"}, "twitter": {"creator": "@https://twitter.com/askdebruge?lang=en", "site": "@variety", "text": {"title": "Film Review: ‘Blade Runner 2049’"}, "image": {"identifier": "https://pmcvariety.files.wordpress.com/2017/09/blade-runner-20492.jpg?w=1000", "alt": "Blade Runner 2049"}, "card": "summary_large_image", "title": "Film Review: ‘Blade Runner 2049’", "description": "'Arrival' director Denis Villeneuve picks up 30 years after the cult classic left off, diving deep into the existential concerns of androids"}, "author": "Peter Debruge", "content_type": "Article", "post_id": 1202576220, "title": "Film Review: 'Blade Runner 2049'", "published_at": "2017-09-29 06:00:52", "image": "https://pmcvariety.files.wordpress.com/2017/09/blade-runner-20492.jpg?w=1000", "comment_count": 86, "tags": "Ryan Gosling", "topics": "Reviews", "appeared_in_print": "No", "body": "The world as we know it has nearly caught up to the one Ridley Scott imagined when he directed the 2019-set “Blade Runner,” and yet, for all the influence the dystopian cult favorite has had on other sci-fi movies, Scott’s vision of Los Angeles still looks as mind-blowingly futuristic now as it did in 1982. That may well explain why its sequel, the Denis Villeneuve-directed “Blade Runner 2049,” doesn’t feel the need to reinvent the world in which it takes place, but instead is free to delve deep into the existential concerns suggested by the earlier film, as screenwriters Hampton Fancher (who also co-wrote the original) and Michael Green raise evocative questions about human-android relations and the nuances that will one day be used to tell them apart.\r\n\r\nSure as it is to delight “Blade Runner” fans, this stunningly elegant follow-up doesn’t depend on having seen the original — and like 2010’s “Tron: Legacy,” may actually play better to those who aren’t wedded to the franchise’s muddled off-screen mythology. As it happens, in both tone and style, the new film owes more to slow-cinema maestro Andrei Tarkovsky than it does to Scott’s revolutionary cyberpunk sensibility. In fact, at 2 hours and 44 minutes, “Blade Runner 2049” clocks in at three minutes longer than the austere Russian auteur’s “Stalker.” But Villeneuve earns every second of that running time, delivering \r\n\r\nWhereas it took five different versions for Ridley Scott to satisfyingly answer the question raised by Philip K. Dick’s speculative-fiction novel, “Do Androids Dream of Electric Sheep?” (four of which suggest the director himself didn’t quite recognize what was most fascinating about his own film), Villeneuve gets it right on his first attempt, operating from the premise that when androids dream, their innermost desire is to be human. Following that thread to its natural conclusion, Villeneuve has crafted a slick, 21st-century Pinocchio story, in which a replicant yearns to be a real boy — although that’s just one facet of the film’s many dimensions. Make no mistake: Whereas the original “Blade Runner” was (eventually) embraced for its unrealized potential, its sequel ranks as one of the great science-fiction films of all time.\r\n\r\nTogether with DP Roger Deakins (in the most spectacular of their three collaborations) and a gifted team of design artists (led by “Spectre” production designer Dennis Gassner), Villeneuve offers a bracing vision of where humankind is headed, iconically lit in amber, neon hues and stark fluorescent white. Those are not necessarily the colors one associates with film noir. But then, “Blade Runner 2049” could hardly be considered a conventional example of the style, using its obligatory blaster-pistol shootouts and gymnastic hand-to-hand combat (nods to the original) to lend excitement to its more profound philosophical agenda — aided by Benjamin Wallfisch and Hans Zimmer’s atmospheric score, which features a few nice synth jazz stretches, but leans more on bass-vibrating Dolby flatulence than what might typically be called music.\r\n\r\nJust as Villeneuve did with his previous feature, 2016’s “Arrival,” whose piercingly emotional core elevated its pulp alien-invasion premise, in “Blade Runner 2049,” he subverts the genre in favor of a rich inquiry into the nature of the soul itself. The film’s true concerns are perhaps best illustrated by a superficially kinky, yet surprisingly tender three-way sex scene between a human, a replicant and a state-of-the-art companion hologram as each of the parties seeks its own desired form of connection.\r\n\r\nComing to the world of blockbusters from an art cinema background, Villeneuve doesn’t deal in the conventional idea of suspense, where a difficult goal must be achieved on an imminent deadline; rather, he operates via a kind of dramatic suspension, in which he challenges attention-deficit audiences to adapt to his unnaturally attenuated pace. Certainly, if anything has changed in the almost three decades since “Blade Runner,” it’s the speed at which modern people are expected to process things, and yet, in “Blade Runner 2049,” the simplest actions take an impossibly long time (consider the almost sadistically drawn-out sequence in which a key character retrieves a personal object from a long-ago hiding place, fulfilling an expectation audiences have put together minutes earlier).\r\n\r\nAs the film opens, the year, of course, is 2049. Sea levels have risen, air quality has worsened and unchecked waste has turned everything south of Los Angeles into a seemingly horizonless scrap heap (San Diego is literally a dump). But apart from that, the world hasn’t changed that much in the 30 years since we last saw Harrison Ford’s Rick Deckard, a bounty hunter tasked with “retiring” renegade android slaves — or “skin jobs” — who realized in that film’s final scene that he might be one as well (depending on whom you believe, and which version you watch).\r\n\r\n“Blade Runner 2049” lays the debate to rest, focusing on a younger and unequivocally robotic model, officer KD6-3.7 (Ryan Gosling). Considerably bulked up since last year’s “La La Land,” the naturally charismatic Gosling is back in the somewhat off-putting zero-emotion mode of “Drive” and “Only God Forgives,” channeling the nihilistic cool Alain Delon demonstrated in hit-man masterpiece “Le Samouraï” to create a character who’s every bit as cool, and twice as inscrutable.\r\n\r\nUndeniably handsome though he is, there’s always been something amiss in Gosling’s closely spaced, slightly misaligned eyes, suggesting a “synthetic” human who’s 99% perfect, but still just a bit off. That subtle flaw serves the actor well as “K,” a rule-abiding Blade Runner who takes orders from plausibly tough LAPD Lt. Joshi (Robin Wright). Putting her “House of Cards” severity to excellent use, Wright is the standout in an all-around terrific (and largely female) supporting cast. (With any luck, a small but impactful role from Israeli-Palestinian actress Hiam Abbass could draw attention to her performance in “In Syria.”)\r\n\r\nGoing through with a routine mission to apprehend/eliminate an early-model Nexus-8, K makes a startling discovery — one that threatens to undermine the delicate sense of order between humans and the now million-fold class of android slaves. As it is, the replicants’ submission depends on their built-in expiration dates and the understanding that they were created to serve their masters. Any number of things could throw this system into turmoil, though Joshi has reason to fear that this one will incite a replicant uprising, and so orders K to destroy the evidence.\r\n\r\nExcept K disobeys, returning to the remote protein farm where the opening fight took place and discovering there a clue that ties him to characters from the original film (whereas the signature object in “Blade Runner” was an origami unicorn, here it’s a carved wooden horse). Still, the links are hazy, since a huge electromagnetic pulse wiped out nearly all digital records a quarter-century earlier — the so-called “Blackout” of 2022 — forcing K to do some old-fashioned sleuthing that will lead him to Deckard himself, hiding out in what remains of the city of Las Vegas.\r\n\r\nVilleneuve and Deakins outdo themselves in depicting the topography and skylines of a vastly transformed western United States — a now-grungy country whose government has clearly been co-opted by its most powerful business interests, while its citizens are distracted in the pursuit of their own pleasure (as depicted by body-objectifying advertisements and sculptures, reminiscent of “A.I.’s” hyper-sexualized Rouge City). Practically all-powerful in 2019, the Tyrell Corporation went bankrupt less than a decade later, and is now controlled by a reclusive scientist named Niander Wallace (chameleonic Jared Leto, who here assumes a burly beard and Nick Offerman-like accent to match, not to mention milky eyes and an elaborate levitating-camera system to supply his vision).\r\n\r\nFrom his ultra-modern corporate lair, Wallace is forever trying to innovate replicant technology, referring to his creations — including his ruthless favorite, Luv (Sylvia Hoeks) — as his “angels,” and hoping to engineer one with that most dangerous ability of all. In a world where man plays god, the ultimate goal — or “miracle” — would be giving these synthetic humans the power to reproduce themselves. (As it happens, that preoccupation with A.I. attempting to create life also serves as the central theme of Ridley Scott’s “Alien” prequels, where the underlying phobia has to do with humans engineering androids with the potential to surpass them.)\r\n\r\nThe scientific particulars of “Blade Runner 2049” are only nominally interesting, whereas its science-fiction framework allows for audiences to interpret the allegory as they see fit. Certainly, there’s an obvious parallel to past slave-holding societies, in which the dominant race or class has cited its dubious superiority in order to rationalize the harsh treatment of so-called “sub-humans.” Again, K knows he’s a replicant, but also imagines himself as something of a Christ figure in a godless world. But then, when dealing with replicants, from Deckard to the Sean Young character he detected decades ago, hasn’t the issue always been their uncanny ability to delude themselves?\r\n\r\nThat’s where K’s designed-for-his-pleasure hologram Joi (Cuban actress Ana de Armas) comes in: She’s relatively new to the whole A.I. game, programmed to be submissive, and yet, Villeneuve devotes a significant portion of the film to observing the process by which she attempts to establish her own identity and emotions. Opposite Gosling’s almost entirely blank-faced performance, Joi effectively represents the soul of the film — as do Luv, in her own misguided way, and “Wetlands” star Carla Juri, as a “memory maker” of mysterious provenance. It’s perhaps the central irony of “Blade Runner 2049,” which depicts a future where humans have gone astray, while new-and-improved androids know precisely what they want: to be human.", "application-name": "Variety", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=https://variety.com/feed/;icon-uri=https://pmcvariety.files.wordpress.com/2018/06/variety-favicon.png?w=16", "onesignal": "wordpress-plugin", "fragment": "!"}, "movies": [], "publish_date": 1506690052.0, "source": "https://variety.com", "summary": ""}