{"url": "www.teenvogue.com/story/kylie-jenner-spoiled-a-major-plot-point-of-the-handmaids-tale-on-instagram", "text": "Fans of Kylie Jenner are used to the makeup mogul sharing her every move on social media. Unfortunately, one of her newest stories probably should have come with a spoiler alert.\n\nFans of The Handmaid's Tale might be a little disappointed that Kylie may have unintentionally posted a major spoiler from the series on her Story. Quit reading now if you haven't yet made it through the second season.\n\nThanks to Kylie, some viewers caught a glimpse of a family photo from the series that featured Fred and Serena with a baby. The picture would obviously mean that Offred aka June (Elisabeth Moss) had her child, and that the baby ended up in the custody of the couple, not June.\n\nThe picture came just as Kylie attended the show's finale party, though it was oddly enough the only Handmaids-related content posted by the star. The decision to the post the picture has drawn mixed reactions, including \"What is Kylie Jenner trying to tell us by Instagramming this creepy portrait from the Handmaid’s Tale?\" and \"Wow If you're only a couple episodes into a Handmaid's Tale don't watch Kylie's story.\"\n\nOne follower couldn't even believe that Kylie had been the one to spoil the show, tweeting, \"I haven’t finished s2 of Handmaid’s tale yet and Kylie Jenner just dropped a spoiler out of all places to see a spoiler ffs I’ve been avoiding everywhere.\" Thankfully, this Twitter user found a way to laugh about the incident, writing, \"Big mood is Kylie Jenner posting the complete family portrait of The Waterford’s from The Handmaid’s Tale on her IG story.\"\n\nAlthough some viewers were rightfully a little upset, others definitely enjoyed the idea that they shared a binge-watch favorite with the celeb. \"TIL that Kylie Jenner also watches The Handmaid’s Tale so she won some cool points,\" one person shared. And one Twitter follower could even relate to the Kylie's love of the show, tweeting, \"Kylie fangirling over The Handmaid’s Tale is me af.\"\n\nWhether Kylie secretly meant anything by the photo or she was just excited to be at the premiere remains unclear, but as Noah Schnapp of Stranger Things recently demonstrated, sometimes, spoilers just happen.\n\nLet us slide into your DMs. Sign up for the Teen Vogue daily email.\n\nWant more from Teen Vogue? Check this out: This Is Why Kylie Jenner Deleted All Pictures of Stormi's Face on Instagram", "images": ["http://www.teenvogue.com/verso/static/teen-vogue/assets/logo-reverse.c9fd2ea81f6f84a7d604882e3d5f7ab119aeee5a.svg", "https://assets.teenvogue.com/photos/5b4516b3330f9550cdec86d4/16:9/w_1280,c_limit/FB.jpg", "https://assets.teenvogue.com/photos/5b4516abcd6b096ecd587b3d/16:9/w_2560%2Cc_limit/lede.jpg", "http://www.teenvogue.com/verso/static/teen-vogue/assets/logo-header.a32c5f649a1140996fd12f4a5ee1d0638ce23dc6.svg"], "top_img": "https://assets.teenvogue.com/photos/5b4516b3330f9550cdec86d4/16:9/w_1280,c_limit/FB.jpg", "keywords": [], "authors": ["Lauren Rearick", "Lauren Rearic"], "canonical_link": "https://www.teenvogue.com/story/kylie-jenner-spoiled-a-major-plot-point-of-the-handmaids-tale-on-instagram", "title": "Kylie Jenner Spoiled a Major Plot Point of \"The Handmaid's Tale\" on Instagram", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Lauren Rearick", "copyright": "Copyright (c) Condé Nast 2020", "description": "On her Instagram Story, Kylie posted a screenshot from a recent episode of \"The Handmaid's Tale,\" which fans noticed gives away a big plot arc.", "id": "5b44e69ecd6b096ecd587b1e", "keywords": "tv, kylie jenner,handmaid's tale,the handmaid's tale", "news_keywords": "tv, kylie jenner,handmaid's tale,the handmaid's tale", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5b44e69ecd6b096ecd587b1e", "parsely-metadata": "{\"description\":\"On her Instagram Story, Kylie posted a screenshot from a recent episode of \\\"The Handmaid's Tale,\\\" which fans noticed gives away a big plot arc.\",\"image-16-9\":\"https://assets.teenvogue.com/photos/5b4516ae330f9550cdec86d2/16:9/w_1000,c_limit/tout.jpg\",\"image-1-1\":\"https://assets.teenvogue.com/photos/5b4516ae330f9550cdec86d2/1:1/w_1000,c_limit/tout.jpg\"}", "og": {"description": "Don't read if you haven't seen the most recent episode.", "image": "https://assets.teenvogue.com/photos/5b4516b3330f9550cdec86d4/16:9/w_1280,c_limit/FB.jpg", "site_name": "Teen Vogue", "title": "Kylie Jenner Put a \"Handmaid's Tale\" Spoiler on Her Instagram Story", "type": "article", "url": "https://www.teenvogue.com/story/kylie-jenner-spoiled-a-major-plot-point-of-the-handmaids-tale-on-instagram"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@TeenVogue", "description": "Don't read if you haven't seen the most recent episode.", "domain": "https://www.teenvogue.com", "image": {"src": "https://assets.teenvogue.com/photos/5b4516b3330f9550cdec86d4/16:9/w_1280,c_limit/FB.jpg?mbid=social_retweet"}, "site": "@TeenVogue", "title": "Kylie Jenner Put a \"Handmaid's Tale\" Spoiler on Her Instagram Story"}, "fb": {"app_id": 1013284322017473, "pages": 6636341311}}, "movies": [], "publish_date": null, "source": "http://www.teenvogue.com", "summary": ""}