{"url": "https://en.wikipedia.org/wiki/Zara_Tindall", "text": "Daughter of Princess Anne and Olympic equestrian\n\nZara Anne Elizabeth Tindall (née Phillips; born 15 May 1981) is a member of the British royal family, an equestrian and Olympian. She is the daughter of Princess Anne and Mark Phillips and the eldest granddaughter of Queen Elizabeth II.\n\nTindall won the Eventing World Championship in Aachen in 2006. The same year she was voted 2006 BBC Sports Personality of the Year by the British television viewing public (an award her mother won in 1971). She was appointed Member of the Order of the British Empire (MBE) in the 2007 New Year Honours for her services to equestrianism.[1] In 2012, she carried an Olympic flame at Cheltenham Racecourse on her horse Toytown. As a member of the Great Britain Eventing Team, she won a silver medal at the 2012 Summer Olympics, presented to her by her mother.\n\nAt birth, she was sixth in line of succession to the British throne. She is now 18th in line.[2]\n\nEarly life and education [ edit ]\n\nZara Tindall was born on 15 May 1981 in the Lindo Wing of St Mary's Hospital, London. She was baptised Zara Anne Elizabeth on 27 July 1981, at Windsor Castle, and her first name was suggested by her uncle, the Prince of Wales.[3] Her godparents are her maternal uncle, Prince Andrew; the Countess of Lichfield; Helen, Lady Stewart (wife of Sir Jackie Stewart); Andrew Parker Bowles; and Hugh Thomas.[4] Tindall herself is godmother to Prince George of Cambridge.[5] Tindall has an older brother, Peter Phillips (born 15 November 1977) and two younger half-sisters, Felicity Tonkin (born in 1985 to her father by his brief affair with Heather Tonkin) and Stephanie Phillips, born 2 October 1997 from her father's second marriage to Sandy Pflueger.\n\nTindall went to Beaudesert Park School in Stroud, Gloucestershire, and Port Regis School in Shaftesbury, Dorset, before following other members of the Royal Family in attending Gordonstoun School in Moray, Scotland. During her schooldays, Tindall excelled at many sporting activities, representing her schools in hockey, athletics and gymnastics. She later studied at University of Exeter and qualified as a physiotherapist.[6][7] In December 2000, she had a severe car crash near Bourton-on-the-Water.[8]\n\nEquestrianism [ edit ]\n\nZara Tindall competing at the 2012 Summer Olympics in London.\n\nLike her parents, Tindall is an accomplished equestrian. In June 2003, she announced that she had secured a sponsorship deal with Cantor Index, a leading company in spread betting, to help cover the costs of her equestrian career.[8] She finished runner up at Burghley Horse Trials in 2003 in her first four-star event.[9]\n\nRiding her horse Toytown, Tindall collected individual and team gold medals at the 2005 European Eventing Championship in Blenheim,[10] and individual gold and team silver medals at the 2006 FEI World Equestrian Games in Aachen, Germany, making her the reigning Eventing World Champion until 2010.[11][12] The same year after her win in Germany, she was voted BBC Sports Personality of the Year by the British viewing public (an award her mother won in 1971).[11] She was also appointed Member of the Order of the British Empire (MBE) in the 2007 New Year Honours for her services to equestrianism.[1] Despite winning team gold at the 2007 European Eventing Championships in Italy, she failed to defend her individual title after a problem in the show-jumping phase of the competition.[13]\n\nThe British Olympic Association announced that Tindall would ride Toytown for the British equestrian team at the Beijing Olympic Games 2008 in Hong Kong.[14] However Toytown was injured during training and she was forced to withdraw from the team. Tindall also missed the 2004 Summer Olympics in Athens, when Toytown suffered a similar injury during training.[15]\n\nOn 25 October 2008, Tindall fell from her horse, Tsunami II, at the 15th fence of a cross-country event at Pau, France, and broke her right collarbone. The horse broke its neck after it tipped over the hedge and was put down.[16]\n\nIn 2009, Tindall announced she was designing her own range of equestrian clothing for Musto Outdoor Clothing.[17][18] The range is named ZP176 after the team number she was given when she first represented her country. The range was officially launched in July 2010.[19]\n\nOn 11 June 2012, Tindall was announced as a member of the British Equestrian team for the 2012 London Olympic Games.[20] She competed in the Olympics on High Kingdom and won a silver medal in the team event. Her mother, Princess Anne, presented her medal.[21] Tindall finished second at Luhmühlen Horse Trials 2013, on her top horse High Kingdom.[22] At the World Equestrian Games in 2014, Tindall and High Kingdom were part of the British team that won team silver.[23]\n\nTindall stopped using her maiden name, Phillips, in March 2016. She competed for the first time as Zara Tindall during her unsuccessful attempt to qualify for the 2016 Rio Olympic Games.[24]\n\nCharitable work [ edit ]\n\nTindall supports many charitable causes. She frequently attends various events for charity and has taken to supporting certain causes herself, mainly for spinal injuries, equestrian charities and children's causes. In 2005, she auctioned one of her evening gowns (worn at the London premiere of the film Seabiscuit) to raise money for tsunami relief. She also undertook a visit to New Zealand in her role as patron of The Catwalk Trust.[25][26] From 1998 to 2005, she served as the president of Club 16–24, a group which encourages young people to take an interest in racing.[27] She is linked to Inspire, the Salisbury-based medical research charity which helps to improve the quality of life of people with spinal cord injuries, and Sargent Cancer Care for Children,[28] the UK's leading children's cancer charity. She is Patron and supporter of Lucy Air Ambulance for Children charity[29] which is the UK's first dedicated air transfer service to fly critically ill infants and children from local hospitals to the relevant centre of excellence.\n\nTindall appears at events for The Caudwell Charitable Trust, which is targeted at children with special needs, disabilities and serious illnesses.[30] In 2006, she took part in a special charity day for Cantor Index, whose staff were killed in the 11 September 2001 attacks. In 2007, she became patron of the Mark Davies Injured Riders Fund.[31] To help with Sport Relief 2008, she posed for a portrait by artist Jack Vettriano.[32] In 2009, she attended a celebrity poker tournament in Monaco in aid of Darfur, Sudan.[33] In October 2010, she attended a celebrity poker tournament, this time in London, in aid of Cancer Research UK, of which she is patron. In 2011, she auctioned another evening gown, this time in aide of the Christchurch, New Zealand appeal, with the gown raising £22,000. In 2013, she visited the Stroud Maternity Ward, where she gave birth in 2018, to celebrate their 60th anniversary. In 2014, Tindall lent her support to the #bringbackourgirls campaign.[34]\n\nPersonal life [ edit ]\n\nShe met rugby union player Mike Tindall, who played for Premiership side Gloucester and the England national team during England's Rugby World Cup-winning campaign in Australia in 2003. On 21 December 2010, Buckingham Palace announced the couple's engagement.[35] As required by the Royal Marriages Act 1772, since repealed, the Queen gave her consent to their marriage in a meeting of the Privy Council on 10 May 2011.[36] Tindall proposed to her with \"a custom-designed diamond and platinum ring with a divided diamond band.\"[37][38] The couple held a party on the royal yacht Britannia prior to the wedding.[39] Their wedding was held on 30 July 2011 at the Canongate Kirk in Edinburgh, Scotland, with 400 guests in attendance.[39][40] The marriage was officiated by the Reverend Neil Gardner.[39] Her off-the-peg ivory silk dress designed by Stewart Parvin featured \"a chevron-pleated bodice, a dropped waist, and a \"cathedral-length\" train.\"[41][42] The Meander Tiara was lent to her and secured the veil.[43] Dolly Maude was her maid of honour, and her paternal half-sister Stephanie Phillips was among the bridesmaids.[41][42] A reception was held at Holyrood Palace following the service.[39][44]\n\nIn January 2013 it was reported that the Tindalls had sold their £1.2 million home in Cheltenham, Gloucestershire and were moving to the Gatcombe Park estate near Minchinhampton.[45]\n\nTindall gave birth to a daughter, Mia Grace Tindall ( MEE-ə),[46] on 17 January 2014 at Gloucestershire Royal Hospital. She is 19th in the line of succession since 6 May 2019.[47] Mia was christened on 30 November 2014 at St Nicholas Church in the village of Cherington.[48] Their next two pregnancies ended in miscarriage[49] before their second daughter, Lena Elizabeth Tindall ( LAY-nə),[46][50] was born on 18 June 2018 at the Stroud Maternity Hospital.[51]\n\nIn January 2020, Tindall was banned from driving for six months after accumulating 12 points on her licence. It was also announced that the court was fining her \"£666 plus costs and a victim surcharge of £151\".[52]\n\nArms [ edit ]\n\nCoat of arms of Zara Tindall Notes Tindall bears her father's arms on a lozenge[53] Escutcheon Per chevron Azure and Or, in chief a Horse courant Argent, and in base a Sprig of Forget-me-not Flowers, slipped and leaved Proper.\n\nReferences [ edit ]\n\n\n\n", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/a/ae/Flag_of_the_United_Kingdom.svg/23px-Flag_of_the_United_Kingdom.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Coat_of_Arms_of_Zara_Phillips_%28Variant%29.svg/120px-Coat_of_Arms_of_Zara_Phillips_%28Variant%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Zara_Phillips_High_Kingdom_cross_country_Olympics_2012.jpg/220px-Zara_Phillips_High_Kingdom_cross_country_Olympics_2012.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Gold_medal_icon_%28G_initial%29.svg/16px-Gold_medal_icon_%28G_initial%29.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/b/bf/Zara_Phillips_%282012%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Silver_medal_icon_%28S_initial%29.svg/16px-Silver_medal_icon_%28S_initial%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/b/bf/Zara_Phillips_%282012%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Zara_Tindall", "title": "Zara Tindall", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/b/bf/Zara_Phillips_%282012%29.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}