{"url": "https://en.wikipedia.org/wiki/Mark_Consuelos", "text": "American actor\n\nMark Andrew Consuelos (born March 30, 1971) is an American actor. He is best known for his portrayal of Mateo Santos on the ABC soap opera All My Children (1995–2001; 2010) and supporting actor Hiram Lodge on The CW drama Riverdale (2017–present).\n\nEarly life [ edit ]\n\nMark Consuelos[2] was born in Zaragoza, Spain, to an Italian mother, Camilla, and a Mexican father, Saul Consuelos.[3][4] He is the youngest of three children: he has one brother, a doctor, and one sister, a lawyer. Consuelos has lived in Italy and the United States since childhood. He grew up in Lebanon, Illinois, and later in Brandon, Florida.[2] He attended Bloomingdale High School in Valrico, Florida, and then went to University of Notre Dame before transferring to and graduating from the University of South Florida with a degree in marketing in 1994.[5]\n\nCareer [ edit ]\n\nConsuelos had a starring role in the educational serial Connect With English, which aired on public television stations as part of the Annenberg/CPB Project.[citation needed]\n\nIn February 1995, Consuelos had his breakthrough when he landed the role of Mateo Santos on the soap opera All My Children.[2] There, he fell in love with his on-screen love interest Kelly Ripa, and secretly married her in Las Vegas, in May 1996. At the time, he lived on co-star Winsor Harmon's sofa; Harmon was one of the few to know that co-stars Ripa and Consuelos were not only dating, but married.\n\nRipa and Consuelos continued to tape episodes of All My Children until 2002, when Ripa wished to focus more on her other job: taking over for Kathie Lee Gifford as host of what then became Live! with Regis and Kelly (later known as Live! with Kelly, and subsequently as Live! with Kelly and Michael and even later became \"Live with Kelly and Ryan\"). Consuelos is a regular guest co-host.\n\nSince leaving All My Children, Consuelos has starred in the feature film The Great Raid, which debuted in theatres in 2005. In 2006, he appeared in the movies My Super Ex-Girlfriend, as Steve, and Wedding Daze.[2] He has been seen on the Lifetime series Missing, with Vivica A. Fox.[2] He also had a part in Ugly Betty.\n\nConsuelos hosted two reality dating shows, Age of Love[2] and Science of Love, both airing on NBC in 2007. He guest-starred on Third Watch, Friends, American Family, Fortune Hunter, SeaQuest and Hope & Faith.[2]\n\nA weekly live episode of the Oprah Winfrey Show premiered in the show's 23rd season with a panel consisting of Mark Consuelos, Ali Wentworth, Oprah Winfrey, and Gayle King. The panel discussed the week's news and highlighted events in the media and on the show. In the 2009–10 season, Winfrey hosted this segment on her own. Fridays Live did not return for the show's 25th season.\n\nIn 2010, Consuelos attended the Cop Out premiere in New York where he had a pleasant conversation with Bryan Johnson in view of a spying Walt Flanagan.[6]\n\nIn 2012, Consuelos guest-starred on an episode of Law & Order: Special Victims Unit titled \"Justice Denied\". He played Michael, the prime suspect in a brutal rape during Fleet Week.[7] Consuelos is not new to the Law & Order franchise, he had guest-starred in the sixth-season episode \"Albatross\" of Law & Order: Criminal Intent as the U.S. Attorney involved in a case where the judge's life is threatened.[citation needed]\n\nConsuelos portrayed Spivey, a recurring character, in American Horror Story: Asylum, the second season of the anthology horror series.[8]\n\nIn 2013, Consuelos co-starred as Florida Senator Andy Guzman in Amazon's Alpha House, a political comedy written by Doonesbury creator Garry Trudeau.[9] Along with John Goodman, Consuelos plays one of four Republican senators living together in a house on Capitol Hill. He has spent the summer of 2014 filming the second season.\n\nIn 2016, Consuelos landed a role on a new FOX series, Pitch, as Oscar Arguella.[10]\n\nIn 2017, Consuelos was cast in the series regular role of Hiram Lodge on The CW drama Riverdale. His oldest son, Michael Consuelos, plays a younger Hiram Lodge starting on the second season.[11]\n\nPersonal life [ edit ]\n\nIn 1995, Consuelos met Kelly Ripa, his co-star on All My Children.[12] The two eloped on May 1, 1996.[13] The couple has three children: Michael Joseph (born June 2, 1997), Lola Grace (born June 16, 2001) and Joaquin Antonio (born February 24, 2003).[14]\n\nOn October 3, 2008, he performed the marriage ceremony for Howard Stern and model/actress Beth Ostrosky at the Le Cirque restaurant in New York City. The two couples had grown close, which was why Stern asked Consuelos to officiate. Consuelos agreed, and took it upon himself to seek ordination to make it an official ceremony for Stern and Ostrosky. The guest list for the wedding included Joan Rivers, Barbara Walters, Chevy Chase, Billy Joel and wife Katie Lee, Jimmy Kimmel, Sarah Silverman, and Stern's radio co-host Robin Quivers.\n\nFor many years, Consuelos and Ripa lived on Crosby Street in SoHo, Manhattan, but they sold that house in 2015 for $20 million and moved to a townhouse on East 76th Street. They had bought the townhouse in 2013, though it was never officially listed on the market, from fashion designer Luca Orlandi and his wife, Oluchi Onweagba, for $27 million, making it the second most expensive townhouse sold in NYC that year.[15]\n\nAwards and honors [ edit ]\n\nIn 1998 and 1999, Consuelos won the American Latino Media Arts Award for \"Outstanding Actor in a Daytime Soap Opera.\" Consuelos won \"Hottest Romance\" along with Ripa in 1997 at the Soap Opera Awards.[5] He also won the Teen's Choice Award for Choice TV Villain in 2018 .\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]", "images": ["https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Mark_Consuelos_by_Gage_Skidmore.jpg/220px-Mark_Consuelos_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Mark_Consuelos_by_Gage_Skidmore.jpg/1200px-Mark_Consuelos_by_Gage_Skidmore.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Mark_Consuelos_by_Gage_Skidmore.jpg/1200px-Mark_Consuelos_by_Gage_Skidmore.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Mark_Consuelos", "title": "Mark Consuelos", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Mark_Consuelos_by_Gage_Skidmore.jpg/1200px-Mark_Consuelos_by_Gage_Skidmore.jpg"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}