{"url": "www.thesun.co.uk/fabulous/6125493/kate-middleton-prince-william-body-language-new-baby-boy/", "text": "KATE Middleton and Prince William showed more public intimacy than normal when they introduced their third royal baby to the world earlier today, according to a body language expert.\n\nThe Duke of Cambridge, 35, looked loving as he held wife Kate, 36, who gave birth to a baby boy just after 11am today, but also signalled they may not want a fourth child with a self-protective gesture.\n\n5 Kate Middleton and Prince William looked unusually intimate when they introduced their third child to the world today Credit: AFP or licensors\n\n5 The Duke of Cambridge held his wife's back and clasped her hand as they left the Lindo Wing Credit: Getty Images - Getty\n\nSpeaking to the Sun Online, author Judi James has revealed the signals the Duke and Duchess of Cambridge gave with their tiny gestures.\n\nThe happy couple emerged from the private Lindo Wing, at St Mary's Hospital, London, just before 6pm today - as they showed their son off to the waiting crowds.\n\nAround an hour and a half earlier, Wills had brought Prince George, four, and Princess Charlotte, two, to meet their baby brother - and played the confident dad-of-three as he led them up the hospital steps.\n\nBut his body language totally changed when Kate joined him on the steps - according to Judi.\n\n5 Wills looked confident when he brought Prince George, 4, and Princess Charlotte, 2, to meet their baby brother Credit: AFP or licensors\n\nShe said: \"With her choice of a striking red dress and killer heels for her hospital exit outfit Kate seemed to have been keen to signal an anxiety-free approach to the birth of her third baby.\n\n\"Although the royal couple's body language might have suggested this birth had a more profound effect on them than expected.\n\n\"One minute William was leaping down the steps to collect the small siblings with his arms swinging like pendulums to suggest the look of a jaunty, confident dad-of-three.\n\n\"But when he emerged from the doors again with Kate and the new baby his gestures hinted that he might have been a little more subdued and even love-struck.\n\n5 But his body language changed when he greeted the crowds with Kate, according to Judi James Credit: Reuters\n\n\"Kate and William's touch and embrace rituals were a lot more openly loving and intimate than usual.\n\n\"William gently rubbed Kate's back as they stood together on the steps and when they walked to the car he carried the baby in its carrier in his left hand so he could hold Kate's hand with entwined fingers, suggesting a very deep level of affection and empathy.\n\n\"It was his pose on the stairs when they first emerged that could have been the most telling though.\n\n5 The 'fig leaf' pose is a self-protective gesture which could suggest three kids is enough for the royal couple Credit: Rex Features\n\nMOST READ IN FABULOUS LOCKDOWN LOVE From loo trouble to too much sex, how isolating with a new love can go wrong TAKE A SWIPE Model shames sleazy blokes by exposing their pervy DMs Comment INGRID SEWARD Privacy-hunting Harry and Meghan's move to celeb hotspot LA is senseless MYSTIC MEG April 18: Uranus gives you a genius idea that turns rivals into friends SLICE DAY Britain’s largest family gets Domino’s feast after 22nd Radford child is born pandemic pin-ups From 'Dishy Rishi' to 'silver fox' Dr Hilary – the unlikely corona-crushes\n\n\"There was a moment when they showed the new baby to the world when William stood slightly away from his wife with his hands clasped across his lower torso in the 'fig leaf' pose.\n\n\"This is a strongly self-protective barrier gesture which could be signalling that three babies are enough for the royal couple!\"\n\nJudi previously revealed what Meghan Markle’s guarded hand gestures say about her upcoming wedding.\n\nWhile the Duchess of Cambridge paid a touching tribute to Princess Diana in the red and white dress she wore today.", "images": ["http://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.3 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.6 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.9 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.7 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2020/04/sunmasthead_mobile.png", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.thesun.co.uk/wp-content/uploads/2018/04/dk-comp-judi-james.jpg?strip=all&quality=100&w=750&h=500&crop=1"], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2018/04/dk-comp-judi-james.jpg?strip=all&quality=100&w=750&h=500&crop=1", "keywords": [], "authors": ["Josie Griffiths"], "canonical_link": "https://www.thesun.co.uk/fabulous/6125493/kate-middleton-prince-william-body-language-new-baby-boy/", "title": "Self-protective, loving and intimate: What Kate and Wills’ body language with their new baby boy reveals", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "apple-itunes-app": "app-id=373954290, affiliate-data=ct=Smart%20App%20Banner&pt=263124", "google-site-verification": "a576LGe3E0YA5QjAMY268jcuKWwPLIORxwlTMrjnfnE", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "Loving but self-protective: What Kate & Wills’ body language with new baby means", "url": "https://www.thesun.co.uk/fabulous/6125493/kate-middleton-prince-william-body-language-new-baby-boy/", "description": "KATE Middleton and Prince William showed more public intimacy than normal when they introduced their third royal baby to the world earlier today, according to a body language expert. The Duke of Ca…", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2018/04/dk-comp-judi-james.jpg?strip=all&quality=100&w=750&h=500&crop=1", "width": 750, "height": 500}, "locale": "en_GB"}, "article": {"published_time": "2018-04-23T18:32:21+00:00", "modified_time": "2018-04-24T09:25:59+00:00", "publisher": 161385360554578, "tag": "Prince Louis, Royal Family", "author": "https://www.facebook.com/Fabulous/"}, "fb": {"app_id": 144647118961553, "pages": 8401947179}, "description": "Speaking to the Sun Online, body language analyst Judi James reveals what the couple's tiny gestures could mean", "twitter": {"text": {"title": "Self-protective, loving and intimate: What Kate and Wills’ body language with their new baby boy reveals"}, "card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp", "taboola": {"kicker": "HANDS DOWN", "headline": "Loving but self-protective: What Kate & Wills’ body language with new baby means", "image": {"medium": "https://www.thesun.co.uk/wp-content/uploads/2018/04/dk-comp-judi-james.jpg?strip=all&quality=100&w=300&h=192&crop=1", "large": "https://www.thesun.co.uk/wp-content/uploads/2018/04/dk-comp-judi-james.jpg?strip=all&quality=100&w=620&h=413&crop=1"}}, "parsely-post-id": 6125493, "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1524508341.0, "source": "http://www.thesun.co.uk", "summary": ""}