{"url": "https://www.cheatsheet.com/entertainment/why-khloe-kardashian-fans-will-never-forgive-tristan-thompson.html/", "text": "Since Kim Kardashian first brought her family into the spotlight, there’s been no shortage of drama when it comes to the Kardashian/Jenner clan. And more recently, fans of Keeping Up With the Kardashians were shocked by the scandals that hit Khloe and her NBA boyfriend, Tristan Thompson. While Khloe went on record as saying Tristan was one of the best men she ever dated, her world was rocked when videos and photos surfaced of him hanging out with other women during their relationship. Not only that, but Khloe was nine months pregnant with his child when the photos came to light.\n\nWhile Khloe and Tristan seem to be trying to work things out for the good of their daughter, True, it seems fans will never forgive him. Here’s why.\n\nThe cheating scandal showed Tristan with several women, not just one\n\nKhloé Kardashian and Tristan Thompson | Khloé Kardashian and Tristan Thompson | Khloé Kardashian via Instagram\n\nWe all have lapses in judgment — and fans may be more forgiving of Tristan if he had a slip-up with just one woman on one occasion. The footage shared by Daily Mail Online and TMZ showed several occasions of Tristan all over other women during his relationship with Khloe, Cosmopolitan reports. Not only did he fall out of favor with fans when the footage was released, but it has many questioning whether he really has the capacity to change after so much shady behavior.\n\nThe first video released by Daily Mail Online showed Tristan kissing another woman in an NYC bar, says Cosmo. And another video showed Tristan cheating on Khloe with two separate women while in a hookah lounge in Washington, D.C. The D.C. footage also allegedly occurred two weeks after Khloe’s pregnancy hit the media, too, making this act extra unforgivable.\n\nKim doesn’t trust Tristan despite his apologies\n\nKhloe Kardashian, Tristan Thompson, and their mothers | Khloe Kardashian, Tristan Thompson, and their mothers | Tristan Thompson via Instagram\n\nIf all the Kardashians and Jenners forgave Tristan, perhaps fans would be more willing to give him a second chance. But People notes Kim was questioning Tristan’s sincerity after he showed remorse. On Keeping Up with the Kardashians, Kris expressed that she believed Tristan’s apology wholeheartedly, but Kim didn’t buy it. “I told him, ‘I think you’re more remorseful because it’s affecting your job,’” she said. “I think he’s more embarrassed that he looks stupid, ’cause [of] the public … booing him. And I think it’s more of that than anything, and I told him that.”\n\nKim did hear him out off camera, however, and she didn’t want to cause any unnecessary tension for Khloe. Even so, Kim’s heart broke when she revealed Khloe really believed in creating a family with Tristan — and this made fans even angrier.\n\nHe also made a nasty gesture to basketball fans\n\nTristan still can’t seem to catch a break with the media even months after the cheating scandal had been dealt with. People notes at the end of a Cavaliers game he was playing in, video footage from TMZ seemed to show Tristan giving the middle finger to a crowd full of Brooklyn Nets fans after the Nets missed their final three-point shot. He was then serviced with a $15,000 fine for the gesture.\n\nThe publication reminds us this isn’t the first time fans saw Tristan get heated on the court, either. He also reportedly had an altercation with Ben Simmons from the Philadelphia ’76ers (who was rumored to be dating Kendall Jenner at the time). The two NBA players had to be separated — and it certainly didn’t help Tristan’s standing with the Kardashian family or Khloe fans.\n\nAre Khloe and Tristan still together? Fans think they’ve secretly broken up\n\nKhloe Kardashian and Tristan Thompson | Khloe Kardashian and Tristan Thompson | Khloe Kardashian via Instagram\n\nSince the birth of True, Khloe has been totally tight-lipped about her relationship with Tristan. And while it’s assumed they’re still together and making things work for the good of their child, Cosmopolitan notes some fans think they could be secretly broken up.\n\nAs for why fans think Khloe’s single, her Instagram posts are a big clue. She hasn’t posted any recent photos of her and Tristan together, and she’s been posting emotional messages of love and encouragement to her fans that are also a big concern. Not only that, but she seems to only refer to Tristan as “True’s dad” instead of her boyfriend.\n\nIf Khloe and Tristan are broken up, many fans would rejoice and hope Khloe can finally find the man she deserves. We’ll have to wait and see what the future holds.\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2018/12/Khloe-Kardashian-Tristan-Thompson.png?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "https://www.cheatsheet.com/wp-content/uploads/2018/10/khloekardashiantristanthompsonbirthday.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2018/04/Khloe-kardashian-and-Tristian-Thompson-e1533151653372.png", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2018/04/Khloe-kardashian-and-Tristian-Thompson-e1533151653372.png?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2018/04/Khloe-kardashian-and-Tristian-Thompson-e1533151653372.png", "keywords": [], "authors": ["Lauren Weiler"], "canonical_link": "https://www.cheatsheet.com/entertainment/why-khloe-kardashian-fans-will-never-forgive-tristan-thompson.html/", "title": "Why Khloe Kardashian Fans Will Never Forgive Tristan Thompson", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/entertainment/why-khloe-kardashian-fans-will-never-forgive-tristan-thompson.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "Khloe Kardashian may forgive Tristan Thompson for cheating on her, but it's unlikely fans ever will. Here's why her fans won't ever let it go.", "og": {"locale": "en_US", "type": "article", "title": "Why Khloe Kardashian Fans Will Never Forgive Tristan Thompson", "description": "Khloe Kardashian may forgive Tristan Thompson for cheating on her, but it's unlikely fans ever will. Here's why her fans won't ever let it go.", "url": "https://www.cheatsheet.com/entertainment/why-khloe-kardashian-fans-will-never-forgive-tristan-thompson.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-12-06T22:13:47-05:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2018/04/Khloe-kardashian-and-Tristian-Thompson-e1533151653372.png", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2018/04/Khloe-kardashian-and-Tristian-Thompson-e1533151653372.png"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "Khloe Kardashian", "section": "Entertainment", "published_time": "2018-12-08T18:12:31-05:00", "modified_time": "2018-12-06T22:13:47-05:00"}, "twitter": {"card": "summary_large_image", "description": "Khloe Kardashian may forgive Tristan Thompson for cheating on her, but it's unlikely fans ever will. Here's why her fans won't ever let it go.", "title": "Why Khloe Kardashian Fans Will Never Forgive Tristan Thompson", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2018/04/Khloe-kardashian-and-Tristian-Thompson-e1533151653372.png", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1544310751.0, "source": "https://www.cheatsheet.com", "summary": ""}