{"url": "https://www.thedailybeast.com/george-clooney-speaks-out-on-harvey-weinstein-its-disturbing-on-a-whole-lot-of-levels", "text": "Academy Award winner George Clooney, who was given his first major big-screen role by Harvey Weinstein, has become the latest—and most high-profile—member of Hollywood to speak out on the alleged sexual-misconduct allegations against his sometime employer.\n\n“It’s indefensible. That’s the only word you can start with,” he says. “Harvey’s admitted to it, and it’s indefensible. I’ve known Harvey for 20 years. He gave me my first big break as an actor in films on From Dusk Till Dawn, he gave me my first big break as a director with Confessions of a Dangerous Mind. We’ve had dinners, we’ve been on location together, we’ve had arguments. But I can tell you that I’ve never seen any of this behavior—ever.”\n\nClooney spoke to me at length about the allegations—as well as charges of Hollywood complicity—during a phone conversation late Monday.\n\nHis remarks come in the wake of statements released by Meryl Streep and Dame Judi Dench, two actresses who’ve won Oscars for Weinstein-shepherded films and who took the bullying movie mogul to task for allegedly preying on vulnerable young women for 30 years, resulting in at least eight settlements, according to a bombshell New York Times exposé.\n\nWeinstein’s accusers, among them the actress Ashley Judd, shared similar horror stories: a “business meeting” at a lavish hotel suite soon gave way to a series of sexual propositions, including watching him shower. One local TV reporter, Lauren Sivan, claimed that Weinstein cornered her in the bowels of his restaurant, told her to “be quiet,” and masturbated into a potted plant.\n\nWeinstein, the former co-chief of Miramax, has since been fired from The Weinstein Company—which he co-founded with his brother Bob—and many of the male actors and filmmakers in particular who have benefited from the studio executive’s Oscar Midas touch, from Matt Damon and Ben Affleck (Good Will Hunting) to Quentin Tarantino (Pulp Fiction), have remained alarmingly silent.\n\nClooney, on the other hand, was anything but.\n\nHow did you react to the Harvey Weinstein news?\n\nI’ve heard rumors, and the rumors in general started back in the ’90s, and they were that certain actresses had slept with Harvey to get a role. It seemed like a way to smear the actresses and demean them by saying that they didn’t get the jobs based on their talent, so I took those rumors with a grain of salt. But the other part of this, the part we’re hearing now about eight women being paid off, I didn’t hear anything about that and I don’t know anyone that did. That’s a whole other level and there’s no way you can reconcile that. There’s nothing to say except that it’s indefensible.\n\nThe thing I’ve been seeing online is that, in the wake of Meryl Streep’s statement, and knowing that he helped guide her to an Oscar for The Iron Lady, many people are saying, “Oh, she had to know.” But that seems both incredibly speculative and unfair.\n\nA lot of people are doing the “you had to know” thing right now, and yes, if you’re asking if I knew that someone who was very powerful had a tendency to hit on young, beautiful women, sure. But I had no idea that it had gone to the level of having to pay off eight women for their silence, and that these women were threatened and victimized. I’ve been talking with a lot of people about this, and I don’t know many people who knew of that.\n\nSharon Waxman over at The Wrap said she was working on a story about Harvey over 10 years ago at The New York Times and they killed it, and if that’s true, then that’s a shameful thing because a lot of women wouldn’t have been made victims if this had come out. By the same token, I do want to say that Sharon’s been running her own influential website, The Wrap, for quite a long time, and if she did these interviews and this investigation, she didn’t run the story either, and I and a lot of other people would have liked to have known it. A good bunch of people that I know would say, “Yeah, Harvey’s a dog” or “Harvey’s chasing girls,” but again, this is a very different kind of thing. This is harassment on a very high level. And there’s an argument that everyone is complicit in it. I suppose the argument would be that it’s not just about Hollywood, but about all of us—that every time you see someone using their power and influence to take advantage of someone without power and influence and you don’t speak up, you’re complicit. And there’s no question about that.\n\nHollywood can be good when it comes to certain progressive causes, but this area—preying on women—seems to be a pretty major blind spot. The “casting couch” and the “creepy, lecherous producer,” these are concepts that are so firmly ingrained in the industry that they’ve become troubling clichés, and go all the way back to Golden Age studio chiefs like Louis B. Mayer and David O. Selznick.\n\nI hear you. At the same time, I know an awful lot more people in this business who have nothing to do with that, and I suppose if I went looking I could probably find three or four names of people that I would suspect of doing that. The other part of it is, I’d like to think that if someone came up to me and told me this was going on that I would go out and confront it. I’ve told this story about a night with Silvio Berlusconi, and I hadn’t told all the specifics about it before, but perhaps I should have been more graphic about how vulgar that was in a way to take some responsibility—each of us, in our own individual way—of talking about people with a lot of power using it and holding it over others in some ways.\n\nBut on the other hand, maybe that’s what good will come out of this: that not just in Hollywood, although Hollywood is now the focus, but in all of these cases the victims will feel that they will be listened to, and that they don’t need to be afraid.\n\nThis is an interesting moment. I’ve seen a lot of people, from Meryl [Streep] to Judi Dench, come out and say “holy shit,” and I think that that’s been the reaction by a lot of people in Hollywood. I don’t think that people were looking the other way; I think that people weren’t looking, because in some ways, a lecherous guy with money picking up younger girls is unfortunately not a news story in our society.\n\nSo when you find out how much worse it is than you thought, then it’s a news story. And this is a big news story now. And I feel very bad for all of the victims. I mean, cornering a young anchorwoman in the kitchen and jerking off into a potted plant? That’s not just some rumor about Harvey hitting on a woman; it’s disturbing on a whole lot of levels, because there had to be a lot of people involved in covering that up. That’s frustrating. If politicians knew these stories, I doubt they’d have been taking donations from him at the DNC [Democratic National Committee], and I hope that they will all give the money back or donate it to good causes.\n\nThose on the right, from Fox News to Donald Trump Jr., have used the Harvey Weinstein news as a cudgel against liberals. It’s a bit rich on Trump Jr.’s part, given the numerous allegations against his father.\n\nYeah, that’s a little pot and kettle there, unfortunately. But I think that everything gets politicized these days. The reality is that this is a problem deeply ingrained in our society. It was something that was talked about a lot on the left with Roger Ailes, Bill O’Reilly, and Donald Trump, and it’s something that’s going to be talked about a lot on the right with Harvey Weinstein. I think that rather than politicize it, there should be talk on both sides about the really bad behavior by powerful men and the horrible acts they commit. It’s pretty crazy to me.\n\nIt is so firmly ingrained in the culture now. We just elected a man president who’s been accused of sexual misconduct by over a dozen women and was caught on tape bragging to a relative stranger about his ability to sexually assault women at will. One of the strange things about the Harvey news is it emerged around the one-year anniversary of that Trump Access Hollywood tape.\n\nThat is a funny part of it: In “liberal” Hollywood the guy loses his job, but then this other guy [Trump] gets elected president. There are a couple of good things that have to come out of this, because something good has to come out of this. One of those things is that victims have to feel safer to come out and tell their stories without the fear of losing their jobs, and they also need to be believed, which is a very important element of this. Also, this should be a shot across the bow that people in places of power cannot abuse that power, and if you do, you’ll be outed publicly, shamed, and even prosecuted. When it comes to most of the people that I know, where we’re shocked is by how bad it was. This is about show business but it isn’t just about show business—it’s about everything. We need to get to a place where we can call these people out much quicker before it becomes such a deeper, long-running problem. This apparently went on for almost 30 years.\n\nPeople did know that Harvey was a terrible bully, though. It was interesting how Hollywood approached it, because he was almost treated like a caricature—the angry, bellowing studio mogul. I remember there was a character on Entourage based on him. It was treated almost like a joke.\n\nThink about it this way, too: I had knock-down, drag-out fights with him over the years, but he was also making films that other studios weren’t willing to make, and he was making films that everybody loved, so you just put up with certain bad behavior because you felt like, well, if he yells and screams but he gets Pulp Fiction made, who cares if he yells and screams? But it’s a very different conversation when you say, it’s not that he yells and screams but that he’s cornering a young, scared lady in a restaurant and telling her to stand there and be quiet while he jerks off. That’s a very different kind of behavior, and had that been a public thing, I think there would have been some different results. I hope there would be.\n\nWhy do you think people are holding him accountable now? I wrote a piece about how there seems to be a lot more accountability surrounding issues of sexual assault and misconduct in Hollywood, and that it’s perhaps a reaction to the Cosby revelations, which served as a wake-up call for a lot of people in the entertainment media space—that in covering celebrities you can’t gloss over the dark details, otherwise you’re mildly complicit. Also, it’s so important how there are more women now in both Hollywood and newsrooms who feel empowered to speak up and hold those in power accountable.\n\nHopefully, this kind of behavior will end—or become harder and harder for it to continue. What’s important now is that anybody who thinks that they can get away with doing that, they now have to think: Wait, somebody can be recording this or writing a story about it. I’m going to get in a lot of trouble. That’s good, because we’ve seen this type of behavior in politics, in Silicon Valley, and in corporate America. This is a big problem in our society, that people in power are taking advantage of people not in power—particularly powerful men with young women. Maybe Cosby was the watershed moment. I think Roger Ailes was also a watershed moment, because it concerned an establishment figure up to some very shady stuff. But this isn’t a right or a left issue; this is a moral issue. We’re all going to have to be more diligent about it and look for any warning signs. Before, people weren’t paying enough attention to it. Now we have to. This is the moment to start scaring people like this into not acting this way anymore.", "images": ["https://img.thedailybeast.com/image/upload/c_fill,h_200,w_200,x_0,y_0/v1490733486/author/20170327-stern-marlow-author.jpg", "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1507605328/171009-stern-cloone--weinstein-tease_eo0do8", "https://img.thedailybeast.com/image/upload/v1550872986/White2x_hcwpd6.png", "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_1.5/c_limit,w_1044/fl_lossy,q_auto/v1507605328/171009-stern-cloone--weinstein-tease_eo0do8", "https://img.thedailybeast.com/image/upload/v1549916286/logo_km2qs4.png"], "top_img": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1507605328/171009-stern-cloone--weinstein-tease_eo0do8", "keywords": [], "authors": ["Marlow Stern", "Senior Entertainment Editor"], "canonical_link": "https://www.thedailybeast.com/george-clooney-speaks-out-on-harvey-weinstein-its-disturbing-on-a-whole-lot-of-levels", "title": "George Clooney Speaks Out on Harvey Weinstein: ‘It’s Disturbing on a Whole Lot of Levels’", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "title": "George Clooney Speaks Out on Harvey Weinstein: ‘It’s Disturbing on a Whole Lot of Levels’", "keywords": "Roger Ailes, Fox News, Donald J. Trump, Donald Trump, Jr., Sexual harassment, George Clooney, Hollywood, Sexual assault, Bill Cosby, Harvey Weinstein, New York Times", "og": {"title": "George Clooney Speaks Out on Harvey Weinstein: ‘It’s Disturbing on a Whole Lot of Levels’", "description": "The actor-filmmaker-philanthropist opened up to The Daily Beast about the sexual-misconduct allegations against Harvey Weinstein and Hollywood complicity.", "url": "https://www.thedailybeast.com/george-clooney-speaks-out-on-harvey-weinstein-its-disturbing-on-a-whole-lot-of-levels", "site_name": "The Daily Beast", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1507605328/171009-stern-cloone--weinstein-tease_eo0do8"}, "description": "The actor-filmmaker-philanthropist opened up to The Daily Beast about the sexual-misconduct allegations against Harvey Weinstein and Hollywood complicity.", "authors": "Marlow Stern", "wrap": "/content/dailybeast/entertainment", "article": {"section": "entertainment", "published_time": "2017-10-10T18:30:00.000Z", "author": "https://www.thedailybeast.com/authors/marlow-stern"}, "fb": {"app_id": 189930913679}, "twitter": {"card": "summary_large_image", "site": "@thedailybeast", "creator": "@marlownyc", "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_600/f_jpg/fl_lossy,q_auto/v1507605328/171009-stern-cloone--weinstein-tease_eo0do8"}, "sailthru.date": "2017-10-10T18:30:00.000Z", "sailthru.expire_date": "2017-10-24T18:30:00.000Z", "publicationDate": 201710101830, "parsely-page": "{\"author\":\"Marlow Stern\",\"link\":\"https://www.thedailybeast.com/george-clooney-speaks-out-on-harvey-weinstein-its-disturbing-on-a-whole-lot-of-levels\",\"metadata\":{\"articleType\":\"article\",\"rubric\":\"IN CONVERSATION\"},\"post_id\":\"george-clooney-speaks-out-on-harvey-weinstein-its-disturbing-on-a-whole-lot-of-levels\",\"pub_date\":\"2017-10-10T18:30:00+00:00\",\"section\":\"Entertainment\",\"tags\":[\"Roger Ailes\",\"Fox News\",\"Donald J. Trump\",\"Donald Trump, Jr.\",\"Sexual harassment\",\"George Clooney\",\"Hollywood\",\"Sexual assault\",\"Bill Cosby\",\"Harvey Weinstein\",\"New York Times\",\"typeArticle\"],\"title\":\"George Clooney Speaks Out on Harvey Weinstein: ‘It’s Disturbing on a Whole Lot of Levels’\",\"type\":\"post\"}"}, "movies": [], "publish_date": 1507660200.0, "source": "https://www.thedailybeast.com", "summary": ""}