{"url": "https://people.com/parents/thomas-rhett-tour-kids-work-life-balance/", "text": "It’s one week until Thomas Rhett‘s new album drops, and the singer has a problem that only another musician parent could understand: How do you rock the country scene with your record release while still helping out with diaper duty and bedtime routines?\n\n“The moment we look at our calendars, it really does stress us out,” the singer tells PEOPLE in this week’s issue of balancing family time with the grueling promo schedule on the horizon for his upcoming album, aptly titled Life Changes. “But if Luke Bryan and Jason Aldean can do it, we can do it!”\n\nGet push notifications with news, features and more.\n\nAfter welcoming newborn Ada James on Aug. 12 and spending a cozy – if chaotic — two weeks at home in Nashville, Tennessee, with his wife Lauren and their 22-month-old Willa Gray, the new father of two is now facing a 12-day trip to New York and a whirlwind tour of three cities (Chicago, Boston and Philadelphia) on release day itself: Sept. 8.\n\n“It’s not like there ever is a perfect time to have kids, or a perfect time to put out a record,” says Thomas Rhett, 27. “We just happen to be doing both at the exact same time! We keep going back to ‘Take it one day at a time.’ ”\n\nWant all the latest pregnancy and birth announcements, plus celebrity mom blogs? Click here to get those and more in the PEOPLE Babies newsletter.\n\nImage zoom Julie Paisley Photography\n\nRELATED: New Dad of Two Thomas Rhett Talks “Intense” Parenthood with Wife Lauren: “We’re Figuring It Out as We Go”\n\nSince adopting Willa from Uganda in May and becoming parents to two daughters within three months, the couple has had their share of “How am I going to do this?” moments. But they’re already a little wiser since bringing Willa home.\n\n“Going back and forth to Uganda, being a parent to Willa over there, I felt like I learned how resilient children are,” says Thomas Rhett, who posed for this week’s PEOPLE issue in an at-home photo spread with his family, captured by photographer Julie Paisley.\n\nRELATED VIDEO: Two Under 2! Thomas Rhett and Wife Lauren on Welcoming Daughters Within Three Months: “There’s Never a Dull Moment!”\n\n“Before I had children, I felt like any baby I held, I was holding glass,” Thomas Rhett adds. “But now I know if they lean down and grab an Oreo off the ground, they’re not going to die.”\n\nEmbracing that notion made taking Willa on the road a lot easier, he says. “At first I was like, if we bring a baby on the bus, how is she going to sleep? There are bumps on the road. What is she going to eat out there? What if there’s only Subway? But Willa just goes with the flow. There isn’t much about our lifestyle we changed.”\n\nImage zoom Julie Paisley Photography\n\nWatch the full episode of PEOPLE Features: Thomas Rhett – Meet My Baby Girls, available now on the PEOPLE/Entertainment Weekly Network (PEN). Go to people.com/PEN or download the PEN app on your favorite mobile or connected TV device.\n\nRELATED: “The Most Miraculous Thing I’ve Ever Seen”: Why “Squeamish” Thomas Rhett Is Glad He Watched Ada James’ Delivery\n\nSince coming to America, Willa has already hit the concert stage, seen Times Square and stolen the spotlight from Dad on the morning shows, all “without skipping a beat!” Lauren says.\n\nBut with baby No. 2, life gets a little more complicated. “When Ada falls asleep. Willa wakes up from her nap, and the moment that Willa falls asleep for her nap, Ada screams,” Thomas Rhett explains.\n\n“So the only peace that me and Lauren get is when we get in bed at 9 — and we pass out by 9:30,” he admits. “It’s challenging to make sure me and Lauren still spend that intentional time with each other to breathe for a second.”\n\nRELATED: Exclusive First Family Photos! Thomas Rhett and Wife Lauren Talk Welcoming Two Daughters in Three Months\n\nTime with Lauren, after all, has inspired several of Thomas Rhett’s biggest hits, including “Die a Happy Man.” His latest album is already influenced by his newest well of inspiration: his two girls.\n\nOn the title track (co-written with his dad Rhett Akins along with Ashley Gorley and Jesse Frasure), the singer chronicles the family’s unusual journey to becoming a foursome:\n\nI remember the day I told my daddy and mama\n\nYou’re gonna have a grandkid from Uganda\n\nThat’s right, we’re adoptin’\n\nAnd she is the cutest little girl that you ever seen\n\nWhile I was wrappin’ my head around bein’ a dad\n\nA big wrench got thrown in the plans we thought we had\n\nNow Lauren’s showin’, got one on the way\n\nYeah, that’s two under two, hey, what can I say\n\n“I’m just partial to that song because there’s no one else that can sing it,” says Thomas Rhett, adding that it barely made it onto the album — which was far along by the time the song was written.\n\nImage zoom Julie Paisley Photography\n\nFROM PEN: Former Bachelorette Ashley HEbert Rosenbaum Opens Up About Her Sibling Rivalry Fears\n\n\n\nBut the singer — who has yet another role as a judge at the 2018 Miss America Competition Sept. 10, alongside Jordin Sparks, Molly Sims and PEOPLE Editor-in-Chief Jess Cagle — promises more tunes inspired by becoming a dad.\n\n“The girls will be in my songs 100 percent. If you look at my phone, every single song title is either about my children or has been inspired by something they have done or said,” Thomas Rhett says.\n\nImage zoom Julie Paisley Photography\n\nRELATED GALLERY: The Fab Four! A Peek Inside Thomas Rhett and Lauren Akins’ Family Life\n\n“This record was pretty much closed out by the time our whole family was here, so I’m probably going to need to release a side project and tell people, ‘Life Changes is my real record, but if you want to get real sappy and cry, you can listen to this!’ ”\n\nFor more on Thomas Rhett and Lauren Akins’ new life as parents of two, pick up the latest issue of PEOPLE, on newsstands now.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Frjett2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Frhett5-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Frhett4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F08%2Frhett2-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Frhettcopy.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Frhettcopy.jpg", "keywords": [], "authors": ["Eileen Finan"], "canonical_link": "https://people.com/parents/thomas-rhett-tour-kids-work-life-balance/", "title": "Back on the Road with Two Under 2! How Thomas Rhett Makes It Work: We 'Take It One Day at a Time'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Babies,Babies Exclusives,Babies Photos,Exclusive,News,Parenting,Rollout,Thomas Rhett", "news_keywords": "Babies,Babies Exclusives,Babies Photos,Exclusive,News,Parenting,Rollout,Thomas Rhett", "description": "\"It's not like there ever is a perfect time to have kids, or a perfect time to put out a record,\" Thomas Rhett tells PEOPLE in this week's issue", "og": {"title": "Back on the Road with Two Under 2! How Thomas Rhett Makes It Work: We 'Take It One Day at a Time'", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/parents/thomas-rhett-tour-kids-work-life-balance/", "description": "It’s one week until&nbsp;Thomas Rhett‘s new album drops, and the singer has a problem that only another musician parent could understand: How do you rock&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Frhettcopy.jpg", "width": 2000, "height": 1047}}, "pinterest": {"url": "https://people.com/parents/thomas-rhett-tour-kids-work-life-balance/", "description": "\"It's not like there ever is a perfect time to have kids, or a perfect time to put out a record,\" Thomas Rhett tells PEOPLE in this week's issue", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Frhettcopy.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/parents/thomas-rhett-tour-kids-work-life-balance/", "title": "Back on the Road with Two Under 2! How Thomas Rhett Makes It Work: We 'Take It One Day at a Time'", "description": "\"It's not like there ever is a perfect time to have kids, or a perfect time to put out a record,\" Thomas Rhett tells PEOPLE in this week's issue", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=2000&h=1047&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F09%2Frhettcopy.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": ["https://www.youtube.com/embed/7GlaFsw0AGM"], "publish_date": null, "source": "https://people.com", "summary": ""}