{"url": "https://people.com/tv/kim-zolciak-kroy-biermann-kept-dog-after-kash-bite/", "text": "Kim Zolciak-Biermann and Kroy Biermann want dog owners to know the signs to look out for if their pets are being aggressive.\n\nThe couple, who have been married since 2011, faced the nightmare of their lives on April 22, when their dog Sinn bit their 5-year-old son Kash, nearly blinding him.\n\nGet push notifications with news, features and more.\n\n“It was a like a bad dream,” Kim, 39, tells PEOPLE exclusively of the bite, which left Kash in the hospital for 4 days, the scratch a millimeter away from his eye. “Our dog Sinn is heavily, heavily trained. Kash is his favorite. It made absolutely no sense to any of us. This is nothing I ever thought I’d be dealing with in my life.”\n\nThough Kim shared news about the bite on social media after it happened, much of the details surrounding the incident have been unknown until now — including the fact that Sinn was the one who bit Kash. The two were playing outside alongside the Biermanns’ other son KJ, 6, when Kroy was using a leaf blower to clean the yard.\n\n“Sinn doesn’t like the blower, so he’s already in high alert,” Kroy, 32, says on Friday’s episode of Don’t Be Tardy, which documents the aftermath of Sinn’s bite. “My back was to the dogs and the boys. I hear Kash be loud, and then I hear barking. And then I hear Kash screaming, he’s crying very loud. At that point I think he’s scared, but then I realize Sinn bit Kash. He’s dripping blood everywhere on his shirt. He pulls his hands down and there’s multiple lacerations, I can’t see his eye. I knew it was a very dire emergency.”\n\nImage zoom Sinn and Kash Courtesy Kim Zolciak-Biermann\n\nLooking back on it to PEOPLE, Kroy says he’s still coming to terms with what happened. “It’s a process every day,” Kroy explains. “Being right there, it was just wrong place, wrong time, wrong circumstances. The perfect storm. Had one thing been different, it wouldn’t have happened. You try to say, ‘What would I have done differently?’ And there are a lot of things. now, but you can’t change any of it. You just have to learn from it and grow from it.”\n\n“There are no words to describe something like this,” Kroy continues. “I just pray that any parent out there does not have to go through anything traumatic like it. It’s just a horrible feeling to have to go through.”\n\nAs Kash was taken to the hospital, Sinn’s trainer immediately came to the Biermann house and removed the dog from the home while Kim and Kroy — who have six kids total and four other rescue dogs — decided what to do.\n\nImage zoom Kroy Biermann and Kash Courtesy Kim Zolciak-Biermann\n\nRELATED VIDEO: Kim Zolciak-Biermann Surprises Son Kash With Pit Bull Puppy Four Months After Dog Attack\n\nThe decision to keep Sinn didn’t come easy. The Biermanns had rescued Sinn, husky-boxer mix, as a puppy three years earlier. Kroy’s instinct was to get rid him now.\n\n“I hated Sinn,” Kroy says. “I genuinely felt a deep rage for what he had done to my son. Sinn was always a good dog, extremely obedient and protective and not at all aggressive. He’s hyper-active and hyper-sensitive but wants to work and loves to be commanded. I love my dog, and nothing like this had ever happened to me before. But it’s my son. I don’t love anything more than my flesh and blood. I thought, ‘I don’t want to see the dog — he doesn’t get a second chance.’ ”\n\nFor more on Kim Zolciak-Biermann and Kroy Biermann, pick up this week’s issue of PEOPLE, on newsstands Friday.\n\nImage zoom\n\nComplicating matters was the fact that over the years, Sinn had formed an “incredible bond” with Kash. “Sinn and Kash have been best friends since the day we got Sinn,” Kim says. “Kash is an absolute animal lover, and Sinn is definitely his favorite, without a shadow of a doubt. That’s why it was extra hard.”\n\n“I genuinely felt a deep rage for what Sinn had done to my son, but Kash loves him,” Kroy adds.” We didn’t want him to live a life with a phobia of dogs. We wanted him to understand it wasn’t his fault.”\n\nImage zoom Kroy Biermann, Kash Biermann, and Kim Zolciak-Biermann Source: Kim Zolciak-Biermann Instagram\n\nSpeaking with nearly a dozen behavioral specialists, child psychologists and dog-bite survivors, Kim and Kroy spent a lot of time evaluating Kash’s moods and anxiety level after the attack. The boy — who the Biermanns describe as “super strong and positive” — appeared unfazed, even asking to see Sinn while he was in the hospital.\n\n“He saw a service dog in the hospital and he hopped up out of the bed. He was all over the dog, petting the dog and loving on the dog and kissing the dog with no inhibitions,” Kim remembers. “It was unbelievable.”\n\nWhat finally clicked for the Biermanns was when they understood that Kash had been bitten, not attacked. “That was a turning point for me,” Kim says, revealing they watched security camera footage of the incident. “It was not an attack — he nipped at Kash’s face in an attempt to communicate with Kash. Not that that is an excuse. But he took off running. It wasn’t as if he was attacking. Sinn knew he had done wrong.”\n\n“If Kash ever looked at me and said that he didn’t want to be around Sinn or showed any hesitation, then he wouldn’t be here,” Kim stresses. “We love Sinn, he’s part of our family, but our children will always come first without a doubt.”\n\nImage zoom Kash Biermann Source: Kim Zolciak Biermann/Instagram\n\nSeven months and multiple surgeries later, Kash is healthy and 95 percent healed — even getting a puppy for his birthday in August. And after an eight-week break, Sinn was slowly welcomed back into the home, with some very big changes.\n\n“Sinn had a lot of freedom before. He would sleep in the crate at night, but during the day he would roam around the house or we’d let him outside. Nobody really watched him. Now his crate is locked with a key that only Kim and I have the keys to. He’s supervised all the time when he’s out. And the only time he runs around free is in the fenced-in dog run we built for him the backyard, which gives him about 400 sq. ft. of grassed space,” Kroy says.\n\nThe dog’s crate has also been moved out of the home’s high-traffic area to give Sinn some sanctuary. He occasionally wears a muzzle, too.\n\nImage zoom Sinn and Kash Courtesy Kim Zolciak-Biermann\n\nRELATED VIDEO: ‘I Don’t Know Where to Start’: Kim Zolciak-Biermann’s 4-Year-Old Son Hospitalized After Being Bitten by Dog\n\nStill, the biggest change has been that Kim and Kroy now know what to look out for — and hope that viewers learn from their nightmare.\n\n“We’ve taught our kids, no matter how nice dogs are, they are capable of anything and cannot communicate to us in another way than through action — be it barking, growling, biting, scratching, or running away,” Kroy says. “A child sees flurry, fluffy, fun, slobbery … they don’t see danger. And we didn’t either, as adults who had always owned dogs but never gone through something like this. But you have to understand those triggers. Whether it’s loud noise, their tail being pulled, whatever it is, it should be on the forefront of everybody’s mind. Not as fear, but just awareness.”\n\nAll and all, the Biermanns are grateful for all the support they received from family and friends, especially Children’s Healthcare of Atlanta, Dr. Jerry E Berland at Thomas Eye Group, Chief of Plastic Surgery at CHOA Dr. Joseph K Williams and Gabe Reinlieb at Tenacity Dog Training. “I honestly don’t know what we would of done without them,” Kim says.Don’t Be Tardy airs Fridays (9 p.m. ET) on Bravo.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F03%2F23%2Fmaren-morris-baby-4.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F05%2Fkim-zolciak-biermann.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F09%2Fmatthew-perry-2-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Fcover-2-3-1-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F05%2Fkim-zolciak-2000-1.jpg", "https://peopledotcom.files.wordpress.com/2018/09/thumbnail_generic.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Ffullsizerender-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Fzolciak-son2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2020%2F04%2F17%2Fmaps-2-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2017%2F11%2Fkim-zolciak-dog.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1429&h=748&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Fkim-zolciak-kroy-2000.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1429&h=748&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Fkim-zolciak-kroy-2000.jpg", "keywords": [], "authors": ["Dave Quinn"], "canonical_link": "https://people.com/tv/kim-zolciak-kroy-biermann-kept-dog-after-kash-bite/", "title": "Why Kim Zolciak & Kroy Biermann Kept the Dog Who Bit Their Son", "meta_data": {"viewport": "width=device-width, initial-scale=1", "keywords": "Celeb Pets,Kim Zolciak Biermann,News,Real Housewives,TV", "news_keywords": "Celeb Pets,Kim Zolciak Biermann,News,Real Housewives,TV", "description": "Kim Zolciak-Biermann and Kroy Biermann want dog owners to know the signs to look out for if their pets are being aggressive", "og": {"title": "Why Kim Zolciak-Biermann and Kroy Biermann Kept the Dog Who Bit Their Son", "type": "article", "site_name": "PEOPLE.com", "url": "https://people.com/tv/kim-zolciak-kroy-biermann-kept-dog-after-kash-bite/", "description": "Kim Zolciak-Biermann&nbsp;and Kroy Biermann&nbsp;want dog owners to know the signs to look out for if their pets are being aggressive. The couple, who have been&hellip;", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1429&h=748&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Fkim-zolciak-kroy-2000.jpg", "width": 1429, "height": 748}}, "pinterest": {"url": "https://people.com/tv/kim-zolciak-kroy-biermann-kept-dog-after-kash-bite/", "description": "Kim Zolciak-Biermann and Kroy Biermann want dog owners to know the signs to look out for if their pets are being aggressive", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Fkim-zolciak-kroy-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://people.com/tv/kim-zolciak-kroy-biermann-kept-dog-after-kash-bite/", "title": "Why Kim Zolciak-Biermann and Kroy Biermann Kept the Dog Who Bit Their Son", "description": "Kim Zolciak-Biermann and Kroy Biermann want dog owners to know the signs to look out for if their pets are being aggressive", "site": "@people", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=85&c=sc&poi=face&w=1429&h=748&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F20%2F2018%2F08%2Fkim-zolciak-kroy-2000.jpg"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "article": {"opinion": "false"}, "p": {"domain_verify": "755183be01bfc739a9cac6673f1f2c1b"}}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}