{"url": "https://nylon.com/articles/the-keepers-netflix", "text": "Since about 2015, America has become increasingly infatuated with complicated murder cover-ups. From HBO's The Jinx and the critically acclaimed Serial podcast to Netflix's Making a Murderer and the ongoing list of retellings of the OJ Simpson trial, we can't seem to get enough stories about the elaborate ins and outs of America's unjust justice system. Now, Netflix is banking on this trend with a new true crime docu-series titled The Keepers, which, according to Vanity Fair, will tell the mysterious story of Sister Cathy Cesnik's demise.\n\nThis isn't Netflix's first venture into true crime since the runaway success of Making a Murderer. The streaming service debuted the film Amanda Knox last year, which explored the fallout of an international criminal investigation on the eponymous subject's life. The movie received critical approval but didn't quite go viral in the way that speculation around the Avery family, the subjects of Making a Murderer, did following that series.\n\nSome seem to be banking on The Keepers as the next big thing when it comes to true crime. The upcoming seven-part series is described as an investigation into the “unsolved murder of a nun and the horrific secrets and pain that linger nearly five decades after her death.” Sister Cathy was killed in Baltimore in 1969, with her case to this day remaining unsolved. Many speculate her killing was part of a Byzantine conspiracy related to sexual abuse within the Catholic Church.\n\n\"The case returned to the spotlight in the 1990s when one of Sister Cathy’s former students—a woman only known as 'Jane Doe'—came forward to share her experience of horrendous sexual abuse by the high school’s chaplain,\" says Netflix's official description of the new show. \"Incredibly, 'Jane Doe' revealed she was also taken to Sister Cathy’s undiscovered body and told, 'See what happens when you say bad things about people.' Despite this and testimony from other victims and witnesses of abuse, no one was held accountable, and the story was largely unreported outside of Baltimore... Through conversations with dozens of friends, relatives, journalists, government officials and Baltimore citizens determined to uncover the truth, [director Ryan White] pieces together a story that goes beyond the death of a beloved Catholic school teacher to encompass clergy abuse, repressed memories and government and religious institutions that he says 'at best, dropped the ball over the last 45 years—and, at worst, covered it up.\"\n\nWhite is best known for his work on the marriage equality documentary The Cast Against 8 and the 2016 film Serena. The series is set to debut in full, as per Netflix tradition, on May 19.\n\nBy the way, Making the Murderer is slated for a season two, although details on that are few and far between. Cindy Holland, Netflix's VP of original content, said the following in January of this year: “The story is still ongoing, so you will see new episodes coming sometime this year as this story continues to unfold. We don’t know when for sure new episodes will be coming.”", "images": ["http://b.scorecardresearch.com/p?cv=2.0&cj=1&c1=2&c2=17186550&c6=Radar&c8=Is+%E2%80%98The+Keepers%E2%80%99+Netflix%E2%80%99s+Next+%E2%80%98Making+A+Murderer%E2%80%99%3F", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8xODQzNzI0Mi9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTYyNzc2Mzg0MX0.HTUTr5e3PtF_1zZZMRCUk623hq2jsOX8EKm9MoWLafI/img.jpg?width=980"], "top_img": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8xODQzNzI0Mi9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTYyNzc2Mzg0MX0.HTUTr5e3PtF_1zZZMRCUk623hq2jsOX8EKm9MoWLafI/img.jpg?width=980", "keywords": [], "authors": ["Eric Shorey"], "canonical_link": "https://nylon.com/articles/the-keepers-netflix", "title": "Is ‘The Keepers’ Netflix’s Next ‘Making A Murderer’?", "meta_data": {"twitter": {"card": "summary_large_image", "site": "@", "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8xODQzNzI0Mi9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTYyNzc2Mzg0MX0.HTUTr5e3PtF_1zZZMRCUk623hq2jsOX8EKm9MoWLafI/img.jpg?width=980"}, "fb": {"app_id": 1332028133512923}, "og": {"type": "article", "url": "https://nylon.com/articles/the-keepers-netflix", "site_name": "NYLON", "image": {"identifier": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8xODQzNzI0Mi9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTYyNzc2Mzg0MX0.HTUTr5e3PtF_1zZZMRCUk623hq2jsOX8EKm9MoWLafI/img.jpg?width=980", "width": 980, "height": 2000}, "title": "Is &#8216;The Keepers&#8217; Netflix&#8217;s Next &#8216;Making A Murderer&#8217;?", "description": "We can’t get enough of docu-series about complicated murder cover-ups"}, "article": {"section": "Radar", "publisher": 60772646764, "published_time": "2017-04-17T20:31:00+00:00", "modified_time": "2019-01-28T20:07:16+00:00", "author": "https://www.facebook.com/60772646764"}, "referrer": "always", "theme-color": "#647187", "viewport": "width=device-width,initial-scale=1,minimum-scale=1.0,maximum-scale=1.0,user-scalable=no", "keywords": "crime, documentary, making a murderer, netflix, news, radar, the keepers, tv", "description": "We can’t get enough of docu-series about complicated murder cover-ups"}, "movies": [], "publish_date": 1492461060.0, "source": "https://nylon.com", "summary": ""}