{"url": "http://toofab.com/2017/11/30/matt-lauer-sexual-misconduct-today-late-night-jokes-trump-stephen-colbert-jimmy-kimmel-jimmy-fallon/", "text": "Almost every late-night host examined the sexual misconduct allegations that ultimately left Matt Lauer unemployed during their respective shows Wednesday night.\n\nLauer, a longtime \"Today\" host, was terminated overnight on Tuesday after NBC conducted an investigation from a complaint that they heard earlier in the week. After the news broke Wednesday morning, Variety published a report with three women claiming the anchor had sexually harassed them, as well. One woman claimed the anchor gave her a sex toy as a present, along with an explicit note on how he would like to use it on her, while another claimed he exposed himself to her inside of his office. The latter also claimed that he had a button underneath his desk that could lock the door from the inside.\n\nNBC's Seth Meyers was one of the few stars of late-night TV that didn't address the media bombshell, but he tweeted an explanation why.\n\n\"Due to the tree lighting we taped tonight's show yesterday so if you're wondering why any of today's news is conspicuously absent this evening - now you know!\" Meyers wrote.\n\nMany of the late-night hosts also seemed pretty disturbed by other tweets on the subject from President Donald Trump.\n\nWow, Matt Lauer was just fired from NBC for “inappropriate sexual behavior in the workplace.” But when will the top executives at NBC & Comcast be fired for putting out so much Fake News. Check out Andy Lack’s past! — Donald J. Trump (@realDonaldTrump) November 29, 2017\n\nSo now that Matt Lauer is gone when will the Fake News practitioners at NBC be terminating the contract of Phil Griffin? And will they terminate low ratings Joe Scarborough based on the “unsolved mystery” that took place in Florida years ago? Investigate! — Donald J. Trump (@realDonaldTrump) November 29, 2017\n\n\"Listen up! You don't get to comment,\" Colbert said.\n\nSee what else Colbert had to say on the situation, along with Jimmy Kimmel and Jimmy Fallon.\n\n\"The Late Show with Stephen Colbert\"\n\n\"Ladies and gentlemen, welcome to 'The Late Show.' I'm your host Stephen Colbert. I am one of the few men still allowed on television,\" the CBS star said to kick off his monologue.\n\nThe late-night host suggested that America really shouldn't be surprised by these allegations since Lauer had a history of dressing as women every Halloween. The former morning show host has dressed up as Dolly Parton, a \"Baywatch\" girl, Paris Hilton, Jennifer Lopez and Lucy from \"Peanuts,\" to name a few.\n\nBut as Colbert pointed out, the initial allegation and subsequent termination was just the tip of the iceberg; it was allegations in the Variety article that he really found disturbing.\n\n\"It's bad enough that he gave her a sex toy, but he also gave her instructions? He found a way to mansplain sexual harassment,\" Colbert said. \"I'm going to say what that woman honestly could not at the moment, 'What a dick.'\"\n\nAs for Trump tweeting about the \"Fake News practitioners at NBC\" in his reaction to Lauer's termiantion, Colbert said: \"By fake news do you mean more than a dozen women accusing Trump of improper conduct or sexual assault? Is that what you mean by 'fake news?' Listen up! You don't get to comment; that is the pot calling the kettle at 3 AM asking what she's wearing.\"\n\n\"Jimmy Kimmel Live!\"\n\nKimmel found out about the allegations when his wife looked at her phone Wednesday morning and said, \"Oh my God, Matt Lauer.\"\n\n\"Which of course I assumed he was dead so I guess this is better, I don't know,\" Kimmel said.\n\nWhile the ABC late-night host found the situation \"surprising,\" he was more angered by Trump's response on Twitter.\n\n\"I'll tell ya if anyone knows about inappropriate sexual behavior in the workplace at NBC, it's Donald J. Trump,\" Kimmel said. \"Is he aware that he's him? I don't think he is.\"\n\n\"As far as Matt Lauer goes, what happens next? Does he have to do an emotional sit down interview with himself?\" Kimmel joked.\n\n\"The Tonight Show Starring Jimmy Fallon\"\n\nThe NBC late-night host found a way to inject some holiday spirit into the Lauer scandal.\n\n\"The Rockefeller Christmas tree was lit tonight,\" Fallon said. \"Also getting lit tonight, the HR rep over at the 'Today' show.\"\n\n\"If you're wondering where in the world is Matt Lauer, he's probably at a bar somewhere with Charlie Rose,\" the late-night host added.\n\nLike the rest of the late-night gang, Fallon also called out Trump's tweets.\n\n\"Actually President Trump tweeted about Matt Lauer being fired and went on to attack NBC News executives and Joe Scarborough. And then Kim Jong-Un was like, 'Uh, did you guys not see that missile yesterday or I mean, I know you're busy, but I can relaunch it or something. Are you kidding me here?'\"\n\nView Photos Getty", "images": ["https://ll-assets.tmz.com/www.tmz.com/main/default/cache/images/feedlogo2.v2014_05_09_134122.gif", "https://assets.toofab.com/toofab.com/main/default/img/toofab-logo-white.svg", "https://toofab.akamaized.net/2019/04/06/elite-daily-logo-1.png", "https://assets.toofab.com/toofab.com/main/default/img/skeleton.svg", "https://toofab.akamaized.net/2017/11/30/late-night-lauer-1200x630.jpg", "https://ll-media.tmz.com/2013/04/26/partner-rsss-justjared-logo-cut-v2.gif", "https://ssl-cdn-media.tmz.com/2013/04/26/partner-rss-fox-b-w.png", "https://toofab.akamaized.net/2019/04/06/cdl-260x30-for-tmz3-1.png", "https://toofab.akamaized.net/2018/12/19/newsletter-logo-v2-1.png", "https://ll-media.tmz.com/2013/04/26/partner-rss-thestir-logo-cut-v2-1.png"], "top_img": "https://toofab.akamaized.net/2017/11/30/late-night-lauer-1200x630.jpg", "keywords": [], "authors": ["Toofab Staff"], "canonical_link": "https://toofab.com/2017/11/30/matt-lauer-sexual-misconduct-today-late-night-jokes-trump-stephen-colbert-jimmy-kimmel-jimmy-fallon/", "title": "Late-Night Hosts Lay Into Matt Lauer and Tear Apart Trump's Response", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "twitter": {"toofab": 116547240, "card": "summary_large_image", "site": "@toofab", "title": "Late-Night Hosts Lay Into Matt Lauer and Tear Apart Trump's Response", "description": "\"The Rockefeller Christmas tree was lit tonight. Also getting lit tonight, the HR rep over at the 'Today' show,\" Jimmy Fallon jokes.", "image": "https://toofab.akamaized.net/2017/11/30/late-night-lauer-1200x630.jpg"}, "verify-v1": "Wtpd0N6FufoE2XqopQJoTjWV6Co/Mny9BTaswPJbPPA=", "msvalidate.01": "AFEB17971BCF30779AEA662782EF26F4", "y_key": "14cb04e4656b0c58", "keywords": "Matt Lauer, Late Night, Trump", "description": "\"The Rockefeller Christmas tree was lit tonight. Also getting lit tonight, the HR rep over at the 'Today' show,\" Jimmy Fallon jokes.", "robots": "index,follow", "referrer": "unsafe-url", "og": {"url": "https://toofab.com/2017/11/30/matt-lauer-sexual-misconduct-today-late-night-jokes-trump-stephen-colbert-jimmy-kimmel-jimmy-fallon/", "site_name": "toofab", "type": "article", "title": "Late-Night Hosts Lay Into Matt Lauer and Tear Apart Trump's Response", "description": "\"The Rockefeller Christmas tree was lit tonight. Also getting lit tonight, the HR rep over at the 'Today' show,\" Jimmy Fallon jokes.", "image": "https://toofab.akamaized.net/2017/11/30/late-night-lauer-480x360.jpg"}, "fb": {"app_id": 116046798441464, "pages": 324392354652}, "article": {"publisher": "https://www.facebook.com/TooFab"}}, "movies": ["https://www.youtube-nocookie.com/embed/veVBbxZyzKU", "https://www.youtube-nocookie.com/embed/XJBvP-NZJ9U", "https://www.youtube-nocookie.com/embed/u0g1qowbCQk"], "publish_date": 1511971200.0, "source": "http://toofab.com", "summary": ""}