{"url": "www.elitedaily.com/p/kim-kardashians-tweet-about-kylie-jenners-forbes-cover-proves-shes-far-from-jealous-9739386", "text": "Depending on how you look at it, Kim Kardashian and Kylie Jenner are the most famous members of their family. Some favor Kim over Kylie and vice versa, but one thing Jenner has surpassed Kardashian in is her net worth. On July 11, Forbes revealed its new cover for the \"America's Women Billionaires\" issue, and Jenner is front and center. The outlet reports that thanks to Kylie Cosmetics, the new mom is almost a billionaire. People on Twitter started pitting the sisters against each other over their money, but Kim Kardashian's tweet about Kylie Jenner's Forbes cover shows that she's the farthest from jealous someone could get: she's proud.\n\nWhen the Forbes cover was released on July 11, Jenner posted the cover to her Instagram in a moment of pride. She said, \"wow. i can’t believe I’m posting my very own @forbes cover. thank you for this article and the recognition. I’m so blessed to do what i love everyday. i couldn’t have dreamt this up! #KylieCosmetics.\" The article finely outlines Jenner's net worth as a result of Kylie Cosmetics, Keeping Up With The Kardashians, her and Kendall Jenner's PacSun clothing line, and her other various money-making schemes, and she's worth $900 million. Kim Kardashian, on the other hand, is worth $350 million, according to Forbes.\n\nIt's not like either of those numbers are small or unimpressive, but nevertheless, people on Twitter started trolling Kardashian and Jenner, many joking that Kardashian must be extremely jealous that her youngest sister ended up more successful than her (money wise).\n\nThis is Kylie Jenner's Forbes cover.\n\nAnd here's what Twitter had to say about it.\n\nLots of people (including Dictionary.com) are arguing that Jenner isn't self-made at all. I mean... I feel like it's obvious that she's objectively not. She was born into a famous family, was on KUWTK because it was about said famous family. Jenner has 100 percent taken the fame she already had and used it to her advantage better than any of her siblings, but self-made? Nah.\n\nDictionary.com trolled Jenner in the most savage way when this cover came out.\n\nThe account quoted Forbes tweet of Jenner's cover and said, \"Self-made means having succeeded in life unaided. Used in a sentence: Forbes says that Kylie Jenner is a self-made woman.\" The (pretty true) shade! Jenner is a hard worker, no doubt, and the success of Kylie Cosmetics is thanks to her, but the literal definition of \"self-made\" consists of not having any help. You can't really be self-made when you're born into fame and then you use that fame to your favor. More power to Jenner for creating one of the most successful makeup companies in the world, but that success is in part thanks to the fact that she was born with more privilege than most.\n\nOne person who has no issue with Jenner's success, however, is Kim Kardashian.\n\nKardashian tweeted Jenner's Forbes cover not once, but twice. Her first tweet said, \"CONGRATS @KylieJenner\" with three flame emojis. The second said \"Wait I'm posting this again just because!!!! BILLION DOLLAR BABY\" with a bunch of emojis. Kim K has no time for people saying she's jealous. (She also posted a video on her Instagram story in honor of Jenner.)\n\nOne fan came to the family's defense about their work ethic and the doubt about their success.\n\nThe tweet said, \"The Kardashian Jenner women are the smartest, hardest working women that I know. They are the first to start their work day before the sun rises and always the last ones to end it. Debate and hate all you want but their success and longevity is no accident.\" Kardashian quoted the tweet with three clapping emojis.\n\nWhether you think Kylie Jenner is \"self-made\" or not, one person we can thank for all of this is Kris Jenner. Kylie Jenner, Kim Kardashian, and the Devil may work hard, but Kris Jenner works harder.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2020/4/8/b47cc3b6-d313-4b09-b396-8fb0f48d2b13-getty-1205807538.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/7/12/17961b6b-6222-4eae-a95f-d1736e480c10-kim-kylie.jpg?w=1020&h=574&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/9/f04700b9-2e38-452c-8112-5352f1765b19-getty-1060381824.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=100478526961130&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2018/7/12/17961b6b-6222-4eae-a95f-d1736e480c10-kim-kylie.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2020/4/10/b5088cc2-b75c-439b-818a-871f93e3532e-getty-1209679085.jpg?w=120&h=120&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif"], "top_img": "https://imgix.bustle.com/uploads/image/2018/7/12/17961b6b-6222-4eae-a95f-d1736e480c10-kim-kylie.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/kim-kardashians-tweet-about-kylie-jenners-forbes-cover-proves-shes-far-from-jealous-9739386", "title": "Kim Kardashian's Tweet About Kylie Jenner's 'Forbes' Cover Proves She's Far From Jealous", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/kim-kardashians-tweet-about-kylie-jenners-forbes-cover-proves-shes-far-from-jealous-9739386", "type": "article", "title": "Kim Kardashian Clapped Back At Haters Who Said She’s Jealous Of Kylie Jenner", "description": "Depending on how you look at it, Kim Kardashian and Kylie Jenner are the most famous members of their family. Some favor Kim over Kylie and vice versa, but one thing Jenner has surpassed Kardashian in is her net worth. On July 11, Forbes revealed…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/7/12/17961b6b-6222-4eae-a95f-d1736e480c10-kim-kylie.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 378366428966386, "pages": 237865036265136}, "description": "Depending on how you look at it, Kim Kardashian and Kylie Jenner are the most famous members of their family. Some favor Kim over Kylie and vice versa, but one thing Jenner has surpassed Kardashian in is her net worth. On July 11, Forbes revealed…"}, "movies": [], "publish_date": null, "source": "http://www.elitedaily.com", "summary": ""}