{"url": "www.thehollywoodgossip.com/2018/01/rihanna-boyfriend-hassan-jameel-warning-chris-brown-to-stay-away/", "text": "Rihanna is ... well, there's no real way to communicate with mere words how amazing Rihanna is.\n\nShe's beautiful, intelligent, talented, and just so many good things. There aren't enough hours in the day to sit down and count all of her virtues.\n\nShe's just the best, OK?\n\nAnd if you're a human being who walks this earth, then you surely know that.\n\nIt just makes sense that since Rihanna is such a treasure to us all, she's even more special to the men she dates -- and since last year, she's been dating billionaire Hassan Jameel.\n\nHassan is the deputy president and vice chairman of his family's company, which owns the rights to sell Toyota cars in Saudi Arabia.\n\nWe don't know much more about him, since he and Rihanna have been keeping their relationship very private.\n\nBut we do know that they've been dating for close to a year now, and that they definitely seem serious about each other.\n\nSo that's nice, right? It's good to see Rihanna with someone who isn't an aggressive, violent, hateful, scary douchebag.\n\nAnd speaking of Chris Brown ...\n\nIt seems like while Chris isn't exactly an issue in Rihanna and Hassan's relationship, Hassan is concerned about him.\n\nA source tells Hollywood Life that \"He is uncomfortable with her ex Chris lurking in her past.\"\n\nGee, wonder why?\n\n\"Hassan doesn't trust Chris,\" the source adds, \"and he feels like he is unpredictable when it comes to Rihanna.\"\n\n\"He feels like Chris is capable of trying anything to win her back and that has him feeling uneasy. Hassan tries not to worry about Chris, but knowing he may still love Rihanna makes him feel a bit tense.\"\n\nHis concerns may be valid -- another source claims that even after all this time and even though Rihanna has clearly moved on, Chris is still hung up on her.\n\n\"Chris thinks Hassan is not good enough for Rihanna -- but then, nobody would be good enough for her in his eyes,\" this insider states.\n\nHe's including himself in that, right? He can't think that he's good enough for her. Right?!\n\n\"He thinks there's no way Rihanna would marry this dude, which is kinda funny really as he doesn't know Hassan at all,\" the source continues.\n\n\"Chris just can't help it though, even after all these years, and all the water that's passed under the bridge, he still loves Rihanna to pieces and he still thinks of her as being his girl.\"\n\n\"It's totally crazy, but Chris still holds out this belief that one day, somehow, he and Rihanna will get back together and live happily after,\" the insider concludes.\n\nNo wonder Hassan has some concerns.\n\nEspecially when Chris has referred to himself as a stalker in the past, and has made statements like \"If I love you, bitch, ain't nobody gonna have you, I'm gonna make you miserable.\"\n\nWe'd say we don't have the best feeling about this, but we never have good feelings when it comes to Chris Brown.", "images": ["https://www.thehollywoodgossip.com/assets/logo-white-beee066818238b0eb075767349f71cae.png", "https://the-hollywood-gossip-res.cloudinary.com/iu/s--C7Uzok2J--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1514388985/rihanna-chills.jpg"], "top_img": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--C7Uzok2J--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1514388985/rihanna-chills.jpg", "keywords": [], "authors": ["Emily Trainham"], "canonical_link": "https://www.thehollywoodgossip.com/2018/01/rihanna-boyfriend-hassan-jameel-warning-chris-brown-to-stay-away/", "title": "Rihanna: Boyfriend Hassan Jameel Warning Chris Brown to Stay Away?!", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"app_id": 277650442346327}, "og": {"site_name": "The Hollywood Gossip", "type": "article", "url": "https://www.thehollywoodgossip.com/2018/01/rihanna-boyfriend-hassan-jameel-warning-chris-brown-to-stay-away/", "title": "Rihanna: Boyfriend Hassan Jameel Warning Chris Brown to Stay Away?!", "description": "Rihanna has been dating billionaire Hassan Jameel for several months now ... but is Chris Brown trying to weasel his way back into her life?!", "image": {"identifier": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--5r0jlUJt--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1364527731/rihanna-instagram-photos-1.jpg", "type": "image/jpeg", "width": 435, "height": 452}}, "article": {"published_time": "2018-01-31T12:39:21-05:00", "modified_time": "2018-01-31T12:39:21-05:00", "tag": "Chris Brown", "author": "Emily Trainham"}, "twitter": {"site": "thgossip", "card": "summary_large_image", "title": "Rihanna: Boyfriend Hassan Jameel Warning Chris Brown to Stay Away?!", "description": "Rihanna has been dating billionaire Hassan Jameel for several months now ... but is Chris Brown trying to weasel his way back into her life?!", "image": {"src": "https://the-hollywood-gossip-res.cloudinary.com/iu/s--C7Uzok2J--/t_full/cs_srgb,f_auto,fl_strip_profile.lossy,q_auto:420/v1514388985/rihanna-chills.jpg"}}, "description": "Rihanna has been dating billionaire Hassan Jameel for several months now ... but is Chris Brown trying to weasel his way back into her..."}, "movies": [], "publish_date": 1517420361.0, "source": "http://www.thehollywoodgossip.com", "summary": ""}