{"url": "https://www.bbc.com/news/entertainment-arts-40517529", "text": "Image copyright Roc Nation Image caption Jay-Z receives his platinum award from the RIAA\n\nJay-Z's latest album, 4:44, has been certified platinum less than a week after it was released - reflecting sales of one million copies in the US.\n\nOn the face of it, this is hugely impressive. In the space of just five days, Jay-Z has landed the sixth biggest-selling album of the year.\n\nHis first-week sales are now expected to double those of Kendrick Lamar's Damn! - previously the year's fastest-selling album - which shifted 603,000 copies back in April.\n\nThe feat looks even more impressive because 4:44 is only available on Tidal, the streaming service Jay-Z owns.\n\nBut then Variety magazine noticed something odd: The photograph of Jay-Z receiving his platinum award was taken before the album was released.\n\nMedia playback is unsupported on your device Media caption Jay-Z's new song Bam is made Radio 1's \"hottest record\"\n\nHow could the Recording Industry Association of America (RIAA) be so sure he'd pass the sales barrier?\n\nWell, it turns out that Jay-Z had done a deal with mobile company Sprint (a major shareholder in Tidal), who gave away copies of the album to their subscribers.\n\nCrucially, Sprint paid for each of those copies, making every \"free\" album eligible for a platinum award; and the RIAA says Jay-Z's label RocNation had to provide evidence that the downloads were in fact initiated by consumers.\n\nBut still - the RIAA rules state that the wholesale price of the album only needs to be $2 (£1.55) to register as a sale - so Sprint probably paid Jay-Z less than it would cost to air an advert during the Super Bowl (up to $3.8 million for 30 seconds).\n\nImage copyright Getty Images Image caption 4:44 sees Jay-Z respond to Beyonce's accusations of infidelity on her album Lemonade\n\nIt's almost certain that these downloads are what spurred Jay-Z's album to platinum status. To do it on streaming alone, the album's tracks would have had to be streamed 1.5 billion times, since 1,500 streams of a song count as one \"sale\" under current chart rules.\n\nGiven that Tidal has, at best, 3 million subscribers, each of them would have needed to listen to the album 500 times to push sales over the one million mark - an impossibility in just five days.\n\nThe album's performance in the UK - where the album is only available on Tidal - is instructive here. On Monday afternoon, when the Official Charts Company publishes its midweek sales flash, 4:44 hadn't been streamed enough times to make the Top 100.\n\n(In the US, the free-but-paid-for downloads aren't chart eligible, so Jay-Z won't make a huge impact on the Billboard countdown, either).\n\nImage copyright Getty Images Image caption Tidal was launched by an all-star line-up in 2015, promising better returns to artists - but it has struggled to compete with Apple and Spotify\n\nSo why go through this rigmarole? Well, the benefit to Jay-Z, in marketing terms, is huge. Music executives believe that gold and platinum awards have a bandwagon effect, leading to even-bigger sales.\n\nAnd the RIAA has been accused of massaging the figures that count towards their awards before.\n\nIn 1994, for example, the music industry body claimed that the Lion King soundtrack had sold 7 million copies. SoundScan, which compiles the charts, contested the actual figure was 4.9 million. It turned out the RIAA had counted records that had been shipped to stores, but were still sitting on shelves and in warehouses (it also counts music distributed by non-retail record clubs, mail order houses, specialty stores and direct marketing sales).\n\nSo while you should take Jay-Z's figures with a pinch of marketing salt, it's also worth noting that 4:44 has been illegally downloaded almost a million times this week.\n\nFans are still eager to hear it, no matter how they're getting the music.\n\nFollow us on Facebook, on Twitter @BBCNewsEnts, or on Instagram at bbcnewsents. If you have a story suggestion email entertainment.news@bbc.co.uk.", "images": ["https://ichef.bbci.co.uk/news/320/cpsprodpb/18422/production/_96826399_7be10d1a-158e-455f-897b-4b01e5b93fd7.jpg", "https://ssc.api.bbc.com/?c1=2&c2=19293874&ns_site=bbc&name=", "https://ichef.bbci.co.uk/images/ic/720x405/p057p8wh.jpg", "https://a1.api.bbc.co.uk/hit.xiti?&col=1&from=p&ptag=js&s=598253&p=entertainment_and_arts::news.entertainment_and_arts.story.40517529.page&x1=[urn:bbc:cps:0cf2dcdc-5746-4c44-a8e1-f1e5fcc86760]&x2=[responsive]&x3=[bbc_website]&x4=[en]&x7=[article]&x8=[reverb-1.4.0-nojs]&x11=[NEWS_GNL]&x12=[NEWS]", "https://ichef.bbci.co.uk/news/1024/branded_news/18422/production/_96826399_7be10d1a-158e-455f-897b-4b01e5b93fd7.jpg"], "top_img": "https://ichef.bbci.co.uk/news/1024/branded_news/18422/production/_96826399_7be10d1a-158e-455f-897b-4b01e5b93fd7.jpg", "keywords": [], "authors": ["Mark Savage", "Bbc Music Reporter"], "canonical_link": "https://www.bbc.com/news/entertainment-arts-40517529", "title": "Did Jay-Z's 4:44 really sell a million copies in five days?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "The sales figures for Jay-Z's new album 4:44 aren't quite what they seem, says BBC Music's Mark Savage", "x-country": "hk", "x-audience": "Asia", "CPS_AUDIENCE": "Asia", "CPS_CHANGEQUEUEID": 0, "og": {"title": "Did Jay-Z really go platinum in five days?", "type": "article", "description": "The sales figures for Jay-Z's new album 4:44 aren't quite what they seem, says BBC Music's Mark Savage", "site_name": "BBC News", "locale": "en_GB", "url": "https://www.bbc.com/news/entertainment-arts-40517529", "image": {"identifier": "https://ichef.bbci.co.uk/news/1024/branded_news/18422/production/_96826399_7be10d1a-158e-455f-897b-4b01e5b93fd7.jpg", "alt": "BBC News. Jay-Z"}}, "article": {"author": "https://www.facebook.com/bbcnews", "section": "Entertainment & Arts"}, "fb": {"pages": "1143803202301544,317278538359186,1392506827668140,742734325867560,185246968166196,156060587793370,137920769558355,193435954068976,21263239760,156400551056385,929399697073756,154344434967,228735667216,80758950658,260212261199,294662213128,1086451581439054,283348121682053,295830058648,239931389545417,304314573046,310719525611571,647687225371774,1159932557403143,286567251709437,1731770190373618,125309456546,163571453661989,285361880228,512423982152360,238003846549831,176663550714,260967092113,118450564909230,100978706649892,15286229625,122103087870579,120655094632228,102814153147070,124715648647,153132638110668,150467675018739", "app_id": 1609039196070050, "admins": 100004154058350}, "twitter": {"card": "summary_large_image", "site": "@BBCWorld", "title": "Did Jay-Z really go platinum in five days?", "description": "The sales figures for Jay-Z's new album 4:44 aren't quite what they seem, says BBC Music's Mark Savage", "creator": "@BBCWorld", "image": {"src": "https://ichef.bbci.co.uk/news/1024/branded_news/18422/production/_96826399_7be10d1a-158e-455f-897b-4b01e5b93fd7.jpg", "alt": "Jay-Z"}, "domain": "www.bbc.com"}, "apple-itunes-app": "app-id=364147881, app-argument=https://www.bbc.com/news/entertainment-arts-40517529?utm_medium=banner&utm_content=apple-itunes-app", "apple-mobile-web-app-title": "BBC News", "application-name": "BBC News", "msapplication-TileImage": "BBC News", "msapplication-TileColor": "#bb1919", "mobile-web-app-capable": "yes", "robots": "NOODP,NOYDIR", "theme-color": "#bb1919"}, "movies": [], "publish_date": null, "source": "https://www.bbc.com", "summary": ""}