{"url": "https://www.bbc.com/news/world-44045291", "text": "The Oscars, the Golden Globes, Cannes Film Festival. Until 2017 they were Tinsel Town's glitziest back-slapping forums. Now they're its favourite protest events.\n\nOf course it's down to #MeToo, the campaign against sexual harassment and abuse that swept through Hollywood last autumn and has since been Googled in every country on Earth.\n\nIn its current form, the movement began with film executive Harvey Weinstein - or rather, with the dozens of women who accuse him of sexual harassment, abuse or rape. The New York Times printed the first allegations on 5 October, and the mogul was fired from his own company inside a week. Pandora's box was open. Harvey Weinstein denies engaging in non-consensual sex.\n\nOn 15 October, actress Alyssa Milano suggested on Twitter that anyone who had been \"sexually harassed or assaulted\" should reply to her Tweet with \"Me Too\", to demonstrate the scale of the problem. Half a million people responded in the first 24 hours.\n\nA barrage of allegations has since emerged against high-profile men in entertainment, the media, politics, and tech. Many deny any wrongdoing. The repercussions are still in flux, but Hollywood's power dynamics have undoubtedly shifted.\n\nThat's less obviously true in the world beyond, and begs the question: What's different for the millions of ordinary people who shared their own #MeToo stories? Are the currents of the movement visible in their lives too? How far has the rallying cry been converted into real-world change?\n\nTesting 'Time's Up': Who's been helped by those Hollywood millions?\n\nOne initiative has made solid progress (and spent solid millions) in a bid to make things better on the ground: the Time's Up Legal Defense Fund.\n\nMore than 300 actresses, writers and directors launched the project on 1 January, raising $21m (£15m) in just a month to fund legal assistance for people who suffer harassment, abuse or assault at work.\n\nThe National Women's Law Center (NWLC) in Washington DC is fielding the considerable admin, matching applicants with lawyers who can offer them free advice.\n\n\"We have received more than 2,700 requests for assistance from every state in the United States, and there are more than 500 attorneys in the network who are ready to take on Time's Up cases,\" Sharyn Tejani, director of the fund at the NWLC, told the BBC.\n\n\"The fund prioritises cases involving low-wage workers, women in non-traditional jobs, people of colour, LGBTQ people, and people facing legal retaliation because they dared to speak out about sexual harassment,\" said Ms Tejani.\n\nTina Tchen, who jointly leads the fund's legal aid efforts, said the beneficiaries include \"construction workers, prison guards [and] police officers,\" adding: \"There are men who have come forward too. There are some men who have experienced sexual harassment, and then there are some men who are calling, for example, on behalf of their wives or loved ones.\"\n\nThat's unlikely to raise surprise in some quarters. Sian Brooke of the Oxford Internet Institute, who studies gender and sexism online, says the fact that men are often victims of sexual violence was one of the most powerful takeaways from #MeToo.\n\n\"One group can be given attention and be taken seriously with regards to allegations of rape, without it taking any of the severity or weight away from another part of it,\" she notes.\n\nHas #MeToo helped abuse survivors seek support?\n\nFrom October to December 2017, calls to the Rape, Abuse & Incest National Network - a US crisis hotline - rose by 23% compared with the same period in 2016.\n\nSome abuse survivors have cited #MeToo as a stressful influence, saying it resurfaced the pain of their abuse. Others have reported feeling less alone, saying it encouraged them to address past trauma by talking to loved ones, counsellors, or people with similar experiences.\n\n\"It's brought the idea of sexual harassment and assault into the public consciousness,\" Ms Brooke says. \"Even if the discussion around the movement is criticism, you are still bringing about an awareness that this happens.\"\n\n1in6 is a Los Angeles-based non-profit group that supports male sex abuse survivors. The group's development and communications director Meredith Alling told the BBC that #MeToo had a rapid, measurable impact on the number of men reaching out to them when the hashtag first went viral.\n\n\"We saw a 110% increase in web traffic and a 103% increase in the use of our online helpline service between September and October 2017, and the trend has continued,\" she said.\n\nWhat's being done to create better workplaces?\n\nIn the US, employers are considering how best to create a positive workplace culture in the wake of #MeToo.\n\nTed Bunch is a co-founder of A Call To Men, a social activism group that promotes healthy, respectful ways of \"being a man\", and says the group has noticed an increase in enquiries.\n\n\"Most notably, we have seen an increase in corporations seeking to understand why sexual harassment in the workplace is so pervasive,\" he says.\n\nMr Bunch believes problems can arise because the workplace is a microcosm of society, in which men and boys are sometimes taught to view women as objects, and of less value than men.\n\n\"Most men are not abusive,\" he says, \"but nearly all men have laughed at a sexist joke or objectified a woman in some way. Once you connect the dots and show men how the jokes they see as harmless actually validate and fuel more harmful behaviour, they are quick to change.\"\n\nHas the push to ditch bad work cultures spread beyond the US? One British human resources consultant said she had been surprised by the lack of #MeToo-inspired queries.\n\n\"We haven't seen any spikes in the volume of training requests, or the volume of training we're recommending. I don't think it's had a significant impact,\" said Elaine Howell, HR manager at PlusHR.\n\n\"We have clients in professional services, manufacturing clients, financial, marketing... It appears to be quite specific to that industry [entertainment].\"\n\nSpeak to Equity, the 43,000-strong British actors' union, and it's clear they've had a different experience. The union won't give exact figures, but says it's witnessed a \"significant increase in enquiries and case work since #MeToo\".\n\nVice president Maureen Beattie will take on Equity's presidency this summer, and she's keen to get the message out: toxic behaviour will not go unpunished. Or as she puts it, \"If you do something to one of our members which is wrong, unacceptable, we're going to come after you. And we will come after you big-time.\"\n\n\"These people haven't gone away,\" she says. \"They are under a stone. They are lurking, just waiting for the time they think nobody's looking any more.\n\n\"One of the things we're doing is asking people who have been in the business for a long time, people who are stars, people who have clout, to keep an eye out. Not that they have to be trained up in how to help somebody who's been sexually harassed, but [they] can say - with impunity and no danger of never being worked with again - 'Excuse me? You can't behave like that with people'.\"\n\nHow does an online movement secure an offline legacy?\n\nThe #MeToo most of us know is still a new-ish creation. But it had a life before the viral hashtag. In 2006, black activist Tarana Burke founded the movement as an initiative to unite survivors of sexual violence.\n\nSince it morphed from a low-key project into a global byword, she has embraced #MeToo's A-List flag-bearers - but her focus is on lasting change at all levels of society.\n\nOne of her most telling remarks came the week before she walked the red carpet at the 2017 Oscars: \"If we keep on 'making statements' and not really doing the work, we are going to be in trouble.\"\n\nSarah J Jackson, a professor of communication studies at Northeastern University, believes context is the key to anchoring Me Too.\n\n\"I wouldn't call hashtag 'Me Too' a movement at all,\" she says. \"I would call it a campaign that is part of a larger movement. So I would call women's rights the movement, and feminism the movement. And I would say #MeToo is one indication of the sort of conversations that need to happen.\n\n\"The next step is, OK so now we know the problem - how do we as a global community expand this conversation?\"\n\nThrough its \"Me Too Rising\" project, Google has charted how awareness spread around the world. While data shows the term has been searched for in every corner of the planet, its resonance has inevitably been greater in some countries than others. The freedom of a nation's press and social media can certainly have impact on that - and it's too soon to tell how the movement will shape countries where it's gained traction more slowly - Japan and South Korea, for example.\n\nKaruna Nundy, a prominent lawyer in India's Supreme Court, shared her view on #MeToo's relevance to India, where outrage over sex crimes has sparked waves of public protests in recent years.\n\n\"The #MeToo conversations in India are limited to a swathe of English-speaking, internet-enabled people. It's quite a lot in absolute numbers, but small for India. It's added, though, to the huge conversations that were already happening. The idea that due process is failing women, and civil disobedience can be legitimate.\"\n\nMs Nundy, who helped draft India's tougher anti-rape law in 2013, says victims are now more likely to be believed.\n\n\"I had a rape case yesterday against a leading Bollywood producer. My client is a very young woman; we told the court that she was raped over a period of six months on pain of bodily harm. Regardless of what the court decides, I think the way we were heard by the chief justice of the Supreme Court and the two judges is very different from the way we would have been heard, say, 15 years ago.\n\n\"There's an interplay between public consciousness, and the law and due process. And that's exactly what I think is happening.\"\n\nPerhaps, then, #MeToo is not an endgame - but a clarion call to something bigger. A reminder for people to seek change in their communities, and push to make damaging systems better - especially for those who lack the power to fight alone.\n\nThere is information and support available for anyone affected by sexual abuse:\n\nSome organisations in the UK\n\nRape Crisis Network Europe has contact information listed by country\n\nIn the US, you can call the National Sexual Assault Hotline: 1-800-656-HOPE - or get help online\n\n... and 1in6 offers free 24/7 support for male abuse survivors\n\nIllustrations by Katie Horwich", "images": ["https://ichef.bbci.co.uk/news/1024/branded_news/A8AC/production/_101308134_timesupfinal_front-nc.png", "https://a1.api.bbc.co.uk/hit.xiti?&col=1&from=p&ptag=js&s=598253&p=world::news.world.story.44045291.page&x1=[urn:bbc:cps:ca39f229-6890-4840-ad15-3b0084be060b]&x2=[responsive]&x3=[bbc_website]&x4=[en]&x7=[article]&x8=[reverb-1.4.0-nojs]&x11=[NEWS_GNL]&x12=[NEWS]", "https://ichef.bbci.co.uk/news/320/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg", "https://ssc.api.bbc.com/?c1=2&c2=19293874&ns_site=bbc&name=", "https://ichef.bbci.co.uk/news/320/cpsprodpb/144EC/production/_101308138_metoomap-nc.png", "https://ichef.bbci.co.uk/news/320/cpsprodpb/A8AC/production/_101308134_timesupfinal_front-nc.png", "https://ichef.bbci.co.uk/news/320/cpsprodpb/CFBC/production/_101308135_grouptherapy_final-nc.png", "https://ichef.bbci.co.uk/news/320/cpsprodpb/F6CC/production/_101308136_lanyards-nc.png", "https://ichef.bbci.co.uk/news/320/cpsprodpb/11DDC/production/_101308137_metoointhecommunity-nc.png"], "top_img": "https://ichef.bbci.co.uk/news/1024/branded_news/A8AC/production/_101308134_timesupfinal_front-nc.png", "keywords": [], "authors": ["Rebecca Seales", "Bbc News"], "canonical_link": "https://www.bbc.com/news/world-44045291", "title": "What has #MeToo actually changed?", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "The #MeToo movement has shifted Hollywood's power dynamics - but what's changed for the rest of us?", "x-country": "hk", "x-audience": "Asia", "CPS_AUDIENCE": "Asia", "CPS_CHANGEQUEUEID": 153637567, "og": {"title": "What has #MeToo actually changed?", "type": "article", "description": "The #MeToo movement has shifted Hollywood's power dynamics - but what's changed for the rest of us?", "site_name": "BBC News", "locale": "en_GB", "url": "https://www.bbc.com/news/world-44045291", "image": {"identifier": "https://ichef.bbci.co.uk/news/1024/branded_news/A8AC/production/_101308134_timesupfinal_front-nc.png", "alt": "BBC News. A BBC illustration showing a crane dropping the words 'Time's Up' above the Hollywood sign"}}, "article": {"author": "https://www.facebook.com/bbcnews", "section": "World"}, "fb": {"pages": "1143803202301544,317278538359186,1392506827668140,742734325867560,185246968166196,156060587793370,137920769558355,193435954068976,21263239760,156400551056385,929399697073756,154344434967,228735667216,80758950658,260212261199,294662213128,1086451581439054,283348121682053,295830058648,239931389545417,304314573046,310719525611571,647687225371774,1159932557403143,286567251709437,1731770190373618,125309456546,163571453661989,285361880228,512423982152360,238003846549831,176663550714,260967092113,118450564909230,100978706649892,15286229625,122103087870579,120655094632228,102814153147070,124715648647,153132638110668,150467675018739", "app_id": 1609039196070050, "admins": 100004154058350}, "twitter": {"card": "summary_large_image", "site": "@BBCWorld", "title": "What has #MeToo actually changed?", "description": "The #MeToo movement has shifted Hollywood's power dynamics - but what's changed for the rest of us?", "creator": "@BBCWorld", "image": {"src": "https://ichef.bbci.co.uk/news/1024/branded_news/A8AC/production/_101308134_timesupfinal_front-nc.png", "alt": "A BBC illustration showing a crane dropping the words 'Time's Up' above the Hollywood sign"}, "domain": "www.bbc.com"}, "apple-itunes-app": "app-id=364147881, app-argument=https://www.bbc.com/news/world-44045291?utm_medium=banner&utm_content=apple-itunes-app", "apple-mobile-web-app-title": "BBC News", "application-name": "BBC News", "msapplication-TileImage": "BBC News", "msapplication-TileColor": "#bb1919", "mobile-web-app-capable": "yes", "robots": "NOODP,NOYDIR", "theme-color": "#bb1919"}, "movies": [], "publish_date": null, "source": "https://www.bbc.com", "summary": ""}