{"url": "www.newidea.com.au/jennifer-aniston-career-being-sabotaged-by-angelina-jolie", "text": "Getty\n\nIt couldn’t come at a worse time for Jennifer, who is determined to re-establish her position in the industry after a series of flops.\n\nShe’s just started filming the new Netflix movie Murder Mystery set in Montreal, alongside Adam Sandler, and until now hoped the prestigious comedy whoddunit would propel her back into the Hollywood A-list.\n\nBut in an unfortunate twist of fate, her new boss Ted Sarandos is also a very close friend of Angelina’s.\n\nThe United Nations ambassador made her relationships with both Ted and Adam clear back in January when the trio were photographed at the Critics’ Choice Awards looking very happy and close.\n\n‘Jennifer’s heard they’re all still really chummy and it’s making her paranoid,’ adds the source.\n\nCompared to her sitcom heyday, Jennifer’s career has been shaky over the past few years. Her last big release Mother’s Day – in 2016 – was a critical flop, while The Yellow Birds, made by her production company Echo Films, received a lukewarm reception on its release last year.\n\nAlthough much was made of Jennifer buying the film rights to hit Aussie author Liane Moriarty’s What Alice Forgot in 2015, the project hasn’t got much further in development, while Dumplin’, a musical comedy also made by Echo, was filmed last year but still doesn’t have a specific release date or any overseas distribution deals.\n\nRelated: Brad Pitt and Jennifer Aniston's second wedding joy\n\nRelated: Brad Pitt tells: ‘Jen’s a great mum to my kids’\n\nMeanwhile, reports say Jen and Reese Witherspoon’s much hyped Apple TV series about morning television – in which they both star and co-produce – is already in trouble.\n\n‘Jennifer is worried that her days are numbered and that her career is really drying up – she turns 50 next birthday and she’s had box-office flop after box-office flop. She is doing everything she can to make a Friends reunion happen because she knows that will skyrocket her back on speed dial with all the Hollywood bosses and revive her career – but it just doesn’t look like that’s happening any time soon,’ explains the insider.\n\nWhether or not Jennifer’s chance of making a go of things at Netflix is under threat, the embattled star is feeling the heat.\n\n‘Jen is worried she’s running out of options. If someone or something has taken aim at Jen and her career, it might knock her out once and for all.’\n\nFor the full story see this week's issue of New Idea - out now!", "images": ["http://www.newidea.com.au/Branding/newidea/images/brand-logo-gray.svg", "https://snowplow.swm.digital/i?e=se&se_ca=ping&tv=http-get-0.1.0&dtm=0&stm=0&tna=pac&p=web", "http://www.newidea.com.au/media/73139/ni4619_cover_nobc_bws.png?height=158", "http://www.newidea.com.au/Branding/newidea/Images/idm-error-icon.svg", "http://www.newidea.com.au/Branding/newidea/images/gmail.svg", "http://secure-gl.imrworldwide.com/cgi-bin/m?ci=au-pacmags&cg=0&cc=1&ts=noscript", "http://www.newidea.com.au/Branding/NewIdea/images/brand-logo-footer-new.svg", "http://www.newidea.com.au/Branding/newidea/images/idm-thanks-icon.svg", "http://www.newidea.com.au/media/29613/jen-aniston-angelina.jpg", "http://www.newidea.com.au/Branding/NewIdea/images/enhanced-header-logo.svg"], "top_img": "http://www.newidea.com.au/media/29613/jen-aniston-angelina.jpg", "keywords": [], "authors": ["Nikki Black", "Nikki Is Obsessed With All Things Celebrity", "Dreams She Is A Long-Lost Kardashian. You'Ll Find Her Binging Netflix'S Latest 'Must-Watch' Show With A Jar Of Nutella Her Side."], "canonical_link": "https://www.newidea.com.au/jennifer-aniston-career-being-sabotaged-by-angelina-jolie", "title": "Jennifer Aniston's torment: What has Ange done?", "meta_data": {"language": "en-us", "description": "After months of watching Brad Pitt’s ongoing divorce and custody battles with his ex Angelina Jolie, Jennifer Aniston is now convinced she’s next in the firing line.", "news_keywords": "Jennifer Aniston, Brad Pitt, Angelina Jolie, Jen Aniston, Jen and Brad, Jen and Angelina, Brangelina, celebrity gossip, celeb gossip, latest celebrity gossip, celeb goss, latest celeb goss, celebrity news, celeb news, latest celebrity news, Angelina sabotages Jen", "robots": "index, follow", "og": {"site_name": "New Idea", "type": "article", "url": "https://www.newidea.com.au/jennifer-aniston-career-being-sabotaged-by-angelina-jolie", "title": "Jennifer Aniston's torment: What has Ange done?", "description": "After months of watching Brad Pitt’s ongoing divorce and custody battles with his ex Angelina Jolie, Jennifer Aniston is now convinced she’s next in the firing line.", "image": {"identifier": "http://www.newidea.com.au/media/29613/jen-aniston-angelina.jpg", "width": 1500, "height": 800}}, "twitter": {"title": "Jennifer Aniston's career being sabotaged by Angelina Jolie", "description": "After months of watching Brad Pitt’s ongoing divorce and custody battles with his ex Angelina Jolie, Jennifer Aniston is now convinced she’s next in the firing line.", "image": "http://www.newidea.com.au/media/29613/jen-aniston-angelina.jpg", "url": "https://www.newidea.com.au/jennifer-aniston-career-being-sabotaged-by-angelina-jolie"}, "fb": {"admins": 863618607005758, "pages": 140279489324860}, "msvalidate.01": "3BD3CB44DC500E9821E82E085D0F0D13", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": 1530486541.737, "source": "http://www.newidea.com.au", "summary": ""}