{"url": "https://popculture.com/reality-tv/2018/02/02/mama-june-from-not-to-hot-pumpkin-fiance-josh-efird/", "text": "Mama June is dishing out tough love to daughter Lauryn “Pumpkin” Shannon and her fiance Josh Efird.\n\nIn a clip from Friday’s episode of Mama June: From Not to Hot, the 38-year-old matriarch “trash talks” her future son-in-law to boyfriend Geno soon after Pumpkin, 17, revealed she was pregnant. Watch the clip on E! here.\n\n\n\n“Josh gets on my ever-loving last f—ing d— nerve,” June vented to Geno. “I told him he needs to get a better job if he’s going to support my grandchild. Every time he thinks that I let my guard down, I’ll be right behind him saying, ‘Boom motherf—er.’ ”\n\nPumpkin and Efird, 19, welcomed their first child, daughter Ella Grace Efird, in December. But before the baby arrived, June shared concerned that her daughter would face the same struggles she did as a teen mom.\n\n“Pumpkin knows that ain’t none of my babies’ daddies stuck around,” she said. “But I don’t want the same thing to happen to her. She is 17, still in high school, supposed to be graduating this year and now she’s having a child.”\n\nWhile June admittedly feuds with Efird as a means of protecting her daughter, she has also pushed Josh to find a better job to offer more financial stability.\n\n“Pumpkin doesn’t understand bills. Like, she’s always coming [to me saying]. ‘Hey, I need $100. Hey I need gas,’ ” June told her boyfriend. “But if Josh thinks I’m always gonna be him and Pumpkin’s safety net, they got another d— thing coming.”\n\n\n\nGeno attempted to smooth over June’s concerns, but the mom insisted the teens were in for “big wakeup calls.”\n\n\"Pumpkin, I'm always going to be there for her,\" she said, \"but Josh, he needs to shape up or ship out.\"\n\nIn a solo interview, Geno remained optimistic that June and Efird would patch up their relationship once the baby was born — on one condition.\n\n“June and Josh get along about as well as, I’d say, maybe Sugar Bear and toothpaste,\" he said, referencing June's ex-husband Mike \"Sugar Bear\" Thompson. \"But it will be better once the baby comes, as long as it don’t look like Josh.”\n\nMama June: From Not to Hot airs Fridays at 9 p.m. on WE tv.", "images": ["https://media.popculture.com/2017/05/default-1.png"], "top_img": "https://media.popculture.com/2017/05/default-1.png", "keywords": [], "authors": [], "canonical_link": "https://popculture.com/reality-tv/2018/02/02/mama-june-from-not-to-hot-pumpkin-fiance-josh-efird/", "title": "Mama June Trash Talks Daughter Pumpkin's Fiance", "meta_data": {"description": "Mama June is dishing out tough love to daughter Lauryn “Pumpkin” Shannon and her fiance Josh Efird.In a clip from Friday’s episode of Mama June: From Not to Hot, the 38-year-old matriarch “trash talks” her future son-in-law to boyfriend Geno soon after Pumpkin, 17, revealed she was [...]", "keywords": "Mama June Shannon,Reality TV (genre)", "news_keywords": "Mama June Shannon,Reality TV (genre)", "twitter": {"card": "summary", "site": "@PopCulture", "creator": "@PopCulture", "title": "Mama June Trash Talks Daughter Pumpkin's Fiance", "description": "Mama June is dishing out tough love to daughter Lauryn “Pumpkin” Shannon and her fiance Josh [...]", "image": "https://media.popculture.com/2017/05/default-1.png"}, "og": {"title": "Mama June Trash Talks Daughter Pumpkin's Fiance", "type": "article", "url": "https://popculture.com/reality-tv/2018/02/02/mama-june-from-not-to-hot-pumpkin-fiance-josh-efird/", "image": {"identifier": "https://media.popculture.com/2017/05/default-1.png", "width": 640, "height": 320}, "site_name": "Reality TV", "description": "Mama June is dishing out tough love to daughter Lauryn “Pumpkin” Shannon and her fiance Josh [...]"}, "fb": {"app_id": 398373180287205, "pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1517500800.0, "source": "https://popculture.com", "summary": ""}