{"url": "https://www.washingtonpost.com/lifestyle/style/tavis-smiley-sues-pbs-for-firing-him-over-sexual-misconduct-allegations/2018/02/20/abff1206-165f-11e8-8b08-027a6ccb38eb_story.html", "text": "The public television network, based in Arlington, Va., dropped Smiley’s late-night interview program, “Tavis Smiley,” in December over what it said were “multiple, credible allegations” of workplace misconduct by the host. It did not spell out the accusations, but news reports said Smiley allegedly had sexual relationships with employees of his company, TS Media, and that some feared their jobs were in jeopardy if they refused.\n\nAD\n\nAD\n\nSmiley has repeatedly said PBS never presented him with the names of his accusers, specific allegations, or details of an investigation into his workplace relationships that led up to his dismissal. He has vigorously defended himself in media interviews, and even staged a five-city tour last month in which he led panel discussions about workplace harassment.\n\n“I’ve spent the bulk of my career in public media, so filing a lawsuit against PBS was the last thing I wanted to do,” he said in an interview Tuesday. “But litigation seems to be the only way to get at the truth.”\n\nIn a statement, Jennifer Rankin Byrne, PBS’s vice president for corporate communications, called the lawsuit “meritless” and an attempt by Smiley “to distract the public from his pattern of sexual misconduct in the workplace.”\n\nAD\n\nAD\n\nPBS, she wrote, took action against Smiley after a complaint prompted the network to hire an independent law firm to conduct an investigation, which included a “lengthy interview with Mr. Smiley.” The investigation “revealed that he had multiple sexual encounters with subordinates over many years and yielded credible allegations of additional misconduct inconsistent with the values and standards of PBS.”\n\nPBS had distributed “Tavis Smiley” for 14 years. It signed a new contract with Smiley’s Los Angeles-based production company in November, coincidentally just as the “Me Too” movement against workplace harassment was beginning to crest.\n\nSmiley has acknowledged that he had romantic relationships with colleagues over his 30-year career as a speaker, TV host and author, but that these were always consensual. In his suit, filed in D.C.’s Superior Court, he claims that PBS used “trumped up” accusations to drop distribution of his program after years of infighting over the program’s funding, promotion and content.\n\nAD\n\nAD\n\nHis suit also asserts that some of the “tension” between PBS and Smiley, who is African American, was racial in nature.\n\nPBS “has presented complaints and hassled Mr. Smiley when he had African American guests who espoused controversial positions, and effectively tried to stop any such guests from appearing,” his complaint says. “By contrast, PBS never raised editorial issues or hassled Mr. Smiley when he had white guests who espoused equally controversial positions (if not even more controversial).”\n\nThe suit didn’t specify a request for damages but said his company has lost “multiple millions of dollars” as result of his termination, and has laid off about 20 employees.\n\nAD\n\nSmiley was one of several public-broadcasting figures who’ve been forced out by harassment complaints. Others include talk host Charlie Rose, NPR news chief Michael Oreskes and “Prairie Home Companion” creator Garrison Keillor.", "images": ["https://www.washingtonpost.com/resizer/JErSjkyNZkdzKdk6pnVc533s7j8=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/Z7BCQ3AHPYI6RKTB6M4RG44GPY.jpg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/Z7BCQ3AHPYI6RKTB6M4RG44GPY.jpg&w=150", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://s3.amazonaws.com/arc-authors/washpost/60fc02ec-003b-4d54-8e13-33765d6c186b.png&w=90&h=90"], "top_img": "https://www.washingtonpost.com/resizer/JErSjkyNZkdzKdk6pnVc533s7j8=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/Z7BCQ3AHPYI6RKTB6M4RG44GPY.jpg", "keywords": [], "authors": ["Paul Farhi", "Media Reporter"], "canonical_link": "https://www.washingtonpost.com/lifestyle/style/tavis-smiley-sues-pbs-for-firing-him-over-sexual-misconduct-allegations/2018/02/20/abff1206-165f-11e8-8b08-027a6ccb38eb_story.html", "title": "Tavis Smiley sues PBS for firing him over sexual misconduct allegations", "meta_data": {"description": "The former TV host has emerged as the rare public figure to challenge harassment claims against him.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/lifestyle/style/tavis-smiley-sues-pbs-for-firing-him-over-sexual-misconduct-allegations/2018/02/20/abff1206-165f-11e8-8b08-027a6ccb38eb_story.html", "image": "https://www.washingtonpost.com/resizer/JErSjkyNZkdzKdk6pnVc533s7j8=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/Z7BCQ3AHPYI6RKTB6M4RG44GPY.jpg", "title": "Tavis Smiley sues PBS for firing him over sexual misconduct allegations", "description": "The former TV host has emerged as the rare public figure to challenge harassment claims against him."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Tavis Smiley sues PBS for firing him over sexual misconduct allegations", "description": "The former TV host has emerged as the rare public figure to challenge harassment claims against him."}, "last_updated_date": "2018-02-21T00:41:34.863Z", "article": {"content_tier": "metered", "opinion": "false"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1519056000.0, "source": "https://www.washingtonpost.com", "summary": ""}