{"url": "https://www.self.com/story/brie-bella-milk-production-breastfeeding", "text": "Brie Bella, WWE wrestler and star of both Total Divas and Total Bellas, shared last year that she produced more breast milk than she needed after having her daughter, Birdie—so much so, that she donated her extra milk to help babies at her local hospital. But now, Bella revealed that she eventually struggled to produce as much milk as she used to.\n\n“My breast milk’s taken a huge dip,” she said at a breastfeeding support group, as seen in a sneak peek from Wednesday’s episode of Total Divas.\n\n“I used to have enough where I donate. And now I’ve realized in the last month that I can’t even keep up with her during the day so I’ve had to introduce one bottle of formula a day,\" she continued. \"I’m trying to pump and do all this stuff, but it’s the stress—I hate pumping, to the point it makes me feel bad when I’m doing it because I’m so miserable.”\n\nBella also said in the clip that she struggled with “mom guilt” over her milk production, adding that it’s “the worst feeling in the world.”\n\n“I thought pumping could balance Birdie and my job but it’s not working,” she said. “It’s weird how you just constantly feel like you’re failing.”\n\nYour breast milk usually works on a \"supply and demand\" schedule. So if there's less demand, the supply will go down as well.\n\nFor instance, \"if the baby starts sleeping through the night or if mom is back to work and not breastfeeding or pumping as much as she was, milk supply can drop,\" Diane L. Spatz, Ph.D., a professor of perinatal nursing at the University of Pennsylvania and nurse researcher at The Children’s Hospital of Philadelphia, tells SELF.\n\nOr, “if the baby drinks less milk, or formula is introduced instead of breast milk, the supply can dwindle,” Joan Younger Meek, M.D., R.D., chairwoman of the American Academy of Pediatrics Section on Breastfeeding and associate dean for Graduate Medical Education at Florida State University College of Medicine, tells SELF.\n\nCertain medications, like hormonal birth control, can also affect your milk supply, as can fatigue or stress, Joanne Goldbort, Ph.D., R.N., a breastfeeding researcher and assistant professor in the College of Nursing at Michigan State University, tells SELF. And if you get your period when you're nursing, you may also see a drop in your milk supply during that time, Spatz says.\n\nBabies can also go through growth spurts when they want to nurse more, and it can seem like you’re not producing as much when your baby feeds, but your body may simply be adjusting your milk supply to try to meet your baby’s needs, Dr. Meek says.\n\nOn the flip side, if the demand can't keep up with the supply, you'll eventually produce less milk.\n\nFor instance, some people might get a little “pump happy,” overstimulate their breasts, and create a safety net of excess milk, Leigh Anne O'Connor, IBCLC, a La Leche League Leader, tells SELF. That sounds great, but it can actually mess with your milk production in the long run. They may use that stored milk to feed their baby and not realize that they also still need to continue pumping and stimulating the breasts to keep up milk production, she explains.\n\nAnd if you have an oversupply, the milk may also flow so easily that your baby doesn’t really need to suck hard to get to your milk, O’Connor says. “Over time, the baby who has been riding the wave of oversupply does not stimulate the breasts, and this lack of stimulation will send a signal to the breasts to slow down milk production,” she explains.\n\nIf you’re having any difficulties with your milk supply, it’s a good idea to talk to your child’s pediatrician as well as a breastfeeding expert.\n\nEven if you think you're not producing enough milk, it's important to have your child’s pediatrician help you gauge how your baby is growing to see whether or not they’re actually getting the milk they need, Dr. Meek says.", "images": ["https://www.self.com/verso/static/self/assets/logo-reverse.22fddcfca2f2de42711a84ec66a5157a9995d8ab.svg", "https://media.self.com/photos/5bbd0119564c7a0409065f20/2:1/w_1280,c_limit/GettyImages-1032623628.jpg", "https://media.self.com/photos/5bbd0119564c7a0409065f20/4:3/w_2560%2Cc_limit/GettyImages-1032623628.jpg", "https://www.self.com/verso/static/self/assets/logo-header.64f3bdc15b1f321829f9f30c7853a1469f469d71.svg", "https://media.self.com/photos/5b881cac9134316166c7782c/1:1/w_90%2Cc_limit/headshot_korin.jpg"], "top_img": "https://media.self.com/photos/5bbd0119564c7a0409065f20/2:1/w_1280,c_limit/GettyImages-1032623628.jpg", "keywords": [], "authors": ["Korin Miller", "Korin Mille"], "canonical_link": "https://www.self.com/story/brie-bella-milk-production-breastfeeding", "title": "'Total Divas' Star Brie Bella's Milk Production Took 'a Huge Dip' While Breastfeeding Her Daughter", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=yes, width=device-width, initial-scale=1, maximum-scale=2", "author": "Korin Miller", "copyright": "Copyright (c) Condé Nast 2020", "description": "WWE wrestler and \"Total Divas\" star Brie Bella explained in an upcoming episode that her milk supply dropped, which gave her \"mom guilt.\"", "id": "5bbce5473f15b979ec036a5c", "keywords": "pregnancy & motherhood,breastfeeding,news", "news_keywords": "pregnancy & motherhood,breastfeeding,news", "robots": "index, follow", "content-type": "article", "parsely-post-id": "5bbce5473f15b979ec036a5c", "parsely-metadata": "{\"description\":\"WWE wrestler and \\\"Total Divas\\\" star Brie Bella explained in an upcoming episode that her milk supply dropped, which gave her \\\"mom guilt.\\\"\",\"image-16-9\":\"https://media.self.com/photos/5bbd0119564c7a0409065f20/16:9/w_1000,c_limit/GettyImages-1032623628.jpg\",\"image-1-1\":\"https://media.self.com/photos/5bbd0119564c7a0409065f20/1:1/w_1000,c_limit/GettyImages-1032623628.jpg\"}", "og": {"description": "The experience gave her \"mom guilt.\"", "image": "https://media.self.com/photos/5bbd0119564c7a0409065f20/2:1/w_1280,c_limit/GettyImages-1032623628.jpg", "site_name": "SELF", "title": "'Total Divas' Star Brie Bella's Milk Production Took 'a Huge Dip' While Breastfeeding Her Daughter", "type": "article", "url": "https://www.self.com/story/brie-bella-milk-production-breastfeeding"}, "article": {"content_tier": "free", "opinion": "false"}, "twitter": {"card": "summary_large_image", "creator": "@SELFmagazine", "description": "The experience gave her \"mom guilt.\"", "domain": "https://www.self.com", "image": {"src": "https://media.self.com/photos/5bbd0119564c7a0409065f20/2:1/w_1280,c_limit/GettyImages-1032623628.jpg?mbid=social_retweet"}, "site": "@SELFmagazine", "title": "'Total Divas' Star Brie Bella's Milk Production Took 'a Huge Dip' While Breastfeeding Her Daughter"}, "fb": {"app_id": 169640983205651, "pages": 8908243810}}, "movies": [], "publish_date": null, "source": "https://www.self.com", "summary": ""}