{"url": "https://web.archive.org/web/20181011205228/https://www.forbes.com/sites/garysuarez/2018/10/11/drake-bad-bunny-mia/", "text": "After months of suspense, the Bad Bunny and Drake collaboration has finally arrived.\n\nPresumably taken from the Puerto Rican trap sensation's imminently expected and highly anticipated full-length debut La Nueva Religión, \"MIA\" teams him with the Canadian hip-hop superstar, something teased on social media as far back as this past January. A co-release through OVO Sound and Rimas Entertainment, two imprints affiliated with Warner Bros., the dembow-driven pop single notably showcases both artists performing entirely in Spanish.\n\nLatin music lovers and Drizzy stans alike will recall this isn't the first time that Drake has featured en español on a Spanish-language act's single. In 2013, he appeared on bachata star Romeo Santos' \"Odio,\" which led to the former Aventura member's highest ever showing the following year on the Hot 100, a No. 45 peak.\n\nAs indicated by Drake's recent Billboard charting collaborations with Blocboy JB and Lil Baby, the potential for \"MIA\" to perform strongly on the Hot 100 seems certain. Furthermore, Bad Bunny's appeal right now is arguably stronger than its ever been. He's still riding the wave of his crossover smash \"I Like It,\" the multi-platinum and Hot 100 chart-topping Cardi B hit that also boasts a guest appearance by J Balvin. He also logged 3 other Hot 100 placements in the last 12 months, including a No. 35 peak for his prominent feature on the remix of Nio Garcia, Casper Magico and Darell's \"Te Boté.\"\n\nPrimarily a singles artist at this stage in his career, Bad Bunny has been a mainstay of Billboard's Latin charts, with 32 appearances as a lead or featured artist on Hot Latin Songs from 2017 onwards. On his own, he's previously peaked at No. 9 with this year's \"Estamos Bien,\" followed by \"Amorfoda\" at No. 10. As for collaborations, he's scored big there with Becky G's \"Mayores\" (N0. 3 peak) and Karol G's \"Ahora Me Llama\" (No. 10 peak), among others. Additionally, the aforementioned \"Te Boté\" remix claimed the top slot there 14 times during its still ongoing 24 week run.\n\nWith that in mind, the likelihood of \"MIA\" topping Hot Latin Songs is all but assured, provided it bests current No. 1 position holder DJ Snake's \"Taki Taki,\" which features Cardi B, Selena Gomez and Ozuna, though that may not occur in its debut frame. Admittedly, \"Taki Taki\" has the advantage in the current week in that it has a 5 day lead over \"MIA.\" However, once that resets on Friday, the following frame could handily belong to Bad Bunny and Drake. Still, there's always a chance, albeit unlikely, that \"MIA\" could prevail with only two qualifying charting days.\n\n\"MIA\" serves as Bad Bunny's latest single with crossover promise, coming barely two weeks after \"Está Rico,\" a collaborative one-off with comparatively more seasoned artists Marc Anthony and Will Smith. While the track scarcely missed the Hot 100 in its opening frame, it did debut at No. 5 on Hot Latin Songs and at No. 4 on Bubbling Under Hot 100.\n\nBad Bunny has also proven one of 2018's most lucrative touring acts, generating more than $16 million in revenue as of a month ago off the two legs of his La Nueva Religión dates in North America. Many of those arena shows proved sold out dates, another indicator of his commercial prospects leading up to the album's release.\n\nWith the listening public's seemingly insatiable appetite for new Drake music and taking into account Bad Bunny's burgeoning fanbase, \"MIA\" could translate to a major hit. Ever since \"Despacito\" took hold of American ears last year, the Hot 100 has repeatedly housed a handful of Spanish-language or Spanglish singles, not the least of which being \"I Like It.\" While the bar has gotten considerably higher in the aftermath of both of those songs, online performance alone could make \"MIA\" a contender. If radio rotation beyond urban Latin stations factors into the song's promotion plans, another Top 10 placement for Bad Bunny may be here before the year is through.", "images": ["https://web.archive.org/web/20181011205228im_/https://secure.gravatar.com/avatar/6adceeaab0e01313c9d19b89a62c3ef7?s=400&d=mm&r=g", "https://web.archive.org/web/20181011205228im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fgarysuarez%2Ffiles%2F2018%2F10%2F6A1A9437-1200x800.jpg"], "top_img": "https://web.archive.org/web/20181011205228im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fgarysuarez%2Ffiles%2F2018%2F10%2F6A1A9437-1200x800.jpg", "keywords": [], "authors": ["Gary Suarez", "I Am A Freelance Writer", "Music Critic", "Content Creator", "Marketing Professional Born", "Raised In New York City. In Addition To Forbes", "My Work On Music", "Entertainment", "Popular Culture Has Appeared In Various Outlets Including Backstage", "Billboard"], "canonical_link": "https://web.archive.org/web/20181011205228/https://www.forbes.com/sites/garysuarez/2018/10/11/drake-bad-bunny-mia/", "title": "Drake And Bad Bunny Unleash A Potential Crossover Smash", "meta_data": {"viewport": "width=device-width,initial-scale=1", "apple-itunes-app": "app-id=588647136", "fb": {"app_id": 123694841080850}, "og": {"site_name": "Forbes", "title": "Drake And Bad Bunny Unleash A Potential Crossover Smash", "image": "https://web.archive.org/web/20181011205228im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fgarysuarez%2Ffiles%2F2018%2F10%2F6A1A9437-1200x800.jpg", "updated_time": "2018-10-11T15:53:33-04:00", "url": "https://web.archive.org/web/20181011205228/https://www.forbes.com/sites/garysuarez/2018/10/11/drake-bad-bunny-mia/", "description": "After months of suspense, their long teased collaboration finally arrives--and it's entirely in Spanish.", "type": "article"}, "twitter": {"site": "@forbes", "card": "summary_large_image", "title": "Drake And Bad Bunny Unleash A Potential Crossover Smash", "description": "After months of suspense, their long teased collaboration finally arrives--and it's entirely in Spanish.", "image": "https://web.archive.org/web/20181011205228im_/https://thumbor.forbes.com/thumbor/600x300/https%3A%2F%2Fblogs-images.forbes.com%2Fgarysuarez%2Ffiles%2F2018%2F10%2F6A1A9437-1200x800.jpg", "creator": "@garysuarez"}, "description": "After months of suspense, their long teased collaboration finally arrives--and it's entirely in Spanish.", "author": "Gary Suarez", "article": {"publisher": "https://www.facebook.com/forbes", "author": "Gary Suarez", "section": "Consumer", "section_url": "https://www.forbes.com/hollywood-entertainment//", "id": "blogAndPostId/blog/post/3878-2253", "published": "2018-10-11", "modified": "2018-10-11"}}, "movies": [], "publish_date": 1539187200.0, "source": "https://web.archive.org", "summary": ""}