{"url": "https://www.independent.co.uk/news/people/june-steenkamp-oscar-pistorius-terrorised-my-daughter-reeva-before-he-shot-her-dead-9877958.html", "text": "The mother of Reeva Steenkamp - who was shot dead by her paralympian boyfriend Oscar Pistorius - said that he terrorised her daughter during the controlling relationship.\n\nJune Steenkamp, speaking to the BBC World Service, said that Pistorius treated Reeva like \"his arm candy\" and tried to dictate what she wore, how she behaved and how she spoke prior to killing her on Valentine's Day in 2013.\n\nSteenkamp described the time when Reeva, 29, called her during their three-month relationship to say that Pistorius was driving dangerously at 161mph with her in the car.\n\nDownload the new Independent Premium app Sharing the full story, not just the headlines\n\nShe said: \"One day she phoned me and said, 'Mummy, Oscar's driving like a lunatic.' And I said, 'Well, you just put him on the phone.'\n\n\"And I said to him, 'if you hurt my baby, I will have you wiped out' - just trying to scare him. And apparently he slowed down straightaway.\"\n\nPistorius, a double-amputee Olympic sprinter, was convicted of culpable homicide on 12 September for which he received a maximum prison sentence of five years, with the possibility of serving the rest under correctional supervision after 10 months.\n\nSteenkamp said about sitting near him in the trial: \"That was scary. Because he was the one who killed her, and he hurt her and he terrorised her.\n\n\"We all love our children and we adored Reeva. And to sit next to the person who killed her - and she didn't do anything and she had no protection - horrible.\"\n\nPistorius, 28, pleaded not guilty to murder and said that he mistook Reeva for an intruder in his bathroom before he shot four times through the door, with three bullets hitting his girlfriend.\n\nSteenkamp, whose book Reeva: A Mother's Story is out in the UK, also said that her only child Reeva kept quiet about their relationship at the beginning as \"she wasn't sure if they were compatible\" and she told her mother that she could not understand why they were fighting so early on.\n\nDaily coronavirus briefing No hype, just the advice and analysis you need Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nShe said: \"She didn't tell me about Oscar - the first time I saw them together was on the red carpet at a sports award. And I thought: \"Now, who is this man?\" Because I'd never heard of him.\"\n\nShape Created with Sketch. In pictures: June Steenkamp's 'court hell' Show all 20 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. In pictures: June Steenkamp's 'court hell' 1/20 June Steenkamp in court June Steenkamp listens to the testimony of Oscar Pistorius during his ongoing murder trial in Pretoria 2/20 June Steenkamp in court June Steenkamp looks on during the murder trial of Oscar Pistorius at the high court in Pretoria 3/20 June Steenkamp in court June Steenkamp (2nd L), Reeva Steenkamp's mother listens to Oscar Pistorius' testimony in the Pretoria High Court in Pretoria 4/20 June Steenkamp in court June Steenkamp, mother of Reeva, is comforted by unidentified relative after her dead daughter's picture was shown on screen during the trial of Oscar Pistorius at the North Gauteng High Court in Pretoria 5/20 June Steenkamp in court June Steenkamp hides her face as she listens to Oscar Pistorius' testimony in the Pretoria High Court 6/20 June Steenkamp in court June Steenkamp, mother of the late Reeva Steenkamp listens to evidence by a pathologist during the murder trial of Oscar Pistorius in court in Pretoria 7/20 June Steenkamp in court June Steenkamp attends the trial on Souh African paralympian Oscar Pistorius before his murder trial was postponed at the high court in Pretoria 8/20 Gina Myers in court Gina Myers, Reeva Steenkamp's best friend, is overcome with emotion as she listens to Oscar Pistorius' testimony in the Pretoria High Court 9/20 Relatives of Reeva Steenkamp in court Relatives and friends of Reeva Steenkamp, Gina Meyers (C) and her mother Desiree (R) attend a hearing of Oscar Pistorius on the sixth day of his trial 10/20 June Steenkamp in court Reeva Steenkamp's mother looks on inside the Pretoria High Court 11/20 June Steenkamp in court June Steenkamp (L), mother of the murdered Reeva Steenkamp, sits in court ahead of the trial of Olympic and Paralympic track star Oscar Pistorius at the North Gauteng High Court in Pretoria 12/20 June Steenkamp in court June Steenkamp reacts as she awaits start of the first day of proceedings in court 13/20 June Steenkamp arrives in court June Steenkamp (C), the mother of Reeva Steenkamp, arrives at North Gauteng High Court for the trial of Oscar Pistorius in Pretoria 14/20 June Steenkamp arrives in court June Steenkamp (R), the mother of Reeva Steenkamp, arrives at North Gauteng High Court for the trial of Oscar Pistorius in Pretoria 15/20 Daily News front page day after the shooting Oscar Pistorius was arrested in South Africa in the shooting of Reeva Steenkamp 16/20 Reeva Steenkamp Reeva Steenkamp in a publicity shot for Tropika Island of Treasure AP 17/20 Reeva Steenkamp Reeva Steenkamp cooks Getty Images 18/20 Reeva Steenkamp The model was shot four times by Oscar Pistorius AP 19/20 Reeva Steenkamp Reeva Steenkamp, girlfriend of Oscar Pistorius GETTY IMAGES 20/20 Reeva Steenkamp Reeva Steenkamp who was shot dead on the Valentine's Day 2013 1/20 June Steenkamp in court June Steenkamp listens to the testimony of Oscar Pistorius during his ongoing murder trial in Pretoria 2/20 June Steenkamp in court June Steenkamp looks on during the murder trial of Oscar Pistorius at the high court in Pretoria 3/20 June Steenkamp in court June Steenkamp (2nd L), Reeva Steenkamp's mother listens to Oscar Pistorius' testimony in the Pretoria High Court in Pretoria 4/20 June Steenkamp in court June Steenkamp, mother of Reeva, is comforted by unidentified relative after her dead daughter's picture was shown on screen during the trial of Oscar Pistorius at the North Gauteng High Court in Pretoria 5/20 June Steenkamp in court June Steenkamp hides her face as she listens to Oscar Pistorius' testimony in the Pretoria High Court 6/20 June Steenkamp in court June Steenkamp, mother of the late Reeva Steenkamp listens to evidence by a pathologist during the murder trial of Oscar Pistorius in court in Pretoria 7/20 June Steenkamp in court June Steenkamp attends the trial on Souh African paralympian Oscar Pistorius before his murder trial was postponed at the high court in Pretoria 8/20 Gina Myers in court Gina Myers, Reeva Steenkamp's best friend, is overcome with emotion as she listens to Oscar Pistorius' testimony in the Pretoria High Court 9/20 Relatives of Reeva Steenkamp in court Relatives and friends of Reeva Steenkamp, Gina Meyers (C) and her mother Desiree (R) attend a hearing of Oscar Pistorius on the sixth day of his trial 10/20 June Steenkamp in court Reeva Steenkamp's mother looks on inside the Pretoria High Court 11/20 June Steenkamp in court June Steenkamp (L), mother of the murdered Reeva Steenkamp, sits in court ahead of the trial of Olympic and Paralympic track star Oscar Pistorius at the North Gauteng High Court in Pretoria 12/20 June Steenkamp in court June Steenkamp reacts as she awaits start of the first day of proceedings in court 13/20 June Steenkamp arrives in court June Steenkamp (C), the mother of Reeva Steenkamp, arrives at North Gauteng High Court for the trial of Oscar Pistorius in Pretoria 14/20 June Steenkamp arrives in court June Steenkamp (R), the mother of Reeva Steenkamp, arrives at North Gauteng High Court for the trial of Oscar Pistorius in Pretoria 15/20 Daily News front page day after the shooting Oscar Pistorius was arrested in South Africa in the shooting of Reeva Steenkamp 16/20 Reeva Steenkamp Reeva Steenkamp in a publicity shot for Tropika Island of Treasure AP 17/20 Reeva Steenkamp Reeva Steenkamp cooks Getty Images 18/20 Reeva Steenkamp The model was shot four times by Oscar Pistorius AP 19/20 Reeva Steenkamp Reeva Steenkamp, girlfriend of Oscar Pistorius GETTY IMAGES 20/20 Reeva Steenkamp Reeva Steenkamp who was shot dead on the Valentine's Day 2013\n\nReeva moved from her parents' home in Port Elizabeth aged 22 to the bigger and more dangerous South African city of Johannesburg to continue a successful career in modelling - which she had done since the age of 14 - after graduating with a law degree and working as a paralegal.\n\nAlso a reality television star, Reeva was due to be shown in Tropika Island of Treasure two days after she was shot by Pistorius. Her parents gave SABC 1 permission to air the show.\n\nSteenkamp said: \"I said I would just love to see her alive, happy and laughing. Lots of people couldn't understand that but to me it was like bringing her back, seeing her laughing and enjoying herself.\"", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2014/02/11/16/v2-pistorius-31.jpg", "https://trc.taboola.com/1036135/log/3/unip?en=page_view"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2014/02/11/16/v2-pistorius-31.jpg", "keywords": [], "authors": ["Lamiat Sabin"], "canonical_link": "https://www.independent.co.uk/news/people/june-steenkamp-oscar-pistorius-terrorised-my-daughter-reeva-before-he-shot-her-dead-9877958.html", "title": "Oscar Pistorius terrorised Reeva before he shot her dead, says June Steenkamp", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#db3739", "og": {"url": "http://www.independent.co.uk/news/people/june-steenkamp-oscar-pistorius-terrorised-my-daughter-reeva-before-he-shot-her-dead-9877958.html", "title": "June Steenkamp: 'Pistorius terrorised my daughter before he shot her", "description": "Reeva and Oscar were together for three months before he shot her dead", "updated_time": "2014-11-24T06:32:54+00:00", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2014/02/11/16/v2-pistorius-31.jpg", "site_name": "The Independent", "type": "article", "locale": "en_GB"}, "description": "The mother of Reeva Steenkamp - who was shot dead by her paralympian boyfriend Oscar Pistorius - said that he terrorised her daughter during the controlling relationship.", "keywords": ", People, News", "fb": {"pages": 13312631635, "admins": 729735830, "app_id": 235586169789578}, "article": {"published_time": "2014-11-23T09:49:59+00:00", "modified_time": "2014-11-24T06:32:54+00:00", "section": "People", "subsection": "Frontpage, News", "author_name": "Lamiat Sabin", "content_type": "story", "word_count": 527, "image_count": 1, "video_count": 0, "embed_count": 0, "internal_link_count": 4, "external_link_count": 1}, "twitter": {"description": "The mother of Reeva Steenkamp - who was shot dead by her paralympian boyfriend Oscar Pistorius - said that he terrorised her daughter during the controlling relationship.", "card": "summary_large_image", "site": "@independent"}, "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Independent"}, "movies": [], "publish_date": 1416736199.0, "source": "https://www.independent.co.uk", "summary": ""}