{"url": "https://web.archive.org/web/20170419231222/http://www.vanityfair.com:80/hollywood/2017/04/feud-bette-davis-joan-crawford-hush-hush-sweet-charlotte-oscars", "text": "By now, Feud audiences are well acquainted with two of the most notorious chapters in Bette Davis and Joan Crawford’s shared Hollywood history—their rivalry during the making of What Ever Happened to Baby Jane?, and the ugly Oscars aftermath—in which Crawford found a way to hijack what Davis thought should have been her best-actress statuette. But a lesser-known Davis-Crawford battle followed—on the set of another Bob Aldrich–directed psycho-thriller, *Hush. . . Hush, Sweet Charlotte.” And on Sunday night’s episode of Feud, “Abandoned,” Ryan Murphy revealed how Davis masterminded her own sadistic revenge on her once-again co-star.\n\nUnderstandably, the actresses were reluctant to re-team given their history. Before signing onto the film, Crawford demanded her name be billed first; to get Davis on board, Aldrich made a series of sizable concessions including a $200,000 paycheck—the same fee Aldrich was receiving—and his word that Davis would be an associate producer on the picture. However, during pre-production, Davis felt Aldrich was ignoring her input and fired off a firmly worded eight-page letter threatening to quit.\n\n“You do not function well with someone of my type,” Davis wrote Aldrich, according to Shaun Considine’s Bette and Joan: The Divine Feud—an absolute must-read for fans of the FX series. “That was obvious throughout the filming of Baby Jane—and the suicidal desire this put me into many times, was almost more than I was able to bear. . . I do not wear well with tricks designed to make me do what someone else decides I will do.”\n\nShe ended by suggesting Aldrich “re-cast and pay me off. It will be cheaper in the long run.”\n\nThis maneuver explains how Davis found herself sitting at Aldrich’s side throughout filming, why Aldrich obliged Davis’s creative input, and how Davis secured the leverage to properly torture Crawford.\n\nAlthough certain moments in “Abandoned” feel exaggerated for dramatic effect—like Crawford being made to wait for her hotel room, and then being stuck in a room next to the garbage disposal—the episode’s writers actually skimped on the insane details of what actually happened.\n\nFor example, according to Shaun Considine’s Bette and Joan: The Divine Feud, Crawford arrived at the Baton Rouge airport with a full entourage—including her hairdresser, makeup artist, and enough baggage to . . . well, let Davis explain:\n\n“For a goddamn week in Baton Rouge, she brought twenty pieces of luggage. It was a black-and-white movie but she had color-coordinated outfits for the daytime scenes, and for the night shots all of her evening dresses were chiffon, which meant that the wardrobe lady had to spend hours ironing them in the one-hundred-degree weather.”\n\nWhen Crawford arrived to set the fourth day of filming, Davis had already tactically befriended the local press and crew—the latter of whom she would eat lunch with. George Cukor later reflected on Davis’s stone-cold set strategy: “She wanted to make a basket case out of Joan, and she almost succeeded.”\n\nTo further chip away at Crawford’s ego, Davis also coordinated group outings, cast and crew dinners, and other after-hours activities, inviting everyone except Joan. “Davis [also] made sure that everyone, including members of the press and distinguished visitors to the set, knew that Joan was really 60 years old,” authors Lawrence J. Quirk and William Schoell write in Joan Crawford: The Essential Biography, before revealing another Davis tactic. “She would also stand next to director Aldrich while he was filming Joan’s scenes and make loud, negative comments.”\n\nWhen Crawford woke up from a nap on set one day to discover that the entire production had left the location without her, “Joan was convinced that Davis was behind it, and furthermore that Davis was manipulating Aldrich behind the scenes,” wrote Quirk and Schoell. “‘She’s practically directing the picture for him right in front of me,’” she complained. “‘So God knows what else she’s up to behind my back. I might wind up on the cutting-room floor.’”\n\nFeeling ostracized, Crawford retreated further from the group—spending the majority of her time either avoiding the heat (and crew) in her trailer, or enforcing her compulsive routine on her entourage members including makeup artist Monte Westmore.\n\n“I’d wake her up at six,” Westmore told Considine of his time with Crawford in Baton Rouge. “She’d exercise a little bit while I set out her makeup. Then she’d make breakfast, which I had to eat.” Crawford applied her makeup herself, and tasked Westmore with the enormous task of finding the perfect false eyelashes. “They always had to be just right,” explained Westmore. “Trimmed perfectly in line, then curled in a circle. I would layout six pair for her on the table. She would then inspect them. . . We went through a gross and a half of eyelashes per picture.”\n\nDavis’s makeup artist, Bob Schiffer, concurred—adding that Crawford’s diva behavior didn’t endear her to the crew. “Crawford wouldn’t listen to you,” said Schiffer, according to Considine. “All you did was work on the eyelashes, then hold the mirror for her between setups. It was a servitude position, and Joan made the slaves look like Boy Scouts.”\n\n(In her defense, Davis also liked to do her own makeup: “On Charlotte I had my own makeup concept for Bette,” adds Schiffer in The Divine Feud, “which lasted about five minutes. She would say to me, ‘Don’t fuck with my face.’”)\n\nDespite her own demands, Davis was quick to make cracks about Crawford’s high-maintenance upkeep and took delight in pointing out the “mounds of hairpieces” Crawford brought with her to cover her thinning hair.\n\n“Maggie Donovan, who had been my hairdresser for years, said to me one day, ‘We’re up to our asses in Crawford’s hairpieces,’” said Davis, per Considine.\n\nLater in production, when Aldrich refused to expand her part and take her character suggestions, Crawford—left with no way to legally quit the picture—took herself to Cedar Sinai hospital. And after several hospital stays, terse legal meetings, and unsuccessful talks with Crawford, Aldrich succeeded in getting the studio to agree to replace her.\n\n“Fox had closed down my last movie [Something’s Got to Give],” George Cukor later explained to Considine, “because no actress wanted to take over for [Marilyn] Monroe. The picture was covered [by insurance], and I think Joan figured they would do the same thing for her.”\n\nDavis, knowing that Crawford being replaced would be a masterful, final blow to the ego, phoned her friend Olivia de Havilland. When her fellow Oscar winner balked at the part, Davis sent Aldrich to meet her in person in Switzerland and convince her to take the role. When the deal was inked, in one more nasty maneuver, Davis called her press agent to leak the story.\n\n“I heard the news of my replacement over the radio, lying in my hospital bed,” said Joan, having gotten a Davis-administered dose of her own medicine. “I wept for nine hours.” Having recovered enough to roll phone calls to press, Crawford told The Hollywood Reporter, “Aldrich knew where to long distance me all over the world when he needed me, but he made no effort to reach me here that he had signed Olivia. He let me hear it for the first time in a radio release . . . and, frankly, I think it stinks.”\n\n“I still get chills when I think of the treachery that Miss Davis indulged in on that movie,” Crawford told Considine, “but I refused to ever let anger or hate enter my heart.”\n\nShe may not have let hate in her heart. But even while in the hospital, the movie star couldn’t resist sniping at de Havilland during these interviews, according to Ed Sikov’s Dark Victory: The Life of Bette Davis.\n\n“I’m glad for Olivia,” Crawford told press, from inside her oxygen tent. “She needed the part.”", "images": ["https://web.archive.org/web/20170419231222im_/http://media.vanityfair.com/photos/57bdee00bf3a9d3b61adf4ac/master/w_768,c_limit/feud-Dominic-Burgess-Victor-Buono-ss06.png", "https://web.archive.org/web/20170419231222im_/http://media.vanityfair.com/photos/57bdedfc684596f379876826/master/w_768,c_limit/feud-joan-crawford-jessica-lang-ss01.png", "https://web.archive.org/web/20170419231222im_/http://media.vanityfair.com/photos/57bdedfe684596f379876827/master/h_590,c_limit/feud-Alfred-Molina-Robert-Aldrich-ss03.png", "https://web.archive.org/web/20170419231222im_/http://media.vanityfair.com/photos/57bdedfebf3a9d3b61adf4ab/master/w_768,c_limit/feud-Stanley-Tucci-Jack-L-Warner-ss04.png", "https://web.archive.org/web/20170419231222im_/http://media.vanityfair.com/photos/57bdee00bf3a9d3b61adf4ac/master/h_590,c_limit/feud-Dominic-Burgess-Victor-Buono-ss06.png", "https://web.archive.org/web/20170419231222im_/http://media.vanityfair.com/photos/57bdedfcbf3a9d3b61adf4aa/master/h_590,c_limit/feud-Susan-Sarandon-Bette-Davis-ss02.png", "https://web.archive.org/web/20170419231222im_/http://media.vanityfair.com/photos/581cf2bf784cf8ac089e69aa/master/h_590,c_limit/feud-kathy-bates-Joan-Blondell-ss09.png", "https://web.archive.org/web/20170419231222im_/http://media.vanityfair.com/photos/581cf2bf784cf8ac089e69aa/master/w_768,c_limit/feud-kathy-bates-Joan-Blondell-ss09.png", "https://web.archive.org/web/20170419231222im_/http://media.vanityfair.com/photos/57bdedfcbf3a9d3b61adf4aa/master/w_768,c_limit/feud-Susan-Sarandon-Bette-Davis-ss02.png", "https://web.archive.org/web/20170419231222im_/http://media.vanityfair.com/photos/57bdee02684596f379876828/master/h_590,c_limit/feud-Sarah-Paulson-Geraldine-Page-ss08.png", "https://web.archive.org/web/20170419231222im_/http://media.vanityfair.com/photos/57bdee02daec5e0d4f5d7cb3/master/h_590,c_limit/feud-Catherine-Zeta-Jones-Olivia-de-Havilland-ss07.png", "https://web.archive.org/web/20170419231222im_/http://media.vanityfair.com/photos/57bdee02daec5e0d4f5d7cb3/master/w_768,c_limit/feud-Catherine-Zeta-Jones-Olivia-de-Havilland-ss07.png", "https://web.archive.org/web/20170419231222im_/http://media.vanityfair.com/photos/57bdedfc684596f379876826/master/h_590,c_limit/feud-joan-crawford-jessica-lang-ss01.png", "https://web.archive.org/web/20170419231222im_/http://media.vanityfair.com/photos/57bdee00bf3a9d3b61adf4ad/master/w_768,c_limit/feud-Judy-Davis-Hedda-Hopper-ss05.png", "https://web.archive.org/web/20170419231222im_/http://media.vanityfair.com/photos/58f38fd20ba2cf01fc200a5b/16:9/w_1200,h_630,c_limit/feud-hush-hush-sweet-charlotte.jpg", "https://web.archive.org/web/20170419231222im_/http://media.vanityfair.com/photos/57bdedfe684596f379876827/master/w_768,c_limit/feud-Alfred-Molina-Robert-Aldrich-ss03.png", "https://web.archive.org/web/20170419231222im_/http://media.vanityfair.com/photos/57bdee02684596f379876828/master/w_768,c_limit/feud-Sarah-Paulson-Geraldine-Page-ss08.png"], "top_img": "https://web.archive.org/web/20170419231222im_/http://media.vanityfair.com/photos/58f38fd20ba2cf01fc200a5b/16:9/w_1200,h_630,c_limit/feud-hush-hush-sweet-charlotte.jpg", "keywords": [], "authors": ["Julie Miller", "Vanity Fair"], "canonical_link": "https://web.archive.org/web/20170419231222/http://www.vanityfair.com/hollywood/2017/04/feud-bette-davis-joan-crawford-hush-hush-sweet-charlotte-oscars", "title": "Fact-Checking Feud: How Bette Davis Got Revenge on Joan Crawford for That Stolen Oscar", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no,width=device-width,initial-scale=1,maximum-scale=1", "parsely-metadata": "{\"rubric\":\"FEUD\"}", "author": "Julie Miller", "pubdate": "2017-04-16T11:00:00Z", "copyright": "Copyright (c) Condé Nast 2017", "description": "Davis finds a way to get back at Crawford in Sunday’s Feud episode “Abandoned.”", "keywords": "article,feud,joan crawford,bette davis", "fb": {"pages": 8810407571, "app_id": 330433047345504}, "og": {"site_name": "HWD", "image": "https://web.archive.org/web/20170419231222im_/http://media.vanityfair.com/photos/58f38fd20ba2cf01fc200a5b/16:9/w_1200,h_630,c_limit/feud-hush-hush-sweet-charlotte.jpg", "title": "Fact-Checking Feud: How Bette Davis Got Revenge on Joan Crawford for That Stolen Oscar", "description": "Davis finds a way to get back at Crawford in Sunday’s Feud episode “Abandoned.”", "url": "https://web.archive.org/web/20170419231222/http://www.vanityfair.com/hollywood/2017/04/feud-bette-davis-joan-crawford-hush-hush-sweet-charlotte-oscars", "type": "article"}, "twitter": {"site": "@VanityFair", "domain": "www.vanityfair.com", "card": "summary_large_image", "title": "Fact-Checking Feud: How Bette Davis Got Revenge on Joan Crawford for That Stolen Oscar", "description": "Davis finds a way to get back at Crawford in Sunday’s Feud episode “Abandoned.”", "image": {"src": "http://media.vanityfair.com/photos/58f38fd20ba2cf01fc200a5b/16:9/pass/feud-hush-hush-sweet-charlotte.jpg?mbid=social_retweet"}}}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}