{"url": "https://theworldnews.net/us-news/kate-hudson-gives-fans-a-peek-at-her-adorable-baby-bump-on-instagram", "text": "In early April, Kate told the world that she was expecting a baby when she posted a video on her social media that showed she and her family popping balloons that contain smaller pink balloons and pink confetti.\n\n\"SURPRISE!!!\" she wrote. \"If you've wondered why I've been so absent on my social channels it's because I have never been more sick! It's was the most sick first trimester of all my children. Boomerangs have made me nauseous, Superzoom is an easy way to have my head in the toilet, food instagrams make me queezy and thinking too much about insta stories made me even more exhausted than I already had been. If you've seen me out and about smiling and pretending like everything is amazing...I was lying!\"\n\n\"BUT! I have broken through on the other end of that and rediscovering the joys of insta/snap,\" she continued. \"We have been trying to keep this pregnancy under the radar for as long as possible but I'm a poppin now! And it's too darn challenging to hide, and frankly hiding is more exhausting then just coming out with it! My kids, Danny, myself and the entire family are crazy excited! A little girl on the way.\"\n\nHudson and Fujikawa have been dating for more than a year.\n\nThe week before telling fans the news, Hudson said in an interview with The Times, that she'd like to start a family with her boyfriend.\n\n\"I'd like to! I'm not done yet. A girl would be fun,\" she said. \"We'll see. We'll see how many Danny wants.\"\n\nHudson and Fujikawa actually met when she was 23 and pregnant with her first son Ryder, 14, whom she shares with her ex-husband Chris Robinson.\n\nHudson also has son Bingham Bellamy from a former relationship with Muse frontman.", "images": ["https://theworldnews.net/ogimage.png", "https://theworldnews.net/ui/images/legal.svg?v=2", "https://theworldnews.net/ui/images/screenshot_aplication.png", "https://theworldnews.net/ui/images/sidebar_statistics.svg", "https://theworldnews.net/ui/images/flag_dark.svg?v=2", "https://theworldnews.net/ui/images/main_logo.svg", "https://theworldnews.net/ui/images/world.svg", "https://theworldnews.net/ui/images/paper.svg"], "top_img": "https://theworldnews.net/ogimage.png", "keywords": [], "authors": [], "canonical_link": "", "title": "Kate Hudson Gives Fans a Peek at Her Adorable Baby Bump on Instagram", "meta_data": {"viewport": "width=device-width, height=device-height, initial-scale=1.0, minimum-scale=1.0", "description": "In early April, Kate told the world that she was expecting a baby when she posted a video on her social media that showed she and her family popping balloons th", "og": {"title": "Kate Hudson Gives Fans a Peek at Her Adorable Baby Bump on Instagram", "image": "https://theworldnews.net/ogimage.png", "description": "In early April, Kate told the world that she was expecting a baby when she posted a video on her social media that showed she and her family popping balloons th", "site_name": "Kate Hudson Gives Fans a Peek at Her Adorable Baby Bump on Instagram"}, "twitter": {"title": "Kate Hudson Gives Fans a Peek at Her Adorable Baby Bump on Instagram", "description": "In early April, Kate told the world that she was expecting a baby when she posted a video on her social media that showed she and her family popping balloons th"}, "google-site-verification": "U1-hTM45Vi-2FXgAe9yiO34XFJryFRyuNImiqKdV6EQ"}, "movies": [], "publish_date": null, "source": "https://theworldnews.net", "summary": ""}