{"url": "https://www.hollywoodreporter.com/live-feed/mtvs-teen-wolf-getting-a-new-take-1022262", "text": "Weeks before Teen Wolf's final 10 episodes unspool, MTV is already looking toward the future of its beloved franchise.\n\nThe Viacom-owned cable network is in early talks with creator and showrunner Jeff Davis to turn Teen Wolf into a potential anthology with a rebooted take featuring a largely new cast — though there could be some returning characters — and new setting. Additionally, Davis and MTV plan to continue the show's current narrative in podcast form after the series wraps its run this summer.\n\n\"These characters and these stories have hit a peak,\" MTV president Chris McCarthy tells The Hollywood Reporter. \"We are talking with Jeff about how do we actually keep that franchise alive. And the beauty of the evolution of media is you can see the series going on through a series of podcasts and then see a resurrection of a new class in a couple years.\"\n\nTo say Teen Wolf has been an important franchise for MTV would be an understatement. The reboot of the 1985 Michael J. Fox feature launched in 2011 as the cabler's first scripted drama, and when it ends it will have hit the celebrated 100-episode milestone. In a sign of its rabid fan base — the final-season trailer is MTV's most streamed of all time, for any show — Teen Wolf will make its debut in the massive 7,200-person Hall H on Thursday at San Diego Comic-Con.\n\nWhile talks are still in the early stages, McCarthy believes the core themes explored in Teen Wolf resonate with the viewers he's trying to bring back to the network with its new focus on scripted. (Click here for news on MTV's new scripted slate and an interview with McCarthy).\n\n\"How do we keep this franchise alive in podcasts, in the spirit of Serial, and then how do we actually reboot an entire new class? Because the heart of MTV is around these timeless issues of young people and coming of age, but the timely piece will be the whole new cast, new set of issues and stories to explore through them. With Teen Wolf, we have such a beautiful gem. And when you have a creator like Jeff that is such an amazing partner and the fan base that is hungry for more, we're crazy not to.\"\n\nMcCarthy is MTV's third president in as many years, and his focus on scripted is to explore a more nuanced take and not rush anything on the air. To hear the executive tell it, the cabler's recent unscripted success has afforded the network time to take a more patient approach and tell specific stories that express the brand rather than airing something just to stay in the scripted space.\n\nThe podcast, which also is in its early stages, will likely start shortly after the series finale, with the potential series refresh coming later down the line.\n\n\"We want to give it enough time to let the series finale marinate a year or so, and then when we find the right story and the right cast, look to resurrect it,\" McCarthy says.\n\nA podcast would come after Teen Wolf has already had success in the digital side with the franchise. The first season of the drama aired with a six-episode companion web series, Search for a Cure, with an aftershow, Wolf Watch, also airing after first-run episodes in later seasons.\n\nNews of a Teen Wolf revival comes as MTV has now officially turned Scream, starting with its rebooted third season, into an anthology. Season three will launch in March with a new cast, showrunner and exec producers as well as new location as filming has moved to Atlanta.\n\nA version of this story first appeared in the July 19 issue of The Hollywood Reporter magazine. To receive the magazine, click here to subscribe.", "images": ["https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/08/teen_wolf_509_h_2015.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7395269&cv=2.0&cj=1", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/01/greg_berlanti_sharon_horgan_alex_kurtzman_and_dwayne_johnson_-_getty_-_h_2020.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2017/12/thr_scriptforsale_icon.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/06/vi_thomasderijk_logo_alpha_ntsc.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/nfe_square_383x383/2015/04/lesley_goldberg_0.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2020/03/mrs._america_-_publicity_still_1-_h_2020_.jpg", "https://cdn1.thr.com/sites/default/files/2017/07/teen_wolf_s04e01_still.jpg", "https://cdn1.thr.com/sites/default/files/imagecache/768x433/2017/07/teen_wolf_s04e01_still.jpg", "https://assets.hollywoodreporter.com/assets/1576792252/images/brand/thr-logo-white.svg?abfebfb5f298762e7c71", "https://cdn1.thr.com/sites/default/files/blogicon_livefeed-black2.png"], "top_img": "https://cdn1.thr.com/sites/default/files/2017/07/teen_wolf_s04e01_still.jpg", "keywords": [], "authors": ["Lesley Goldberg", "Lesley.Goldberg Thr.Com"], "canonical_link": "https://www.hollywoodreporter.com/live-feed/mtvs-teen-wolf-getting-a-new-take-1022262", "title": "'Teen Wolf': MTV Readying New Take on the Franchise (Exclusive)", "meta_data": {"viewport": "width=device-width", "description": "The Viacom-owned cable network will also continue the current story in podcast form after the final season wraps this summer.", "twitter": {"site": "@THR", "creator": "@THR", "url": "https://www.hollywoodreporter.com/live-feed/mtvs-teen-wolf-getting-a-new-take-1022262", "domain": "https://www.hollywoodreporter.com/", "title": "'Teen Wolf': MTV Readying New Take on the Franchise (Exclusive)", "description": "The Viacom-owned cable network will also continue the current story in podcast form after the final season wraps this summer.", "card": "summary_large_image", "image": "https://cdn1.thr.com/sites/default/files/imagecache/NFE_Landscape/2017/07/teen_wolf_s04e01_still.jpg"}, "og": {"site_name": "The Hollywood Reporter", "title": "'Teen Wolf': MTV Readying New Take on the Franchise (Exclusive)", "description": "The Viacom-owned cable network will also continue the current story in podcast form after the final season wraps this summer.", "url": "https://www.hollywoodreporter.com/live-feed/mtvs-teen-wolf-getting-a-new-take-1022262", "image": {"identifier": "https://cdn1.thr.com/sites/default/files/2017/07/teen_wolf_s04e01_still.jpg", "width": 1296, "height": 730, "type": "image/jpeg"}, "type": "article"}, "sailthru.title": "'Teen Wolf': MTV Readying New Take on the Franchise (Exclusive)", "sailthru.description": "The Viacom-owned cable network will also continue the current story in podcast form after the final season wraps this summer.", "sailthru.author": "Lesley Goldberg", "sailthru.channel": "Live Feed", "sailthru.vertical": "Live Feed", "sailthru.date": "2017-07-19 05:15:00", "sailthru.tags": "Live Feed, Television, MTV, Teen Wolf , TV Development"}, "movies": [], "publish_date": 1500412500.0, "source": "https://www.hollywoodreporter.com", "summary": ""}