{"url": "https://www.sltrib.com/news/nation-world/2017/11/03/trumps-twitter-account-restored-after-brief-interruption/", "text": "Some historic moments pass in one fell swoop.\n\nPresident Abraham Lincoln’s reading of the Gettysburg Address lasted only two or three minutes. Last year, Olympic swimmer Michael Phelps smashed an ancient record when he swam the 200-meter individual medley in 1 minute and 54.66 seconds.\n\nAnd then for a brief window on Thursday evening, 330 million Twitter users slid into a world without @realDonaldTrump.\n\nPresident Donald Trump’s Twitter account — from which he aggressively confronts those who displease him, suggests North Korea “may not be around much longer!” and promotes Trump Tower taco bowls — disappeared.\n\nTwitter initially posted a statement Thursday night saying Trump’s “account was inadvertently deactivated due to human error by a Twitter employee.”\n\nEarlier today @realdonaldtrump’s account was inadvertently deactivated due to human error by a Twitter employee. The account was down for 11 minutes, and has since been restored. We are continuing to investigate and are taking steps to prevent this from happening again. — Twitter Government (@TwitterGov) November 3, 2017\n\nFor those few minutes, visitors to Trump’s account were simply met with the message, “Sorry, that page doesn’t exist!”\n\n“The account was down for 11 minutes, and has since been restored,” the statement read. “We are continuing to investigate and are taking steps to prevent this from happening again.”\n\nBut then two hours later, Twitter updated its statement saying that an investigation showed the deactivation “was done by a Twitter customer support employee who did this on the employee’s last day.” Twitter said it would be conducting a full internal review.\n\nThe company’s tweet: Earlier today @realdonaldtrump’s account was inadvertently deactivated due to human error by a Twitter employee. The account was down for 11 minutes, and has since been restored. We are continuing to investigate and are taking steps to prevent this from happening again.\n\nTrump has used the account since March 2009. He has tweeted more than 36,000 times and has 41.7 million followers.\n\nTrump has spoken publicly about his reliance on Twitter before. In an interview with Maria Bartiromo of Fox Business Network last month, Trump credited his use of social media as among the reasons he was elected.\n\n“You have to keep people interested also,” he said. “You know, you have to keep people interested.”\n\nTwitter also serves as among Trump’s main tools for deflecting criticisms and attacks. In the same interview, Trump said that “When somebody says something about me, I am able to go bing, bing, bing and I take care of it.”\n\nTrump conceded that those close to him try to steer him away from social media. But he insists on tweeting — spelling errors included — as a weapon against “fake news.”\n\nTrump’s account may have been “inadvertently” deactivated Thursday, but Twitter has also had to defend its decision not to take down particular presidential tweets.\n\nIn a six-tweet thread in September, Trump issues what some took as a threat directed at North Korea.\n\n“Just heard Foreign Minister of North Korea speak at U.N. If he echoes thoughts of Little Rocket Man, they won’t be around much longer!” Trump wrote.\n\nAs The Post has reported, Twitter prohibits tweets that include violent threats, which some argued was Trump’s intention.\n\nTwitter responded saying a number of factors go into account when evaluating controversial content, including its “newsworthiness” and whether it has “public interest.”\n\nThose tweets confronting North Korea followed other instances where critics called for Trump’s account to be more closely controlled, such as when he tweeted an edited video of himself beating somebody up, the victim’s face replaced by a CNN logo.\n\nAnd then there are the accounts that Twitter has chosen to suspend. Last month, the actress Rose McGowan took to Twitter to challenge Ben Affleck on his claim that he knew nothing of Harvey Weinstein’s decades-long history of sexual assault and violence towards women.\n\n“You lie,” McGowan wrote in one tweet.\n\nBut another tweet led to the temporarily suspension of her account. Despite initially declining to comment on the content of that specific tweet, Twitter later explained that McGowan’s “account was temporarily locked because one of her Tweets included a private phone number, which violates our Terms of Service.”\n\nOn Thursday alone, Trump used his account to congratulate the Houston Astros for winning the World Series, call on Congress to “TERMINATE” the diversity visa lottery and announce the nomination of Jerome Powell as the next chair of the Federal Reserve.\n\nTrump was back tweeting at 8:05 p.m., praising the day’s “Great Tax Cut rollout.”\n\n“The lobbyists are storming Capital Hill, but the Republicans will hold strong and do what is right for America!”\n\nIt was as if he never left.", "images": ["https://www.sltrib.com/resizer/H3IHTlluDRcbAmACQhUEPU_MDBw=/1200x630/filters:quality(85)/arc-anglerfish-arc2-prod-sltrib.s3.amazonaws.com/public/ND6JE5C4R5BY7HUBT4URV5H4TU.jpg", "https://www.sltrib.com/pb/resources/assets/img/donate_sltrib_button_icon_redbright.png", "https://www.sltrib.com/resizer/2R508eEoljEYM8tHULyJuRk-3B4=/0x600/smart/filters:quality(5)/arc-anglerfish-arc2-prod-sltrib.s3.amazonaws.com/public/ND6JE5C4R5BY7HUBT4URV5H4TU.jpg", "https://www.sltrib.com/pb/resources/assets/img/vectors/sltrib-logo.svg", "https://www.sltrib.com/pb/resources/assets/img/vectors/close-icon.svg"], "top_img": "https://www.sltrib.com/resizer/H3IHTlluDRcbAmACQhUEPU_MDBw=/1200x630/filters:quality(85)/arc-anglerfish-arc2-prod-sltrib.s3.amazonaws.com/public/ND6JE5C4R5BY7HUBT4URV5H4TU.jpg", "keywords": [], "authors": ["Rachel Siegel", "The Washington Post"], "canonical_link": "https://www.sltrib.com/news/nation-world/2017/11/03/trumps-twitter-account-restored-after-brief-interruption/", "title": "For 11 minutes, Trump’s Twitter account disappeared. Here’s what happened.", "meta_data": {"referrer": "unsafe-url", "apple-mobile-web-app-title": "SLTrib", "application-name": "SLTrib", "msapplication-config": "/pb/resources/favicons/browserconfig.xml?v=1.1", "theme-color": "#ffffff", "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.5, maximum-scale=2.0", "description": "Some historic moments pass in one fell swoop.", "twitter": {"site": "@sltrib", "card": "summary_large_image", "description": "Some historic moments pass in one fell swoop.", "image": "https://www.sltrib.com/resizer/H3IHTlluDRcbAmACQhUEPU_MDBw=/1200x630/filters:quality(85)/arc-anglerfish-arc2-prod-sltrib.s3.amazonaws.com/public/ND6JE5C4R5BY7HUBT4URV5H4TU.jpg", "title": "For 11 minutes, Trump’s Twitter account disappeared. Here’s what happened."}, "og": {"description": "Some historic moments pass in one fell swoop.", "site_name": "The Salt Lake Tribune", "type": "article", "locale": "en_US", "image": "https://www.sltrib.com/resizer/H3IHTlluDRcbAmACQhUEPU_MDBw=/1200x630/filters:quality(85)/arc-anglerfish-arc2-prod-sltrib.s3.amazonaws.com/public/ND6JE5C4R5BY7HUBT4URV5H4TU.jpg", "title": "For 11 minutes, Trump’s Twitter account disappeared. Here’s what happened.", "url": "https://www.sltrib.com/news/nation-world/2017/11/03/trumps-twitter-account-restored-after-brief-interruption/"}, "distribution": "global", "rating": "general", "language": "en_US", "article": {"publisher": "https://www.facebook.com/saltlaketribune", "author": "https://www.facebook.com/saltlaketribune"}, "fb": {"app_id": 913431655408104}, "ogType": "article", "ogImage": "https://arc-anglerfish-arc2-prod-sltrib.s3.amazonaws.com/public/ND6JE5C4R5BY7HUBT4URV5H4TU.jpg", "pianoReload": "false", "canonicalUrl": "https://www.sltrib.com/news/nation-world/2017/11/03/trumps-twitter-account-restored-after-brief-interruption", "isMetered": "true", "title": "For 11 minutes, Trump’s Twitter account disappeared. Here’s what happened.", "robots": "index, follow", "twt-article-id": "HQ2VLFKC7ZDD3FXA5DG2JX2XS4", "twt-published-at": "2017-11-03T00:13:47.626Z", "twt-article-url": "https://www.sltrib.com/news/nation-world/2017/11/03/trumps-twitter-account-restored-after-brief-interruption/", "twt-page-title": "For 11 minutes, Trump’s Twitter account disappeared. Here’s what happened."}, "movies": [], "publish_date": 1509638400.0, "source": "https://www.sltrib.com", "summary": ""}