{"url": "www.essence.com/love-sex/beyonce-jay-z-saved-their-marriage-lyrics-album-everything-is-love/", "text": "Anyone who’s ever been married will tell you that the road to happily ever after is paved with hard work. Falling in love is easy, but staying that way is inevitably much harder – even when the love is real.\n\nThe biggest hurdles we face after the altar are the giant mounds of heartbreak and pain that can seem insurmountable at first glance. For some couples, the fractures in their foundation become too hard to bear and walking away is what’s healthiest for them. Others choose to stick it out and fight to rebuild after the damage has been done, holding out hope that the tide will shift and good times will roll in once again. Beyoncé and JAY-Z are the latter.\n\nThe notoriously private couple has slowly rolled out one detail after another about the bumps in the road they’ve encountered in their marriage—one hit album at a time. First, in 2016, Beyoncé released arguably her most emotionally raw album to-date, Lemonade, and track-by-track revealed her heartbreak and anger over discovering her husband’s infidelities and how they almost ended their marriage. A year later JAY-Z told his side of the story on his latest album 4:44. He came clean about his infidelities and his guilt over the pain he caused his wife and daughter at the time. But, as it seems, while fans were still reeling from the heartbreak of learning that the Carters, like so many other married couples, weren’t living the picture-perfect life they believed they were, Beyoncé and JAY-Z were pressing reset and putting in the work to save their marriage.\n\nOn Saturday, the couple released a surprise album—their first-ever joint release—titled Everything Is Love, and they couldn’t have picked a more fitting title to describe the new place they’ve arrived at together. If you listen closely to the lyrics, they’re telling us just how far they’ve come together, how much love and passion they still share for each other, and perhaps most importantly, how committed they are to making their marriage work. The album’s final track “LOVEHAPPY” says it all.\n\nLet’s break it down, shall we?\n\nHe went to Jared, I went to Chaumet out in Paris\n\nYeah, you fucked up the first stone, we had to get remarried\n\nYo, chill man\n\nWe keepin’ it real with these people, right?\n\nLucky I ain’t kill you when I met that b- (Nah, aight, aight )\n\nY’all know how I met her, we broke up and got back together\n\nTo get her back, I had to sweat her\n\nTranslation: While it takes two to achieve true forgiveness in a marriage, when it comes to infidelities, the onus most definitely falls on the guilty party to show and prove, and JAY-Z is clearly putting in that work to show Bey he’s a changed man.\n\nY’all could make up with a bag, I had to change the weather\n\nMove the whole family West, but it’s whatever\n\nIn a glass house still throwing stones\n\nHova, Beysus, watch the thrones\n\n(Happy in love)\n\nTranslation: A lot of things can trigger painful memories, including a home, a city or even an area code. Sometimes the easiest way to truly start over is to just…well, start over. In August 2017 Beyoncé and JAY-Z moved from New York City to Los Angeles, and now we know it was most likely about a lot more than just the better weather.\n\n[Chorus: Beyoncé]\n\nYou did some things to me\n\nBoy, you do some things to me\n\nBut love is deeper than your pain and I believe you can change\n\nBaby, the ups and downs are worth it\n\nLong way to go, but we’ll work it\n\nWe’re flawed but we’re still perfect for each other\n\nTranslation: Beyoncé forgave JAY-Z and she’s pushing past the pain and willing to put in the work because he is too. She’s acknowledging that it hasns’t been an overnight process, but she believes their love will stand the test of time. Real talk: When a marriage hits a rough patch and a couple share what’s going on with close friends and family, usually lots of opinions and judgements follow. Let’s be honest, it can be hard to forgive someone you love for doing the unthinkable when the people around you are telling you that you’re crazy to do so or to stay. The decision is yours and yours partners, and what really matters most is what the two of you want and believe. (Even when the noise around you makes it hard to think clearly.) Here, Beyoncé is setting the record straight: She knows where they’ve been and she knows where they’re going and she’s moved on. End of story.\n\nSometimes I thought we’d never see the light\n\nWent through hell with heaven on our side\n\nThis beach ain’t always been no paradise\n\nBut nightmares only last one night\n\nTranslation: They’ve been through the fire and back and their faith is now lifting them higher.\n\nDamn, look at us now\n\nPray, pray for the vows\n\nWay up now, yes, and a way, long way down\n\nWe came, and we saw, and we conquered it all\n\nWe came, and we conquered, now we’re happy in love\n\nTranslation: Bey and Jay’s love is back on top and they’re putting their faith in each other and their vows, which they recently renewed and shared footage from as part of their new On The Run II tour videos.\n\nYou have to applaud Beyoncé and JAY-Z for their transparency and their deep commitment to fighting forward and making their marriage work. I imagine the only thing harder than reaching a crisis in your marriage is the vulnerability that comes with sharing the news with the world. But, in true Carters fashion, they’re going hard and not looking back—and sparking necessary conversations on the realities of marriage and the work involved.\n\nTo quote the Carters, “This. Is. Real. Life.” And, in the real world, when it comes to matters of the heart, sometimes we have to fight for what we want and forgive in order to move forward.", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.essence.com/wp-content/uploads/2018/06/1529307191/GettyImages-968691712.jpeg?width=1920&height=1080", "https://www.essence.com/wp-content/uploads/2020/02/rgb-TAG-Registered-80px.png", "https://www.essence.com/wp-content/uploads/2018/06/1529307191/GettyImages-968691712-900x600.jpeg"], "top_img": "https://www.essence.com/wp-content/uploads/2018/06/1529307191/GettyImages-968691712-900x600.jpeg", "keywords": [], "authors": [], "canonical_link": "https://www.essence.com/love/beyonce-jay-z-saved-their-marriage-lyrics-album-everything-is-love/", "title": "This Is Real Life! Beyoncé and Jay-Z Reveal How They Did The Work and Saved Their Marriage On New Album", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "If you listen closely, you'll hear that the Carters are telling the rest of the story on their surprise joint album, Everything Is Love.", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "<p>This Is Real Life! Beyoncé and Jay-Z Reveal How They Did The Work and Saved Their Marriage On New Album</p>", "description": "If you listen closely, you'll hear that the Carters are telling the rest of the story on their surprise joint album, Everything Is Love.", "url": "https://www.essence.com/love/beyonce-jay-z-saved-their-marriage-lyrics-album-everything-is-love/", "site_name": "Essence", "image": {"identifier": "https://www.essence.com/wp-content/uploads/2018/06/1529307191/GettyImages-968691712-900x600.jpeg", "secure_url": "https://www.essence.com/wp-content/uploads/2018/06/1529307191/GettyImages-968691712-900x600.jpeg"}}, "article": {"publisher": "https://www.facebook.com/essence"}, "fb": {"app_id": 2453509358209265}, "twitter": {"card": "summary_large_image", "description": "If you listen closely, you'll hear that the Carters are telling the rest of the story on their surprise joint album, Everything Is Love.", "title": "<p>This Is Real Life! Beyoncé and Jay-Z Reveal How They Did The Work and Saved Their Marriage On New Album</p>", "site": "@essence", "creator": "@essence"}, "generator": "WordPress 5.3.2", "wp-parsely_version": "2.0", "msapplication-TileImage": "https://www.essence.com/wp-content/uploads/2018/04/cropped-essence-fav-icon-270x270.png"}, "movies": [], "publish_date": null, "source": "http://www.essence.com", "summary": ""}