{"url": "https://www.celebritynetworth.com/richest-businessmen/business-executives/fredrik-eklund-net-worth/", "text": "Fredrik Eklund net worth: Fredrik Eklund is a Swedish born New York City real estate broker and novelist who has a net worth of $30 million. Fredrik Eklund earned his net worth as a real estate broker, a adult film star and a former Information Technology (IT) entrepreneur.\n\nEarly Life: Fredrik Eklund was born on April 26, 1977 in Stockholm, Sweden. His brother is Sigge Eklund, an author, and his father, Klas Eklund, was a senior economist at the Swedish bank SEB. Fredrik's grandparents were actors Bengt Eklund and Fylgia Zadig. Fredrik was an entrepreneur from the start: at four years old, he performed a one-man show in his living room and invited his family and neighbors to attend, charging five kroners (about 50 cents, USD) per person. When Eklund was seven, he sold Christmas calendars and became obsessed with becoming the number one seller amongst the other neighborhood kids. He created his own sales strategy and went door to door, reportedly sometimes spending hours with his potential customers. Eklund broke epic sales records for the company that winter. He learned early on the importance of building up trust and transparency with potential customers.\n\nEklund was an American high school exchange student at Edina High School in Edina, Minnesota. The first time he visited New York City, he was blown away and vowed to return there to work later in life. He later returned to Sweden and studied at the Stockholm School of Economics, however he did not graduate. He worked at the financial newspaper known as the Finanstidningen for a time before starting a club with a number of his friends called \"Billy\".\n\nEarly career: In 1999, he founded an internet company called Humany, with his father Klas Eklund and a former Prime Minister named Carl Bildt. He was the CEO of a company of 45 employees at the young age of 23. He worked in Stockholm, London, Singapore and Tokyo before he moved to New York City. During the dot-com bubble, he started a music production company, called Cave Entertainment.\n\nReal Estate: Eklund is the Managing Director of CORE Group Marketing, a New York City based real estate firm. His business partner is John Gomes of Prudential Douglas Elliman, and Eklund was also the 2010 Managing Director at Prudential Douglas Elliman. He has closed over five billion dollars in residential real estate. By age 25, he had been named Rookie of the Year by the New York Real Estate board. Fredrik runs the largest real estate brokerage firm on the East Coast. Eklund is also the founder of Eklund Stockholm New York, which is the most high-end residential real estate brokerage in Scandinavia, consisting of 50 employees. Eklund Stockholm New York closed $1 billion worth of sales in 2014. He is an active member of the Real Estate Board of New York. In November 2010, Eklund was featured on the front page of the New York Times' Sunday Style section. In 2017, Fredrik and his team were named the number one real estate team in New York City by REAL Trends and the Wall Street Journal. His high-profile clients include Jennifer Lopez, Sarah Jessica Parker and Matthew Broderick, John Legend and Chrissy Teigen, Daniel Craig, and plenty of other names you'd recognize.\n\nAdult Film Career: In 2003, before he moved to New York City, Eklund had a brief stint in gay pornographic films under the pseudonym Tag Eriksson (aka Tag Ericsson). He has said of this period of time that his adult film career only accumulated to about a week in total, spread out over a few months. In an interview with Out Magazine, he said it was something he tried and \"quickly decided\" he was done with, but that he has no regrets. Eklund, good-humoredly, starred in the 2003 parody of The Ring, a porn comedy movie named The Hole.\n\nReality TV: Eklund is currently one of the three New York City brokers starring in American reality television show on the Bravo Network, Million Dollar Listing New York; the show finished its eighth season in October 2019. If renewed, season nine is slated to premiere in late 2020.\n\nPersonal Life: Eklund married artist Derek Kaplan on February 9, 2013, on Little Palm Island in the Florida Keys. Until 2016, they lived in New York with their two dogs. The four of them relocated to Roxbury Connecticut to live in a mansion that Eklund purchased. The couple had twins via surrogate in November 2017 after a failed attempt in which a previous surrogate sadly suffered a miscarriage. Eklund and Kaplan are now parents to twins: daughter Milla and son Fredrik Jr. The couple is said to enjoy cooking, photography, and wine. Eklund even launched his own wine, High-Kick. It's sold in six countries and his rose is the number one new rose in Sweden.", "images": ["https://vz.cnwimg.com/wp-content/uploads/2012/03/Fredrik-Eklund-1-e1585696448515.jpg", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://googleads.g.doubleclick.net/pagead/viewthroughconversion/1057081139/?value=0&guid=ON&script=0", "https://vz.cnwimg.com/thumb-900x/wp-content/uploads/2012/03/Fredrik-Eklund-2.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2012/03/Fredrik-Eklund-1-e1585696448515.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-businessmen/business-executives/fredrik-eklund-net-worth/", "title": "Fredrik Eklund Net Worth", "meta_data": {"description": "Fredrik Eklund net worth: Fredrik Eklund is a Swedish born New York City real estate broker and novelist who has a net worth of $30 million. Fredrik Eklund", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "cnw_share_fb_count": 137, "cnw_share_tw_count": 44, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Fredrik Eklund Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-businessmen/business-executives/fredrik-eklund-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2012/03/Fredrik-Eklund-1-e1585696448515.jpg", "site_name": "Celebrity Net Worth", "description": "Fredrik Eklund net worth: Fredrik Eklund is a Swedish born New York City real estate broker and novelist who has a net worth of $30 million. Fredrik Eklund"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2020-03-31T23:15:21+00:00", "published_time": "2020-02-29T23:21:03+00:00", "section": "Executives", "tag": "million dollar listing"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2012/03/Fredrik-Eklund-1-e1585696448515.jpg", "title": "Fredrik Eklund Net Worth", "description": "Fredrik Eklund net worth: Fredrik Eklund is a Swedish born New York City real estate broker and novelist who has a net worth of $30 million. Fredrik Eklund"}}, "movies": [], "publish_date": 1583018463.0, "source": "https://www.celebritynetworth.com", "summary": ""}