{"url": "www.bustle.com/p/when-are-sophie-turner-joe-jonas-getting-married-because-were-so-ready-for-another-game-of-thrones-wedding-9585454", "text": "Several months after getting engaged, Sophie Turner and Joe Jonas continue to be one of the most adorable celebrity pairings in modern day romance. But cute as they may be, one question about the Turner/Jonas love story that continues to bother my mind just as much as that elusive 2019 Game of Thrones finale is, when are Sophie Turner and Joe Jonas getting married?\n\nBy the looks of things, I wouldn't get your hopes up quite yet, Turner and Jonas stans. During a recent interview with the Evening Standard, Jonas was asked if he felt \"in any kind of a hurry to get married\". His response? A pretty clear indication the couple won't be walking down the aisle anytime soon. “No, no,\" Jonas said. \"We’ve been trying to take some time off while running around Europe.\" Jonas then elaborated on the sentiment that his wedding to Sophie Turner won't be anytime soon, by revealing the pair are currently content with \"just being tourists\".\n\nHe added: \"It’s been really exciting to play shows here in the summer, when people are out and about and the energy is top-notch. So right now, as far as down-time for us is concerned, we’re just being tourists.\"\n\nDaniel Zuchnik/Getty Images Entertainment/Getty Images\n\nTurner and Jonas first confirmed their engagement in October 2017 when Jonas shared an image of Turner wearing an engagement ring alongside the caption: \"She said yes.\" Since then, speculation about their nuptials has been pretty rife, and — despite fan pressure — it looks like Turner is on the same page as her fiancè with regards to not rushing into anything when it comes to wedding plans.\n\nDuring an interview with People earlier this year, Turner seemingly confirming the Turner/Jonas wedding won't happen until at least 2019, adding that she was \"holding off on wedding dress shopping\" because \"you never know what’s going to be fashionable next year\". Make of that what you will, but I take it as a yet another pretty big indicator fans shouldn't expect a Turner/Jonas marriage before this year's end.\n\nextratv on YouTube\n\nFortunately for Game of Thrones fans, there has already been a House Stark wedding this year. Over the weekend, Kit Harrington — who plays Jon Snow aka Turner's on-screen half-brother — married Ygritte actress Rose Leslie in Scotland, with many of the couple's Thrones co-stars in attendance. Turner herself attended the event alongside her on-screen sister Maisie Williams, and — while Jonas wasn't present at the nuptials — he did FaceTime in with Sophie as she headed to the airport.\n\nBut, I digress. Indeed, my point is that given that the history of Stark weddings — particularly that gory AF Red Wedding — is pretty dark, perhaps holding two in one year would be chancing it (although, on a technicality you could say Harington isn't actually from House Stark), and delaying the Turner/Jonas wedding until at least 2019 is actually a good thing? Meh. I'm clutching at straws. The jury's still out on that one.\n\nAnthony Harvey/Getty Images Entertainment/Getty Images\n\nConflicting wedding schedules aside, it also seems Turner wants to get quite a lot of work done before she ties the knot — and doesn't want to be defined by her marriage. \"There’s this weird misconception that being married is the greatest thing that’ll ever happen to you,\" she previously told Marie Claire. \"But I’ve always found that my career is something I work for, and when I achieve something, there’s a sense that this is the greatest thing I’ll do in my life. There’s a sense of peace that comes with finding your person. But there’s a drive that comes with your career.”\n\nAnd, seeing as Turner's forthcoming movie schedule is pretty jam-packed, it looks like fans will have to be pretty patient while waiting to see her tie the knot with the oldest Jo bro.", "images": ["https://imgix.bustle.com/uploads/image/2020/4/15/2ed3e414-7dec-465f-bdab-d66e05110f44-9056783o.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/6/26/a4a212eb-f5fb-4ce1-99cd-f1f5b5ad4361-getty-518895630.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2018/6/26/5cabe850-816a-4a18-9c29-e7da68290431-getty-675787922.jpg?w=646&fit=max&auto=format%2Ccompress&cs=srgb&q=70", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2020/4/9/c623a537-4e46-4e7d-9ae6-7dbf55c84729-getty-1205318554.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/image/2018/6/27/ecdd2233-14a1-4f26-ad59-1f551c03d8bb-1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/image/2018/6/27/ecdd2233-14a1-4f26-ad59-1f551c03d8bb-1.jpg?w=970&h=546&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://imgix.bustle.com/uploads/getty/2020/4/10/14a8d2bf-6a64-40cc-a104-034fe33752a4-getty-1188778598.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2020/4/6/6ec3dcb8-566d-4631-88db-11d6dac03c81-8955bb08-cd84-48c9-b83d-bc8ad846cb05-getty-161442774.jpg?w=100&h=100&fit=crop&crop=faces&auto=format%2Ccompress&cs=srgb&q=70", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/6/27/ecdd2233-14a1-4f26-ad59-1f551c03d8bb-1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/when-are-sophie-turner-joe-jonas-getting-married-because-were-so-ready-for-another-game-of-thrones-wedding-9585454", "title": "When Are Sophie Turner & Joe Jonas Getting Married Because We're So Ready For Another 'Game Of Thrones' Wedding", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/when-are-sophie-turner-joe-jonas-getting-married-because-were-so-ready-for-another-game-of-thrones-wedding-9585454", "type": "article", "title": "Sophie Turner & Joe Jonas' Wedding Isn't Imminent But The Reason Why Is SO Legit", "description": "Several months after getting engaged, Sophie Turner and Joe Jonas continue to be one of the most adorable celebrity pairings in modern day romance. But cute as they may be, one question about the Turner/Jonas love story that continues to bother my…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/6/27/ecdd2233-14a1-4f26-ad59-1f551c03d8bb-1.jpg?w=1200&h=630&q=70&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 132694503601208}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "description": "Several months after getting engaged, Sophie Turner and Joe Jonas continue to be one of the most adorable celebrity pairings in modern day romance. But cute as they may be, one question about the Turner/Jonas love story that continues to bother my…"}, "movies": [], "publish_date": null, "source": "http://www.bustle.com", "summary": ""}