{"url": "https://www.nbcmiami.com/entertainment/entertainment-news/Ryan-Seacrest-Denies-Sexual-Harassment-Allegations-475333643.html", "text": "Ryan Seacrest is speaking out about a sexual harassment allegation leveled against him.\n\nOne day after Variety published one woman's account of \"unwanted sexual aggression\" by the television personality while working as his personal stylist, Seacrest continues to deny the claims.\n\nSeacrest shared in a statement, \"Much has been said about the #MeToo and Times Up movement(s) and the importance of providing women and men with the opportunity to share their stories of workplace misconduct, in an effort to change our culture and the systemic inequalities that exist. I absolutely support this cause unequivocally and applaud all the brave souls who have come forward to share their stories.\n\n\"Sadly, last fall I became one of the accused,\" he continued, \"which I promptly revealed proactively to the network involved and to the public. And to be equally clear, those accusations were then investigated by an independent third-party over the course of a two-month process and involved dozens of interviews that included me, the accused and countless others. Ultimately, my name was cleared. I eagerly participated in the investigation in order to demonstrate my innocence because I know my truth, and I believe in due process.\"\n\nRyan Seacrest Denies Misconduct Accusations From Former Stylist\n\n\n\n\"Yesterday, VARIETY published a salacious story that revealed the specific claims against me for the first time-even though an independent third-party investigator found insufficient evidence to support the claims,\" Seacrest added. \"Much to my dismay, Variety didn't speak with me or bother to speak with other credible witnesses or even ask for any of the evidence that was obtained during the investigation when offered, all of which clearly challenged the veracity of the claims made against me.\"\n\nHe concluded, \"This person who has accused me of horrible things tried to buy her silence by asking for money on multiple occasions--I refused. I have worked extremely hard to achieve my success and I don't take my opportunities for granted. I don't want to accuse anyone of not telling the truth but in this case, I have no choice but to again deny the claims against me, remind people that I was recused of any wrongdoing, and put the matter to rest.\"\n\nSeacrest first faced the accusations in November, prompting E! to launch an investigation. Three months later, the network said no sufficient evidence to corroborate the allegations was discovered.\n\nAn E! spokesperson said in a Feb. 1 statement, \"E! has now concluded the investigation into allegations regarding Ryan Seacrest. The investigation, conducted by outside counsel, found insufficient evidence to substantiate allegations against Seacrest. E! is committed to providing a safe working environment where everyone is treated with respect and dignity.\"\n\nE! stood by the investigation's findings in the wake of Variety's story. A statement shared yesterday read, \"E!'s investigation was extremely comprehensive and thorough. Over the course of a two month process, our outside counsel interviewed more than two dozen people regarding the allegations, including multiple separate meetings with the claimant and all firsthand witnesses that she provided. The investigator is an attorney with nearly 20 years experience and is highly regarded professionally. Any claims that question the legitimacy of this investigation are completely baseless.\"\n\nAdditionally, E! can confirm that Ryan will be hosting E!'s Live from the Red Carpet for the 2018 Oscars as scheduled.\n\nE! is owned by NBCUniversal, the parent company of this station.\n\n", "images": ["https://media.nbcmiami.com/2019/09/goodnews2-apr17.jpg?resize=850%2C478", "https://media.nbcmiami.com/2019/09/Coronavirus-Pandemic-New-York-April-17.jpg?crop=60px%2C248px%2C4296px%2C2417px&resize=850%2C478", "https://media.nbcmiami.com/2019/09/South_Florida_On_Light@3x.png?fit=627%2C120", "https://sb.scorecardresearch.com/p?c1=2&c2=6035083&cv=2.0&cj=1", "https://media.nbcmiami.com/2019/09/AP_17218211192518.jpg?resize=850%2C478", "https://media.nbcmiami.com/2019/09/SouthFlorida_On_Dark@3x-1.png?fit=627%2C120"], "top_img": "https://media.nbcmiami.com/2019/09/AP_17218211192518.jpg?resize=850%2C478", "keywords": [], "authors": ["Mckenna Aiello"], "canonical_link": "http://www.eonline.com/news/916846/ryan-seacrest-denies-sexual-harassment-allegations-to-put-the-matter-to-rest", "title": "Ryan Seacrest Denies Sexual Harassment Allegations", "meta_data": {"viewport": "width=device-width, initial-scale=1", "generator": "WordPress 5.3.2", "og": {"site_name": "NBC 6 South Florida", "type": "article", "description": "Ryan Seacrest is speaking out about the sexual harassment allegations leveled against him. One day after Variety published one woman’s account of “unwanted sexual aggression” by the television personality while working as his personal stylist, Seacrest continues to deny the claims. Seacrest shared in a statement, “Much has been said about the #MeToo and Times Up movement(s) and the importance of providing women and men with the opportunity to share their stories of workplace misconduct, in an effort to change our culture and the systemic inequalities that exist. I absolutely support this cause unequivocally and applaud all the brave souls who have come forward to share their stories.”", "title": "Ryan Seacrest Denies Sexual Harassment Allegations", "url": "https://www.nbcmiami.com/news/national-international/ryan-seacrest-denies-sexual-harassment-allegations/133240/", "image": "https://media.nbcmiami.com/2019/09/AP_17218211192518.jpg?resize=850%2C478"}, "google-site-verification": "HzcUi6Q6ShKtCzhpQt1Ib8nYsujnP87Ppt6B1_0vOR8", "fb": {"app_id": 91295312088}, "twitter": {"site": "@nbc6", "creator": "@nbc6", "description": "Ryan Seacrest is speaking out about the sexual harassment allegations leveled against him. One day after Variety published one woman’s account of “unwanted sexual aggression” by the television personality while working as his personal stylist, Seacrest continues to deny the claims. Seacrest shared in a statement, “Much has been said about the #MeToo and Times Up movement(s) and the importance of providing women and men with the opportunity to share their stories of workplace misconduct, in an effort to change our culture and the systemic inequalities that exist. I absolutely support this cause unequivocally and applaud all the brave souls who have come forward to share their stories.”", "title": "Ryan Seacrest Denies Sexual Harassment Allegations", "url": "https://www.nbcmiami.com/news/national-international/ryan-seacrest-denies-sexual-harassment-allegations/133240/", "image": "https://media.nbcmiami.com/2019/09/AP_17218211192518.jpg?resize=850%2C478"}, "article": {"opinion": "false", "content_tier": "free", "publisher": "http://www.facebook.com/NBC6SouthFlorida"}, "description": "Ryan Seacrest is speaking out about the sexual harassment allegations leveled against him. One day after Variety published one woman’s account of “unwanted...", "keywords": "inequalities, stories, aggression, culture, account, Variety, claims., sexual harassment allegation, workplace misconduct, television personality, opportunity, effort, importance, movement(s), Much, course, Times Up, #MeToo, evidence, VARIETY, evidence, cause, E!, claims, stories, investigation, process, accusations, investigation, investigation, investigation, network, claims, claims, investigation, Misconduct Accusations, NBCUniversal, claims, evidence, opportunities, allegations, allegations, claims, due process, time, any, silence, investigation, all, accusations, truth, sexual harassment allegations, name, order, innocence, occasions, money, things, veracity, dismay, success, station., network, case, matter, wrongdoing, choice, stories, truth, claims, experience, Oscars, legitimacy, investigation, television personality, workplace misconduct, opportunity, working environment, allegations, discovered.An, importance, movement(s), effort, Much, cause, investigation, claimant, allegations, story, process, wake, respect, dignity, findings, meetings, Attorney, counsel, investigator, Ryan Seacrest, sexual misconduct, spokesperson, Variety", "sailthru.title": "Ryan Seacrest Denies Sexual Harassment Allegations", "sailthru.description": "Ryan Seacrest is speaking out about the sexual harassment allegations leveled against him. One day after Variety published one woman’s account of “unwanted...", "sailthru.tags": "inequalities, stories, aggression, culture, account, Variety, claims., sexual harassment allegation, workplace misconduct, television personality, opportunity, effort, importance, movement(s), Much, course, Times Up, #MeToo, evidence, VARIETY, evidence, cause, E!, claims, stories, investigation, process, accusations, investigation, investigation, investigation, network, claims, claims, investigation, Misconduct Accusations, NBCUniversal, claims, evidence, opportunities, allegations, allegations, claims, due process, time, any, silence, investigation, all, accusations, truth, sexual harassment allegations, name, order, innocence, occasions, money, things, veracity, dismay, success, station., network, case, matter, wrongdoing, choice, stories, truth, claims, experience, Oscars, legitimacy, investigation, television personality, workplace misconduct, opportunity, working environment, allegations, discovered.An, importance, movement(s), effort, Much, cause, investigation, claimant, allegations, story, process, wake, respect, dignity, findings, meetings, Attorney, counsel, investigator, Ryan Seacrest, sexual misconduct, spokesperson, Variety", "sailthru.type": "article", "sailthru.date": "2018-02-27T18:06:39+00:00", "msapplication-TileImage": "https://media.nbcmiami.com/2019/09/cropped-NBC_South-Florida.png?fit=270%2C270"}, "movies": [], "publish_date": 1519754799.0, "source": "https://www.nbcmiami.com", "summary": ""}