{"url": "https://www.theverge.com/2017/8/8/16115254/disney-launching-streaming-service-ending-netflix-deal", "text": "Disney will end its distribution deal with Netflix and launch its own streaming service, the company announced today. It intends to launch the service in 2019.\n\nThe move is a real blow to Netflix, which secured a valuable streaming deal with Disney back in 2012 — before streaming had really taken off. The deal only kicked into effect last year, so Netflix is barely seeing any benefit here.\n\nAt the same time, it’s a natural step for Disney, which has a huge library of valuable movies and shows to offer. Disney already makes it hard to get a lot of its top movies — requiring people to purchase, rather than rent, a film for instance — so it makes sense that we’re seeing the company try to draw even bigger profits from streaming.\n\nNetflix won’t lose its Disney movies right away. Disney says it plans to cut Netflix off starting with the studio’s 2019 films, and Netflix says it’ll be able to keep all the Disney movies it gets through the end of that year. That means Netflix should be able to stream the next two Star Wars movies, but it’ll miss out on the new trilogy’s final installment. “We continue to do business with the Walt Disney Company on many fronts, including our ongoing deal with Marvel TV,” said a spokesperson for Netflix.\n\nDisney is buying most of BAMTech and will also launch an ESPN streaming service\n\nDisney’s streaming service will be built off technology from BAMTech, the MLB-founded video streaming platform. Disney was already a major investor in BAMTech, and today it’s making an even bigger investment — of $1.58 billion — giving it a 75 percent stake in the company. The acquisition still requires regulatory approval.\n\n“This acquisition and the launch of our direct-to-consumer services mark an entirely new growth strategy for the company, one that takes advantage of the incredible opportunity that changing technology provides us to leverage the strength of our great brands,” Disney CEO Bob Iger said in a statement accompanying the announcements.\n\nThe Disney-branded streaming service will be the “exclusive home in the US for subscription-video-on-demand viewing,” and will kick off with films including Toy Story 4 and the sequel to Frozen. “Original movies, TV shows, [and] short-form content” will be added to the service, and it’ll be filled out with older movies from Disney and Pixar’s catalog and shows from Disney’s TV channels.\n\nIn addition to creating a streaming service for Disney movies and TV shows, the company will also launch a streaming service exclusively for ESPN, targeted for a launch early next year. Disney is promising about “10,000 live regional, national, and international games and events a year,” with individual sports packages available as well. Disney plans to sell both of its subscription services directly to consumers.\n\nESPN has increasingly been a point of concern for Disney. The channel is expensive, which has led consumers and cable providers to look for ways to drop it from their package or otherwise cut costs. Being able to sell it straight to consumers lets Disney tap into the market of cord cutters who have been missing out on sporting events, while potentially increasing the amount of money it makes per subscriber.\n\nThe loss of Disney films will be a major disappointment for Netflix subscribers and will certainly make it harder for Netflix to find new ones. But it’s something that Netflix seems to have been prepared for. The streaming service has reinvented itself over the past several years to become a home for original shows and movies, and this move from Disney both underscores the urgency of that and how correct a move it was.\n\nJust this week, Netflix announced the acquisition of a comic book publisher that’s already seen several successful film adaptations; in light of today’s announcement, it’s easy to see why Netflix would want to lock down even more original properties for itself.\n\nAs for Disney, it’s hard to imagine its movie and TV streaming service not being a success. If it’s the only way to stream Disney’s catalog, it’ll be a must-have for a lot of parents — plus fans of Marvel and Star Wars, properties that Disney keeps mining with no end in sight. The big downside for consumers is that this is yet another streaming service you’ll have to pay for just to watch everything you want to watch. But given the size of Disney, it was bound to happen eventually.", "images": ["https://cdn.vox-cdn.com/thumbor/i3BDei9WvPme-uAikxt6P9adJJg=/0x312:3000x2000/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/56110197/483168600.0.jpg", "https://cdn.vox-cdn.com/thumbor/00xUCtSk2PBcJOmCdvFgTep3P8E=/0x0:3000x2000/1200x800/filters:focal(1196x997:1676x1477)/cdn.vox-cdn.com/uploads/chorus_image/image/56110199/483168600.0.jpg"], "top_img": "https://cdn.vox-cdn.com/thumbor/i3BDei9WvPme-uAikxt6P9adJJg=/0x312:3000x2000/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/56110197/483168600.0.jpg", "keywords": [], "authors": ["Jacob Kastrenakes", "Aug"], "canonical_link": "https://www.theverge.com/2017/8/8/16115254/disney-launching-streaming-service-ending-netflix-deal", "title": "Disney to end Netflix deal and launch its own streaming service", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "apple-mobile-web-app-title": "Verge", "article": {"publisher": "http://www.facebook.com/verge", "published_time": "2017-08-08T16:18:44-04:00", "modified_time": "2017-08-08T16:18:44-04:00"}, "author": "Jacob Kastrenakes", "style-tools": "https://www.theverge.com/style/community/372/e8584abde1fc118cbb44d8e68e9902bc/tools.css", "google-site-verification": "IucFf_TKtbFFH8_YeFyEteQIwYPdANM1R46_U9DpAr4", "msvalidate.01": "D385D0326A3AE144205C298DB34B4E94", "ahrefs-site-verification": "1e57a609922037a3fbdc1c22efd7334113f174f15608f37e1b8538a7b4ce64c3", "description": "Disney will end its distribution deal with Netflix and launch its own streaming service, the company announced today. It intends to launch the service in 2019.\nThe move is a real blow to Netflix,...", "og": {"description": "Disney will end its distribution deal with Netflix and launch its own streaming service, the company announced today. It intends to launch the service in 2019.\nThe move is a real blow to Netflix,...", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/i3BDei9WvPme-uAikxt6P9adJJg=/0x312:3000x2000/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/56110197/483168600.0.jpg", "alt": "Traditional Media Companies Hit With Big Losses On Wall Street", "height": 900, "width": 1600}, "site_name": "The Verge", "title": "Disney to end Netflix deal and launch its own streaming service", "type": "article", "url": "https://www.theverge.com/2017/8/8/16115254/disney-launching-streaming-service-ending-netflix-deal"}, "fb": {"app_id": 549923288395304}, "twitter": {"card": "summary_large_image", "url": "https://www.theverge.com/2017/8/8/16115254/disney-launching-streaming-service-ending-netflix-deal", "title": "Disney to end Netflix deal and launch its own streaming service", "description": "Disney will end its distribution deal with Netflix and launch its own streaming service, the company announced today. It intends to launch the service in 2019.\nThe move is a real blow to Netflix,...", "image": {"identifier": "https://cdn.vox-cdn.com/thumbor/i3BDei9WvPme-uAikxt6P9adJJg=/0x312:3000x2000/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/56110197/483168600.0.jpg", "alt": "Traditional Media Companies Hit With Big Losses On Wall Street"}, "site": "verge"}, "sailthru.title": "Disney to end Netflix deal and launch its own streaming service", "sailthru.tags": "general,the-verge,front-page,business,entertainment,disney,netflix,culture", "sailthru.description": "Disney will end its distribution deal with Netflix and launch its own streaming service, the company announced today. It intends to launch the service in 2019.\nThe move is a real blow to Netflix,...", "sailthru.date": "2017-08-08T16:18:44-04:00", "sailthru.image.full": "https://cdn.vox-cdn.com/thumbor/i3BDei9WvPme-uAikxt6P9adJJg=/0x312:3000x2000/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/56110197/483168600.0.jpg", "sailthru.image.thumb": "https://cdn.vox-cdn.com/thumbor/kQQkaKIP71loiuvNXkaeHNk3wRw=/436x0:2436x2000/200x200/cdn.vox-cdn.com/uploads/chorus_image/image/56110197/483168600.0.jpg", "msapplication-TileImage": "https://cdn.vox-cdn.com/uploads/chorus_asset/file/7396113/221a67c8-a10f-11e6-8fae-983107008690.0.png", "msapplication-TileColor": "#393092", "outbrainsection": "culture"}, "movies": [], "publish_date": 1502121600.0, "source": "https://www.theverge.com", "summary": ""}