{"url": "https://www.elle.com/culture/movies-tv/news/a43263/the-oc-drama-behind-the-scenes-cast/", "text": "The OC aired its finale ten years ago yesterday—that's February 22, 2007, just in case you need the specific date to make you really feel old. The show wrapped up on a high note, having been given a new lease of life in its fourth season by the death of tragic girl-next-door Marissa Cooper (Mischa Barton), and the impact her absence had on the rest of the Newport Beach gang.\n\nBut overall, its four-year run was a rocky one. The show's meteoric overnight success, combined with very young stars and scarcely-older showrunners—co-creator Josh Schwartz was about to turn 27 when the show premiered—was a surefire recipe for some backstage drama. Here are 10 tidbits about what went down behind the scenes.\n\n1. The producers initially hated Adam Brody…\n\nIf you're a die-hard OC fan, you've probably heard this one before. Schwartz was extremely unimpressed by the man who would be Seth Cohen when he first came into audition. \"It was pilot season and he was going on dozens of auditions,\" Schwartz explained to The Daily Beast, \"and he didn't really bother to learn the lines, so he just came in and I was like, 'What scene is he doing? Is this even from our show?'\" Our casting director, Patrick Rush, told me, \"I'm telling you, this Adam Brody is very special.\" And I thought, \"That guy? I kind of hated that guy. He didn't even learn any of the words!\" But he came back, learned the words, and he was great.\"\n\n2 … and the network hated Seth Cohen.\n\nThough he became arguably the show's breakout character, the early draft of Seth was so disliked by Fox that they quite literally wanted to abort him. \"I was told at one point that they really did not like the Seth character early on in the pilot process,\" Schwartz told TV Guide, \"and the way the note was relayed to me was, 'Could the Cohens have had an abortion?' In the network's defense, the character of Seth may have been a little bit more annoying than he ended up being ultimately, but it was a bit harsh.\"\n\nRachel Bilson (Summer) and Adam Brody (Seth) Getty Images\n\n3. Mischa Barton gave some pretty unfortunate interviews early in the show's run.\n\nIn her defense, Barton was young and maybe didn't realize that \"cool\" can easily come off as callous in print. But a 2004 interview she gave to ELLE became legendary online, for reasons that will become obvious once you read its most famous passage:\n\nWhen I ask what kind of fan mail she receives, Barton says, \"It's fascinating the stories you'll get.\" For example? In a weary, singsong voice, she says, \"Like, 'I was in the war and my leg got cut off and I'm in the hospital. I'll never walk again, but all I can do is lie in bed and watch your TV show.' It's just—stuff you get.\" She shrugs and takes another bite of swordfish. I ask if that letter came from a soldier in Iraq, and she says, \"I don't remember. But that one was big on the list of, like, heart-wrenching stories. Are you joking? The O.C.? Surely there are more important things in life than my stupid show. But, like, okay, if you feel that way. I'm like, that's\"—she chuckles and rolls her eyes—\"nice.\"\n\n\n\nThankfully for Barton, this interview was published in a pre-social media age, when outrage didn't spread so easily and offensive off-the-cuff remarks didn't stick to celebrities in the same way they do now. Still. Yikes.\n\nFox\n\n4. There's a reason why season three was so bad.\n\nTwo words: network notes. \"We had a new network president who wanted us to introduce a more adult soap storyline,\" says Schwartz, suggesting that the success of Desperate Housewives at the time pushed the network in that direction. \"I think we just started making a different show, we were trying to make a show that delivered on the melodrama.\"\n\nAnother note was that the show needed a new adult female character—hence the addition of Jerri Ryan's Charlotte, who tried to scam money from Kirsten in the most boring storyline in OC history—and more teen drama. The latter led to the addition of tormented surfer Johnny (Ryan Donowho), a mind-bogglingly terrible character who inexplicably took over the show for much of season three. Schwartz has since been open about both mistakes: \"We were just told we had to add an adult female character, it went nowhere, and we had no plan for it, and it just didn't fit the show. And then we went down the wrong road with this kid playing Johnny, it was just flat. All of a sudden, everything the show mocked, it kind of became.\"\n\n5. The young cast developed some serious attitude problems.\n\nTate \"Jimmy Cooper\" Donovan got very, very real about the toxic atmosphere on set in an interview with Vulture. \"By [season three], the kids had developed a really bad attitude,\" he said. \"They just didn't want to be doing the show anymore. It was pretty tough; they were very tough to work with.\"\n\nOlivia Wilde (Alex) and Mischa Barton (Marissa) Fox\n\n6. Marissa and Alex's romance was botched by the network.\n\nIf Marissa's lesbian dalliance with Olivia Wilde's Alex seemed more like a cynical ratings ploy than a fully formed storyline, that's likely because of the way the episodes were marketed and edited. \"The first time they kissed, it was actually [a] very romantic and surprising and kind of touching kiss,\" Schwartz recalled, \"and they made us cut like three-quarters of it out, so what you got was like this peck, basically. And then you saw the commercials for it, like, 'Don't miss the last five seconds for the hottest kiss ever!' And you're like, 'We're dead.' Not only did we lose all credibility with the way we were selling it, but what we were told to do was not what we were selling.\"\n\n7. The cast deliberately forgot their lines.\n\nAt least according to Cam Gigandet, who played Marissa's bad-boy hookup Volchok in season three, they did. \"Those kids were fucking miserable,\" he recalled. \"They were just—they would not remember their lines on purpose. They were young.\"\n\nAnd he's not done breaking your heart yet: \"Ben McKenzie was kind of mean to me. I hadn't done anything at that point and he was a little bit of an ass. But I love him. I think he's a great actor and I love Southland.\" McKenzie himself has acknowledged that his behavior wasn't always great, explaining that finding that level of success at such a young age can make you \"weirdly feel guilty about it, which means you behave like a jerk... That's my theory, anyway. I'm not trying to explain it away at all, but of course you make mistakes, but that's how you learn and you get better.\"\n\nFox\n\n8. Barton and Bilson's relationship was reportedly less than friendly.\n\nRumors about young actresses supposedly hating each other are a dime a dozen—just ask the casts of Glee, Gossip Girl, et al—and should be taken with a pinch of salt. But in the case of Barton and Bilson, there's some actual evidence of beef. In that same memorable ELLE interview quoted above, Barton threw some low-key but quietly spectacular shade at Bilson, who had begun the show as a guest star before being rapidly upgraded to a series regular.\n\n\"She's way more overtly sexual than I am,\" Barton said of Bilson. \"She is so petite and I am so tall and lanky. I think I'd be scared of having her voluptuousness. I like being understatedly sexy.\"\n\nOof. More recently, around the time of The OC's tenth anniversary in 2013, Bilson's rep came out to deny tabloid rumors that she hated Barton: \"Rachel has no ill will toward Mischa—she has and will continue to wish her well.\"\n\n9. Several of the young actors felt the show was holding them back from movie stardom.\n\nPart of the reason The OC's young actors developed such bad attitudes was that they felt hemmed in by the show that had made them famous. \"When you achieve a certain amount of success, you want to be doing something else,\" Donovan said. \"I mean, one of [the actors] turned to me and said, \"This show is ruining my film career,\" and he had never done a film before.\"\n\nBarton has said as much herself, when Us Weekly asked her about a possible reunion in 2013. \"It doesn't feel right,\" she said. \"Before The OC, I was on track to do some great films…and one thing happens and then I got this mega-stardom all from this show. It is what it is, but I'm not looking to get sucked back into the limelight of it.\"\n\n10. Marissa's shocking death was spoiled—by Mischa Barton.\n\nIt's not often that a major twist gets ruined for you by the star of the show in question. The ending of season three's finale, in which Marissa dies suddenly and brutally in Ryan's arms, was successfully kept under wraps despite all the rumors that were flying about an impending death…until Barton herself went on Access Hollywood and confirmed that the rumors were true.\n\n\"It's true. My character dies,\" she said. \"I think the show is moving in a new direction—this was a great opportunity for everyone. My character has been through so, so much and there's really nothing more left for her to do. So, I hope this fulfills everything that the fans want and everything that the people wanted for our characters.\" She was incredibly gracious about the decision, which makes it all the weirder that she would choose to ruin the experience for all those fans.", "images": ["https://hips.hearstapps.com/ell.h-cdn.co/assets/17/08/2560x1280/landscape-1487866777-gettyimages-2479218.jpg?resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/08/2560x1280/landscape-1487866777-gettyimages-2479218.jpg?resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.elle.com/culture/movies-tv/news/a43263/the-oc-drama-behind-the-scenes-cast/", "title": "Best 'The OC' Behind the Scenes Drama", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "ELLE", "title": "10 Times 'The OC' Was Just as Dramatic Behind the Scenes as It Was on TV", "description": "This show was a Marissa Cooper-level hot mess.", "url": "https://www.elle.com/culture/movies-tv/news/a43263/the-oc-drama-behind-the-scenes-cast/", "image": {"identifier": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/08/2560x1280/landscape-1487866777-gettyimages-2479218.jpg?resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "modified_time": "2018-07-29 05:22:15", "published_time": "2017-02-23 06:48:00", "section": "Movies & TV 2020", "opinion": "false"}, "twitter": {"site": "@ELLEmagazine", "card": "summary_large_image", "image": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/08/2560x1280/landscape-1487866777-gettyimages-2479218.jpg?resize=640:*"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "title": "Best 'The OC' Behind the Scenes Drama - 10 Year Anniversary of The OC Finale", "description": "This show was a Marissa Cooper-level hot mess.", "keywords": "Mischa Barton,Adam Brody,Ben McKenzie,Rachel Bilson", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/08/1600x1600/square-1487866777-gettyimages-2479218.jpg?resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Culture,culture,movies-tv,Ben McKenzie,Adam Brody,mischa barton,rachel bilson", "sailthru.date": "2017-02-23T18:48:00Z", "sailthru.image.full": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/08/2560x1280/landscape-1487866777-gettyimages-2479218.jpg", "sailthru.image.thumb": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/08/1600x1600/square-1487866777-gettyimages-2479218.jpg", "sailthru.socialtitle": "10 Times 'The OC' Was Just as Dramatic Behind the Scenes as It Was on TV", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1487803680.0, "source": "https://www.elle.com", "summary": ""}