{"url": "https://www.thecut.com/2018/04/andrew-morton-meghan-markle-book-best-details.html", "text": "Meghan Markle. Photo: Chris Jackson/AFP/Getty Images\n\nWith the upcoming royal wedding between Prince Harry and Meghan Markle just a month and a half away, it’s no surprise that countless books about the Suits star’s life story have been coming out. The books range from those written by actual royal correspondents to, well, adult coloring books. But the latest book, Meghan: A Hollywood Princess (which comes out April 16), was actually written by Andrew Morton — the biographer to whom Princess Diana herself leaked scandalous information to in the ’90s. And, an excerpt from the biography was published this weekend by the Sunday Times.\n\nHere, the most interesting details from Morton’s book about Markle that have been released so far:\n\nMarkle practiced drinking tea before she had tea with the Queen.\n\nIn an incredibly relatable move (well, as relatable as it can be where royals are concerned), Markle apparently had a practice run of a drinking tea before she actually sat down with Queen Elizabeth for an extremely British tea afternoon. According to Us Weekly, Morton’s book states that Markle visited Rose Tree Cottage in Pasadena, California, for afternoon tea in the fall of 2017. There, she learned all the proper royal tea protocols (lol), including how to crook her finger while holding her cup and saucer. Eventually, her first solo tea meeting with the queen and her corgis went well. Phew.\n\nMarkle and the queen on Commonwealth Day. Photo: BBC\n\nShe allegedly ended her first marriage by mailing her engagement and wedding rings to her ex.\n\nAlthough Markle is from Los Angeles, she moved to New York and then Toronto several years ago to film Suits. During that time, she got married Trevor Engleson, who stayed behind in California. According to Morton, Markle eventually decided to end their two-year marriage “out of the blue.” She apparently sent her wedding and engagement rings back to Engleson in the mail. But … let’s not feel too bad for the guy, since he’s now producing a TV sitcom about a man whose ex marries a British royal — which is tacky of him, to say the least.\n\nMarkle admired Princess Diana growing up.\n\nLike many young people growing up in the ’80s and ’90s, it seems Markle admired Princess Diana, at least according to Morton (per the Sun). However, the actress wasn’t as enamored with the fact that Diana was a fancy royal, as she was inspired by her passion for helping others. “According to family friends, she was intrigued by Diana, not just for her style, but for her independent humanitarian mission, seeing her as a role model,” Morton writes.\n\nShe knew to avoid Donald Trump long ago.\n\nBack when she was a struggling actress, Markle worked as a “briefcase girl” on the game show Deal or No Deal. When Donald Trump appeared on the program in 2006 and 2007, Markle was apparently one of many girls who avoided the future president. Per Morgan:\n\n“One guest caused quite the frisson: Donald Trump, then making a guest appearance to cross-promote The Apprentice. He gave girls his card and invited them to play golf at one of his courses. Fellow briefcase girl Tameka Jacobs told me, ‘He was super-creepy, but some girls were attracted to money and power and took his number. Meghan was one of the girls who gave him a wide berth.’”\n\nShe and Prince Harry had each other at “Hello.”\n\nPlease excuse the Jerry MaGuire reference — it is not mine; apparently it’s a scientifically accurate description of what happened on the royal couple’s first blind date. You see, according to Morton, Markle and her ginger prince felt such an instant and “intoxicating” connection that “they had each other at ‘Hello,’” which is why they had two back-to-back dates when they first met.\n\nMeghan Markle and Prince Harry. Photo: Karwai Tang/WireImage\n\nMarkle is very, very distantly related to a long-ago Scottish royal.\n\nUsing Ancestry.com may just go a long way if you’re a commoner trying to marry into the British royal family. According to Morton, Markle is a descendant of a Scottish warlord Robert the Bruce, who eventually became King Robert I of Scotland. “It is possible to trace a direct line through 25 generations to Robert I of Scotland, perhaps the most colorful of all Scottish kings,” Morton writes, adding that this means she has a “trickle” of royal blood. And, uh, apparently a “trickle” of that is better than nothing.", "images": ["https://pyxis.nymag.com/v1/imgs/f0a/3b4/61b0e57b80d18d9ec91a78056b6a733073-21-harry-meghan-queen.rhorizontal.w710.jpg", "https://pyxis.nymag.com/v1/imgs/0da/6a3/acc3a4da4b0db3eb648f313e668d7c0672-04-10-2020-social-cover-issue-8.w90.h120.2x.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/04/03/03-meghan-markle.w1200.h630.jpg", "https://pixel.nymag.com/imgs/fashion/daily/2018/04/03/03-meghan-markle.w700.h700.jpg", "https://pyxis.nymag.com/v1/imgs/718/df2/d44051dbe2a49c49d7055a4a45a11f8125-1-meghan-harry.h473.w710.jpg"], "top_img": "https://pixel.nymag.com/imgs/fashion/daily/2018/04/03/03-meghan-markle.w1200.h630.jpg", "keywords": [], "authors": ["Lisa Ryan"], "canonical_link": "https://www.thecut.com/2018/04/andrew-morton-meghan-markle-book-best-details.html", "title": "The Best Details From the New Meghan Markle Biography", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "The Best Details From the New Meghan Markle Biography", "url": "https://www.thecut.com/2018/04/andrew-morton-meghan-markle-book-best-details.html", "description": "She rehearsed drinking tea before meeting the Queen and avoided Donald Trump years ago.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2018/04/03/03-meghan-markle.w1200.h630.jpg", "site_name": "The Cut", "type": "article"}, "twitter": {"title": "The Best Details From the New Meghan Markle Biography", "description": "She rehearsed drinking tea before meeting the Queen and avoided Donald Trump years ago.", "image": "https://pixel.nymag.com/imgs/fashion/daily/2018/04/03/03-meghan-markle.w600.h315.2x.jpg", "card": "summary_large_image", "creator": "@lisarya", "site": "@TheCut"}, "article": {"published_time": "2018-04-03T10:36:20.761-04:00", "tag": "royal wedding 2.0, meghan markle, keeping up with the royals, culture, celebrity, andrew morton", "publisher": "https://www.facebook.com/cut"}, "description": "Here are the best details from Andrew Morton’s book about Meghan Markle, “Meghan: A Hollywood Princess,” including her first meeting with Harry, how she admired Princess Diana, how her first marriage ended, and rehearsing drinking tea with the Queen.", "sailthru.tags": "royal wedding 2.0, meghan markle, keeping up with the royals, culture, celebrity, andrew morton", "author": "Lisa Ryan", "fb": {"app_id": 343556435754245}, "type": "Article", "vertical": "The Cut", "apple-mobile-web-app-title": "The Cut", "application-name": "The Cut", "msapplication-TileColor": "#ff5656", "msapplication-TileImage": "https://assets.nymag.com/media/sites/thecut/icon.144x144.png"}, "movies": [], "publish_date": 1522766180.761, "source": "https://www.thecut.com", "summary": ""}