{"url": "https://www.cheatsheet.com/entertainment/scientology-things-we-know-about-the-danny-masterson-rape-allegations.html/", "text": "Leah Remini has made big waves over the years by talking openly about Scientology. After leaving the church, she has talked about the weird and allegedly illegal actions that take place within the organization. Her latest venture is the TV series Leah Remini: Scientology and the Aftermath, which came out with some huge claims.\n\nNow, partly due to her investigation, it has come out that five women alleged that That ’70s Show star Danny Masterson raped them and that the organization helped cover it up. So what exactly is going on? Here are 11 things we know about the Danny Masterson rape allegations, including one victim believing the LAPD is compromised (No. 8).\n\n1. Multiple women accused the actor of sexually assaulting them\n\nDanny Masterson | Anna Webber/Getty Images for Netflix Danny Masterson | Anna Webber/Getty Images for Netflix\n\nThis shocking news comes from three women who accused the That ’70s Show actor of raping and sodomizing them in the early 2000s. The story broke on Tony Ortega’s blog, The Underground Bunker, which primarily covers Scientology.\n\nThe alleged victims are also Scientologists, who claim they were pressured to not go to the police after the crimes. This isn’t the first time Scientology has been accused of covering up such situations.\n\nOn Leah Remini: Scientology and the Aftermath, ex-Scientologist Amy Scobee claimed that her boss at the Scientology Celebrity Centre took advantage of her sexually when she was 14 years old. After this was reported to the organization, no one told her parents or the police. In response to the claim, Scientology leaders said Scobee “cannot be trusted as a reliable source.”\n\nNext: Remini’s involvement with Victim A.\n\n2. Remini reportedly encouraged Victim A to file a report\n\nLeah Remini on Leah Remini Scientology and the Aftermath | A&E Leah Remini on Leah Remini Scientology and the Aftermath | A&E\n\nThe actress has been working closely with multiple people in order to tell their Scientology horror stories, so it’s not surprising that she encouraged a woman who some are calling “Victim A” to file a police report. This move created a domino effect, making it so the other claims are taken more seriously.\n\nNext: How Scientology threatened Victim A.\n\n3. Victim A claims that Masterson raped her in 2001\n\nDanny Masterson as Hyde on That ’70s Show. | 20th Century Fox Television Danny Masterson as Hyde on That ’70s Show. | 20th Century Fox Television\n\nThe woman who has come forward reportedly dated the actor for six years. She claims the actor anally raped and injured her when she was unconscious in December of 2001. She didn’t come forward initially because of Scientology’s threat that she would be labeled a “suppressive person.” This means that those in the organization will no longer be allowed to contact her, which has allegedly led to many families being torn apart.\n\n“They threatened me that if I ever told anyone or reported him to the police that I would be declared a ‘suppressive person’ and lose everything and everyone,” she wrote to LAPD chief Charlie Beck. “Then they put me on a massive ethics program as punishment. My rapist was not punished at all. They didn’t even call him to talk about it. I ended up breaking up with him two months later.”\n\nNext: Victim B has the case closed after Scientology members contradict her.\n\n4. Victim B filed a report in 2004\n\nDanny Masterson arrives at the Rampart special screening. | Christopher Polk/Getty Images Danny Masterson arrives at thespecial screening. | Christopher Polk/Getty Images\n\nVictim B’s alleged rape happened in 2003 and the woman filed in 2004. The investigation was closed after witnesses who are members of Scientology contradicted her testimony. Now that Victim A has come forward, the case with Victim B has been reopened.\n\nNext: The police report says Victim B was choked by Masterson.\n\n5. Victim B was reportedly raped at a party\n\nDanny Masterson poses backstage during the 25th annual EMA Awards. | Rich Polk/Getty Images Danny Masterson poses backstage during the 25th annual EMA Awards. | Rich Polk/Getty Images\n\nA witness claimed that Masterson was the DJ at a party and that he reportedly gave the victim a drink before getting in the pool with her and two other women. Later that night, there was allegedly a commotion upstairs. The witness then said, “I saw [Victim B], she was coming toward me, her hair was still drying. She looked terrified. And she said, ‘Oh my God, Danny just raped me.’ She was freaking out and crying.”\n\nAccording to the police report, Victim B also said that Masterson choked her and assaulted her while she was unconscious.\n\nNext: Does a police officer put the blame on Victim B?\n\n6. A police officer might have put the blame on Victim B\n\nDanny Masterson | Frazer Harrison/Getty Images Danny Masterson | Frazer Harrison/Getty Images\n\nThe witness said that everyone at the party was a Scientologist. After the party, the witness was reportedly called into Scientology’s Celebrity Centre to talk about the incident. “I was told in no uncertain terms by the ethics officer that [Victim B] had too much to drink,” the witness told The Underground Bunker, “and Danny had done nothing wrong. He said she was being ‘handled.’ And I remember thinking, OK, but what’s happening to Danny?”\n\nNext: Another police report is filed.\n\n7. Victim C also filed a police report and a fourth woman has come forward\n\nDanny Masterson at the 32nd Annual People’s Choice Awards After Party. | Frazer Harrison/Getty Images Danny Masterson at the 32nd Annual People’s Choice Awards After Party. | Frazer Harrison/Getty Images\n\nThe third woman who has come forward is being referred to as Victim C. She also filed a report with the police about her alleged assault. There is less information about Victim C’s case at this time.\n\nA fourth woman has also come forward claiming the actor raped her over the course of the investigation, according to the Los Angeles Times.\n\nNext: Is the LAPD compromised?\n\n\n\n8. Victim A believes the LAPD is compromised\n\nDanny Masterson and wife, Bijou Phillips, sitting next to each other at an event. | Araya Diaz/Getty Images Danny Masterson and wife, Bijou Phillips, sitting next to each other at an event. | Araya Diaz/Getty Images\n\nVictim A reportedly doesn’t totally trust the police department to take these cases seriously. She wrote a letter to LAPD Captain William Hayes and LAPD Chief Charlie Beck about her frustration with their organization and the way that they’re handling the case. According to The Underground Bunker:\n\nI was told that my report was transferred out of the Wilcox location into downtown due to known leaks within the Hollywood division when I received a phone call from Detective Reyes later that day … She warned me that I am not to speak to any other officer or anyone claiming to be an officer.\n\nNext: How Remini is trying to push the cases forward.\n\n9. Remini has tried to push the cases forward\n\nLeah Remini as herself in Leah Remini: Scientology and the Aftermath. | A&E Leah Remini as herself in Leah Remini: Scientology and the Aftermath. | A&E\n\nAccording to The Underground Bunker, Remini said:\n\nI met with the LAPD. I met with Detective Reyes, and I told her these victims deserve to be heard. I pointed out to her that there was a framed picture of a Scientologist on their wall, actor Michael Peña. Do you know what that says to a young Scientologist who comes here to seek justice? My experience with the LAPD has not been good. I asked her to do the right thing by these girls, and I told her that the world is watching.\n\nNext: Masterson’s rep firebacks at Remini.\n\n10. Masterson’s rep accused Remini of being behind the allegations\n\nLeah Remini as herself on Leah Remini: Scientology and the Aftermath. | A&E Leah Remini as herself on Leah Remini: Scientology and the Aftermath. | A&E\n\nLeah Remini is still very much an enemy of Scientology since she wrote a book about her experiences and has a show about the organization. So it’s no surprise that when responding to these serious allegations, the actor’s representative focused on Remini.\n\nWe are aware of [the alleged victim’s] 16-year-old allegations. It was only after [the alleged victim] was in contact with Leah Remini that she made allegations of sexual assault by Mr. Masterson. The alleged incident occurred in the middle of their six-year relationship, after which she continued to be his longtime girlfriend. Significantly, during their long relationship, she made numerous inconsistent claims that she was previously raped by at least three other famous actors and musicians. When Danny ended the relationship she continued to pursue him, even making threats to beat up his current wife, Bijou Phillips, unless she left him. In fact, we are informed by the church that the only demand [the alleged victim] made of the church after Danny broke up with her was asking for their help to intervene so the breakup would not be permanent. We are aware also that approximately 14 years ago, a woman referred to in the blog made allegations of sexual assault that the LADP interviewed numerous witnesses and determined the claim had no merit. Based on reading the anti-Scientology blog that posted this story, these false allegations appear to be motivated to boost Leah Remini’s anti-Scientology television series since [the alleged victim] only came forward after connecting with Leah Remini.\n\nNext: The case has stalled despite the evidence.\n\n11. The case has stalled despite evidence\n\nDanny Masterson | Anna Webber/Getty Images for Netflix Danny Masterson | Anna Webber/Getty Images for Netflix\n\nThe months-long investigation into multiple allegations of rape against actor Danny Masterson stalled in November. Sources told the publication that the case has failed to move forward, despite that the Los Angeles County district attorney reportedly discovered compelling evidence in their investigation.\n\nNext: The allegations have cost him a job.\n\n12. Netflix fired Masterson from his show\n\nThe Ranch | Netflix The Ranch | Netflix\n\nAfter facing increasing pressure and backlash from the public, Netflix fired Masterson from his comedy, The Ranch, effective immediately.\n\n“As a result of ongoing discussions, Netflix and the producers have written Danny Masterson out of The Ranch,” a Netflix spokesperson tells TVLine. “[Monday] was his last day on the show, and production will resume in early 2018 without him.”\n\nNext: More allegations\n\n13. There is a fifth accuser speaking out\n\nBobette Riales is the fifth woman to accuse Masterson of sexual assault. | Bobette Riales is the fifth woman to accuse Masterson of sexual assault. | Bobette Riales via Twitter\n\nOn Dec. 20, 2017, a fifth woman accused Masterson of rape. Bobette Riales, whose Twitter bio states that she is the “owner of GothamDistrict and QueenBs Cuisine,” tweeted her own statement, claiming that she was “repeatedly raped” by Masterson.\n\nChrissie Carnell-Bixler, another victim who has spoken out, was tagged in the tweet, with Riales saying she “applaud[s] her strength” and calling herself and Carnell-Bixler “sisters.” The other woman responded in kind, telling Riales “You are amazing. I’m so proud of you.”\n\nNext: The show must go on.\n\n14. A new character\n\nDax Shepard | Frazer Harrison/Getty Images Dax Shepard | Frazer Harrison/Getty Images\n\nIn March 2018, it was reported that Dax Shepard will be appearing as a recurring guest star on The Ranch. While not technically taking the place of Masterson, Shepard will likely help to fill the gap left by the exit of Masterson’s Rooster.\n\nAdditional reporting by Becca Bleznak.\n\nFollow Nicole Weaver on Twitter @nikkibernice.\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2017/03/Danny-Masterson-Djing.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/03/Danny-Masterson-Rampart-special-screening.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/08/GettyImages-693606870.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/12/bobette-riales.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/08/GettyImages-693606868.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/01/leah-remini-on-leah-remini-scientology-and-the-aftermath.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/08/GettyImages-693606870.jpg", "https://www.cheatsheet.com/wp-content/uploads/2017/03/That-70s-Show.png?x62514", "https://www.facebook.com/tr?id=1447317708679797&ev=PageView&noscript=1", "https://www.cheatsheet.com/wp-content/uploads/2017/03/Danny-Masterson-headphones.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/01/leah-remini-black-shirt.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/12/Dax-Shepard.png?x62514", "https://www.bizographics.com/collect/?pid=4708&fmt=gif", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.cheatsheet.com/wp-content/uploads/2017/03/Danny-Masterson-and-Bijou-Phillips.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2017/03/Danny-Masterson.png?x62514", "https://www.cheatsheet.com/wp-content/uploads/2016/01/f968977e95cfab9a_Ranch_103_Unit_2237_R_COMP_CROP.xxxlarge_2x.jpg?x62514", "https://www.cheatsheet.com/wp-content/uploads/2016/11/leah-remini.jpg?x62514"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2017/08/GettyImages-693606870.jpg", "keywords": [], "authors": ["Nicole Weaver"], "canonical_link": "https://www.cheatsheet.com/entertainment/scientology-things-we-know-about-the-danny-masterson-rape-allegations.html/", "title": "Everything We Know About the Danny Masterson Rape Allegations", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "google-site-verification": "ktiOxQqv9Xlcn7qytDrsOVw_-MQ9S7bo2G5Iyfu-I9M", "robots": "NOODP,NOYDIR", "syndication-source": "https://www.cheatsheet.com/entertainment/scientology-things-we-know-about-the-danny-masterson-rape-allegations.html/", "p": {"domain_verify": "936edf149ecbc3171d89b1f25f05e153"}, "description": "Danny Masterson is facing accusations of rape from multiple women. Here's what we currently know about the allegations.", "og": {"locale": "en_US", "type": "article", "title": "Everything We Know About the Danny Masterson Rape Allegations", "description": "Danny Masterson is facing accusations of rape from multiple women. Here's what we currently know about the allegations.", "url": "https://www.cheatsheet.com/entertainment/scientology-things-we-know-about-the-danny-masterson-rape-allegations.html/", "site_name": "Showbiz Cheat Sheet", "updated_time": "2018-06-15T19:34:58-04:00", "image": {"identifier": "https://www.cheatsheet.com/wp-content/uploads/2017/08/GettyImages-693606870.jpg", "secure_url": "https://www.cheatsheet.com/wp-content/uploads/2017/08/GettyImages-693606870.jpg"}}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "tag": "sexual misconduct", "section": "Entertainment", "published_time": "2018-06-15T19:33:00-04:00", "modified_time": "2018-06-15T19:34:58-04:00"}, "twitter": {"card": "summary_large_image", "description": "Danny Masterson is facing accusations of rape from multiple women. Here's what we currently know about the allegations.", "title": "Everything We Know About the Danny Masterson Rape Allegations", "site": "@cheatsheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2017/08/GettyImages-693606870.jpg", "creator": "@cheatsheet"}, "fb": {"admins": 826582091}, "generator": "WordPress 5.3.2", "position": 2}, "movies": [], "publish_date": 1529105580.0, "source": "https://www.cheatsheet.com", "summary": ""}