{"url": "https://www.etonline.com/megyn-kelly-slams-jane-fonda-after-actress-shades-her-over-plastic-surgery-question-94796", "text": "Megyn Kelly clapped back at Jane Fonda after the actress recently said she was \"not that good an interviewer.\"\n\nIn September, the 80-year-old Oscar winner went on Megyn Kelly Today, and appeared to take offense when the 47-year-old journalist asked about her having \"work done.\"\n\nDuring a Q&A with Variety over the weekend, Fonda addressed the awkward interview with Kelly -- which also included the actress' Our Souls at Night co-star, Robert Redford -- admitting that she was displeased with the plastic surgery inquiry.\n\n\"It wasn’t like I was upset. I was stunned. It was so inappropriate,\" she said. \"It showed that she’s not that good an interviewer.\"\n\nOn Monday's Megyn Kelly Today, Kelly defended her line of questioning and noted that she hasn't been the only one to ask Fonda about plastic surgery.\n\n\"Well, the truth is most older women look nothing like Fonda, who is now 80. And if Fonda really wants to have an honest discussion about older women's cultural face, then her plastic surgery is tough to ignore,\" Kelly declared on her morning show. \"She knows this, and that is why, to her credit, she’s discussed her cosmetic surgery pretty much everywhere before coming on our show.\"\n\nShe added, \"Apparently when she came here, however, again to promote her film about aging, I was supposed to discern that this subject was suddenly off-limits.\"\n\nKelly went on to declare that she has \"no regrets\" about asking Fonda about cosmetic procedures, noting that it was her intention to give the star a \"chance to empower other women, young and old, on a subject which she purports to know well.\"\n\nThe shade didn't stop there. Kelly went on to tell viewers that she's \"not in the market for a lesson from Jane Fonda on what is and is not appropriate,\" because her \"name is synonymous with outrage.\"\n\nFurther calling out Fonda's controversial past, Kelly continued, \"Look at her treatment of our military during the Vietnam war. Many of our veterans still call her 'Hanoi Jane' thanks to her radio broadcasts which attempted to shame American troops. She posed on an anti-aircraft gun used to shoot down our pilots.\"\n\nNot holding back, Kelly added, \"She called our POW's 'hypocrites and liars' and referred to their torture as understandable. She had to apologize years later for that gun picture, but not for the rest of it.\"\n\nKelly concluded, \"By the way, she still says she's not proud of America. So, the moral indignation is a little much. She put her plastic surgery out there. She said she wanted to discuss the plight of older women in America, and honestly, she has no business lecturing anyone on what qualifies as offensive.\"\n\nAs Kelly pointed out, Fonda has spoken about her plastic surgery in the past. In 2015, she told W magazine, \"I did have plastic surgery. I'm not proud of the fact that I've had it. But I grew up so defined by my looks. I was taught to think that if I wanted to be loved, I had to be thin and pretty. That leads to a lot of trouble.\"\n\nRELATED CONTENT:\n\nSavannah Guthrie Defends Megyn Kelly's First Week on 'Today' and That Awkward Jane Fonda Interview\n\nJane Fonda Jokingly References Megyn Kelly During ‘Today’ Show Interview\n\nMegyn Kelly Clarifies Fat-Shaming Comments After Backlash\n\nJane Fonda Snaps at Megyn Kelly for Plastic Surgery Questions -- Watch! This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Embed Code Restart\n\nRelated Gallery", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACwAAAAAAQABAAA=", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-04/screen_shot_2020-04-18_at_8.23.51_pm.png?h=15457932&itok=UZv8IvJp", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2020-04/1280yara.jpg?h=c673cd1c&itok=T4Qtg6pb", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2020-03/300vk.jpg?h=6c83441f&itok=a49clbwF", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-01/fonda_kelly.jpg?h=c673cd1c&itok=exAaUYZf"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-01/fonda_kelly.jpg?h=c673cd1c&itok=exAaUYZf", "keywords": [], "authors": ["Jackie Willis"], "canonical_link": "https://www.etonline.com/megyn-kelly-slams-jane-fonda-after-actress-shades-her-over-plastic-surgery-question-94796", "title": "Megyn Kelly Slams Jane Fonda After Actress Shades Her Over Plastic Surgery Question", "meta_data": {"article": {"opinion": "false"}, "title": "Megyn Kelly Slams Jane Fonda After Actress Shades Her Over Plastic Surgery Question | Entertainment Tonight", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/megyn-kelly-slams-jane-fonda-after-actress-shades-her-over-plastic-surgery-question-94796", "title": "Megyn Kelly Slams Jane Fonda After Actress Shades Her Over Plastic Surgery Question", "description": "On Monday's 'Megyn Kelly Today,' the journalist defended her interview with the 80-year-old star.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-01/fonda_kelly.jpg?h=c673cd1c&itok=exAaUYZf", "width": 1280, "height": 720}}, "robots": "index", "apple-mobile-web-app-capable": "yes", "twitter": {"card": "summary_large_image", "description": "On Monday's 'Megyn Kelly Today,' the journalist defended her interview with the 80-year-old star.", "title": "Megyn Kelly Slams Jane Fonda After Actress Shades Her Over Plastic Surgery Question", "site": {"identifier": "@etnow", "id": 23603092}, "creator": "Jackie Willis‍", "url": "https://www.etonline.com/megyn-kelly-slams-jane-fonda-after-actress-shades-her-over-plastic-surgery-question-94796", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-01/fonda_kelly.jpg?h=c673cd1c&itok=exAaUYZf"}, "description": "On Monday's 'Megyn Kelly Today,' the journalist defended her interview with the 80-year-old star.", "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "keywords": "News, Megyn Kelly, Megyn Kelly TODAY, Jane Fonda", "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}