{"url": "www.mercurynews.com/2018/06/13/angelina-jolie-must-have-crossed-serious-lines-in-brad-pitt-custody-fight-experts-say/", "text": "Despite what you see in legal dramas, judges presiding over divorce and custody disputes are reluctant in real life to tell parents how to parent their kids, family law experts say.\n\nThey certainly don’t like to threaten a parent with a loss of custody rights unless they have serious concerns about how that parent is conducting him or herself.\n\nFor that reason, a judge’s reported rebuke of Angelina Jolie and his ruling that she’s at risk of losing primary custody of her six children to Brad Pitt is remarkable, according to Christopher Melcher, a Los Angeles-based family law attorney who has worked with a number or high-profile clients.\n\n“The court generally expects parents to make the best decisions for their children and family, but when a parent is proving they’re not acting in that way, the court will start imposing sanctions,” Melcher told this media organization.\n\nMelcher, who is not associated with the case, added that it’s pretty “rare” for a judge to tell a parent he or she could lose custody if a certain behavior doesn’t change. “I imagine there were some pretty serious warning signs before the judge made this ruling,” he said.\n\nAccording to documents obtained by the website The Blast, the actress, director and humanitarian needs to do a much better job than she has of fostering her children’s relationship with Pitt. The couple, who split in September 2016, share children Maddox, 16; Pax, 14; Zahara, 13; Shiloh, 12; and twins Vivienne and Knox, 9.\n\nThe documents make it sound as though Jolie, 42, has not cooperated in allowing Pitt, 54, to spend time with the children this summer or in letting him have easy and unmonitored cell phone and text message contact with them.\n\nMelcher said the ruling from the retired Los Angeles County Superior Court judge, who likely was retained by both parties to resolve the case, is “consistent with a finding of parent alienation.”\n\nWhile Melcher said he hasn’t seen the relevant documents, he said that the quotes from them make it sound as though the finding came after extensive evaluation, which estimated that the children weren’t “estranged” from Pitt because of harmful things he has done but were “alienated” from him because of actions of Jolie.\n\nIn his ruling, the judge has said that the children could be harmed by “not having a relationship with their father.” If things don’t change, the judge added, there would be consequences for Jolie.\n\n“If the minor children remain closed down to their father and depending on the circumstances surrounding this condition, it may result in a reduction of the time they spend with (Jolie) and may result in the Court ordering primary physical custody to (Pitt),” the ruling said.\n\nDavid Glass, another family law attorney, agreed that the judge’s ruling is unusual but must have seemed necessary. In an interview with People magazine, he said: “It’s a rare case where the court will find that someone alienated the kids. It takes a lot to move the court past estrangement into alienation, but once it’s determined that one parent is alienating the kids, the court has no choice but to jump in and make pretty strong orders right away.”\n\nA spokesperson for Jolie slammed news about the judge’s ruling, calling it a “misleading leak that is not in the best interests of the children.”\n\n“From the start, Angelina has been focused only on their health and needs, which is why it was so important that this last court hearing be conducted privately,” the spokesperson said in a statement to Vanity Fair.\n\nWith regard to the spokesperson’s contention that the documents are “confidential” or “sealed,” Melcher said that California law makes many family law proceedings public, even if the parties involved have chosen to have their case resolved outside the courtroom.\n\nFollowing the couple’s nasty, high-profile split, Pitt was investigated by multiple agencies after Jolie alleged that he had a drinking problem and was abusive to their children. Jolie filed for divorce in September 2016, shortly after Pitt got into some kind of altercation with their oldest son, Maddox, on a private plane returning from Europe. The allegations triggered multiple investigations, including by the FBI, that ultimately exonerated Pitt.\n\nIn May 2017, Pitt revealed in an interview with GQ that he had come to terms with his daily habit of relying on substances, mostly pot or alcohol, to “run from his feelings.” Pitt wouldn’t describe what he had gone through in the wake of his breakup as a mid-life crisis. But he acknowledged to GQ that the divorce had left him in the middle of “an unraveled life, figuring out how to mend it back together.”\n\nIn the year since, the couple have continued to finalize their custody arrangements and divorce. Recently, there have been reports that the globe-trotting Jolie has come to resent Pitt for “essentially forcing her to settle down in Los Angeles with the kids,” Us Weekly reported in May.\n\nLast year, Jolie purchased Cecile B. DeMille’s lavish former estate in the Los Feliz neighborhood of Los Angeles. Her $25 million home is “just down the street” from Pitt’s estate in the same neighborhood, reports say. That proximity has allowed the children to visit their father “a few times a week” — when everyone is in in town.\n\nTensions seemed to grow in the past few weeks as the estranged couple tried to finalize their summer plans. Jolie reportedly hoped to have the children with her in London, where she’s filming the sequel to her blockbuster film “Maleficent.” Pitt, meanwhile, had reportedly arranged his work schedule so he could be based in Los Angeles and spend time with his children there.\n\nThe judge’s ruling sought to work out a summer schedule, with the children dividing their time between London and Los Angeles. TMZ reported that Pitt currently is in London. According to the judge’s order, he is allowed to spend an increasing amount of time with his children each day in London through July 17. After that, the children return to Los Angeles, where they will be in their father’s custody. While the children are in Pitt’s care, Jolie is only allowed to call them one time per day and at a time agreed upon by both parents, according to the documents.\n\nMeanwhile, the judge ruled that Pitt can have increased access to his children via phone and text, the Blast reported. He ordered Jolie to provide Pitt with the cell phone number of each child, and to allow him to call whenever he wants. The court also bars her from reading the children’s text messages with Pitt or from giving out a number to a phone that she secretly monitors.", "images": ["https://i0.wp.com/www.mercurynews.com/wp-content/uploads/2018/05/bradpitt_27.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1", "https://www.mercurynews.com/wp-content/uploads/2017/09/angelina_5.jpg?w=1024&h=683", "https://i0.wp.com/www.mercurynews.com/wp-content/uploads/2018/04/jolieknox.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1", "https://www.mercurynews.com/wp-content/mu-plugins/jetpack/modules/sharedaddy/images/loading.gif", "https://i0.wp.com/www.mercurynews.com/wp-content/uploads/2017/07/maddox31.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1", "https://i2.wp.com/www.mercurynews.com/wp-content/uploads/2018/04/jolieknoxpitt1.jpg?w=620&crop=0%2C0px%2C100%2C9999px&ssl=1", "https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2017/09/angelina_5.jpg?w=1024&h=683", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2018/06/13/angelina-jolie-must-have-crossed-serious-lines-in-brad-pitt-custody-fight-experts-say/", "title": "Angelina Jolie’s parental choices must have really worried judge overseeing Brad Pitt custody fight, experts say", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "description": "A judge's reported rebuke of Angelina Jolie in her custody dispute of Brad Pitt is 'rare,' legal expert says.", "generator": "WordPress 5.4", "wp-parsely_version": "1.14", "fb": {"pages": 63095136336}, "google-site-verification": "jvnaFa4kq5tUDhFMQZ84bDI74A2qnu0gfhxZjZXlkko", "og": {"type": "article", "title": "Angelina Jolie’s parental choices must have really worried judge overseeing Brad Pitt custody fight, experts say", "url": "https://www.mercurynews.com/2018/06/13/angelina-jolie-must-have-crossed-serious-lines-in-brad-pitt-custody-fight-experts-say/", "description": "Angelina Jolie’s actions regarding Brad Pitt’s access to their children must have raised ‘serious warning signs’ for a judge to threaten her with loss of custody, family law…", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2017/09/angelina_5.jpg?w=1024&h=683", "width": 1024, "height": 683}, "locale": "en_US"}, "article": {"published_time": "2018-06-13T15:59:15+00:00", "modified_time": "2018-06-13T23:06:19+00:00"}, "twitter": {"site": "@mercnews", "text": {"title": "Angelina Jolie’s parental choices must have really worried judge overseeing Brad Pitt custody fight, experts say"}, "image": "https://www.mercurynews.com/wp-content/uploads/2017/09/angelina_5.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1528819200.0, "source": "http://www.mercurynews.com", "summary": ""}