{"url": "https://thegrapevine.theroot.com/kanye-west-thought-kim-kardashian-would-divorce-him-bec-1827134089", "text": "Kim Kardashian West and Kanye West Photo : Larry Busacca ( Getty Images )\n\nIf you care, it turns out that Kanye West may have been facing some serious repercussions at home after his infamous slavery comments, believing that his wife, Kim Kardashian West, might have divorced him because of his callous (not to mention misinformed) words.\n\nAdvertisement\n\nIn an interview with the New York Times, the rapper spoke a little more in-depth about the song “Wouldn’t Leave” on his latest album, Ye, in which he suggested that his TMZ appearance and subsequent comments put his marriage in jeopardy.\n\n“There was a moment where I felt like after TMZ, maybe a week after that, I felt like the energy levels were low, and I called different family members and was asking, you know, ‘Was Kim thinking about leaving me after TMZ?’” he said. “So that was a real conversation.”\n\nAdvertisement\n\nWho could forget that interview last month when West put his whole entire ass-leg in his mouth?\n\n“When you hear about slavery for 400 years ... for 400 years? That sound like a choice,” he said during his conversation with Ms. Respectability Politics, Candace Owens.\n\n“Like … you was there for 400 years and it’s all of y’all?” he added, pouring a little more salt into the already festering wound.\n\nAdvertisement\n\nTurns out Kim didn’t vibe with that at all, not that you would know it with the Kardashians’ carefully curated image. Kim stood by her husband’s side without a murmur of dissent throughout the whole ordeal as well as the release of his new album.\n\n“Kim and Kanye have a solid relationship, even with what’s going on right now,” a source told E ! News at the time. “She loves and supports her husband. Even if they have differences in views and opinions, she knows his heart.”\n\nAdvertisement\n\nAs for Kanye himself, in the Times interview, he attempted to clean up his projectile vomit himself, claiming that he just said that it “sounded” like a choice, not that he said it actually was a choice. Semantics, people!\n\n“I said the idea of sitting in something for 400 years sounds—sounds—like a choice to me. I never said it’s a choice. I never said slavery itself—like being shackled in chains—was a choice,” he said. “That’s why I went from slave to 400 years to mental prison to this and that. If you look at the clip, you see the way my mind works.”\n\nAdvertisement\n\nStill, the artist said that he “learned so much” from the incident.\n\n“ I learned about the context of the idea of the word ‘slave.’ I didn’t take it in that context. I think that my personality and energy mirrors Nat Turner, or it had in the past, but that showed me that also that Nat Turner approach would land me in the same place Nat Turner landed, and that I would be legendary but also just a martyr,” he said. “But I guess we’re all martyrs eventually, and we’re all guaranteed to die.”\n\nAdvertisement\n\nAnd if he could reframe his comments today, well ...\n\n“I wouldn’t frame a one-liner or a headline. What I would say is actually it’s literally like I feel like I’m in court having to justify a robbery that I didn’t actually commit, where I’m having to somehow reframe something that I never said. I feel stupid to have to say out loud that I know that being put on the boat was—but also I’m not backing down, bro,” the artist added. “What I will do is I’ll take responsibility for the fact that I allowed my voice to be used back to back in ways that were not protective of it when my voice means too much.\n\nAdvertisement\n\n“Wearing the [Donald Trump] hat, because my voice is unprotected, and I believe that the black community wants to protect my voice. By me saying ‘slave’ in any way at TMZ left my voice unprotected. So it’s not a matter of the facts of if I said that exact line or not; it’s the fact that I put myself in a position to be unprotected by my tribe,” he said.", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/i0mxahzc3x30wouirsba.jpg"], "top_img": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/i0mxahzc3x30wouirsba.jpg", "keywords": [], "authors": [], "canonical_link": "https://thegrapevine.theroot.com/kanye-west-thought-kim-kardashian-would-divorce-him-bec-1827134089", "title": "Kanye West Thought Kim Kardashian Would Divorce Him Because of His ‘Slavery Was a Choice’ Comments: Report", "meta_data": {"google-site-verification": "0h5mbA9rkZ-QI-vGJ0j8rPKcttrKWOTw-gtBoyuO-_k", "ir-site-verification-token": "-1270174611", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0,maximum-scale=10.0", "ROBOTS": "INDEX, FOLLOW", "msapplication-square70x70logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/efwyyktzi0a3tvjdgowk.png", "msapplication-square150x150logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_200,q_80,w_200/efwyyktzi0a3tvjdgowk.png", "keywords": "Kanye West, Kim Kardashian, Kanye West slavery was a choice, Kanye West divorce, The Grapevine", "news_keywords": "Kanye West, Kim Kardashian, Kanye West slavery was a choice, Kanye West divorce, The Grapevine", "twitter": {"url": "https://thegrapevine.theroot.com/kanye-west-thought-kim-kardashian-would-divorce-him-bec-1827134089", "card": "summary_large_image", "site": "@TheRoot", "title": "Kanye West Thought Kim Kardashian Would Divorce Him Because of His ‘Slavery Was a Choice’ Comments: Report", "description": "If you care, it turns out that Kanye West may have been facing some serious repercussions at home after his infamous slavery comments, believing that his wife, Kim Kardashian West, might have divorced him because of his callous (not to mention misinformed) words.", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/i0mxahzc3x30wouirsba.jpg"}, "description": "If you care, it turns out that Kanye West may have been facing some serious repercussions at home after his infamous slavery comments, believing that his wife, Kim Kardashian West, might have divorced him because of his callous (not to mention misinformed) words.", "og": {"title": "Kanye West Thought Kim Kardashian Would Divorce Him Because of His ‘Slavery Was a Choice’ Comments: Report", "type": "article", "url": "https://thegrapevine.theroot.com/kanye-west-thought-kim-kardashian-would-divorce-him-bec-1827134089", "description": "If you care, it turns out that Kanye West may have been facing some serious repercussions at home after his infamous slavery comments, believing that his wife, Kim Kardashian West, might have divorced him because of his callous (not to mention misinformed) words.", "locale": "en_US", "site_name": "The Grapevine", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/i0mxahzc3x30wouirsba.jpg"}, "fb": {"app_id": 280492615405243}}, "movies": [], "publish_date": null, "source": "https://thegrapevine.theroot.com", "summary": ""}