{"url": "https://www.tampabay.com/10-days-of-taylor-every-guest-on-taylor-swifts-1989-tour-ranked/2251474", "text": "(Welcome to 10 Days of Taylor, our epic countdown to the epic finale of the most epic pop tour of all time: Taylor Swift's 1989 Tour, stopping Halloween Night at Raymond James Stadium. For all of our Taylor Swift coverage, click here.)\n\n\n\nIf there's an overarching story to Taylor Swift's summer North American our in support of 1989, it's her staggering guest list.\n\nIt seems like every morning, the world wakes up to headlines of Swift trotting out some new member of her so-called #Squad to duet, dance or just hang out and just have fun. Just last night in Miami, Swift brought out Ricky Martin, Pitbull and Dwyane Wade.\n\nThe truth is, not every 1989 World Tour stop has featured a surprise guest. Of the 60-plus festival and headlining shows she's played since May 15, around 25 featured Swift and Swift alone. Not that there's anything wrong with that.\n\nWhen you scan the list in full, it's amazing how much territory Swift's #Squad covers — pop, rap, rock, country, even actors, comedians, athletes and models. Of course, not all celebrities are created equal — there are A-listers, B-listers, C-listers and D-listers. Being a part of Swift's #Squad automatically bumps you up several notches, but still, everyone has their place in the world of entertainment.\n\nWith that said, we decided to rank all 72 guest stars from the North American dates on Swift's 1989 World Tour, leading up to the tour's finale on Saturday in Tampa.\n\nSome of our reasoning is self-evident — no one would argue, for example, that Justin Timberlake is NOT a bigger star than MTKO. Some is based on what each celebrity actually did on stage with Swift. There's a big difference between just walking out and waving, and belting out a huge hit as a one-night-only duet, so you will find this list heavily weighted toward live performances. And some of it is pure personal preference. Some of you actually might like MKTO better than Justin Timberlake. So be it. You do you, playa. We ain't mad.\n\nReady? We've got 72 blank spaces ahead of us. Let's write some names.\n\n\n\n72. Kobe Bryant: Trotting out Kobe Bryant at the Staples Center: Fine, no problem. But having him present Taylor with a banner reading \"Taylor Swift: Most Sold Out Performances\" was unnecessarily and eye-rolling. Which, to be honest, kind of made Bryant the perfect person to do it.\n\n71. Dwyane Wade: On this list, Wade and Bryant are more or less a pick 'em. Wade presenting Swift with a customized Heat jersey in Miami was also unnecessary, but somehow less tacky than Bryant raising a banner to the rafters.\n\n70. Matt LeBlanc: Did you know Matt LeBlanc has more Emmy nominations than all but one of his fellow Friends? The only Friend with more is much, much higher on this list.\n\n69. Hailee Steinfeld: She didn't perform, only walked out and waved. But the True Grit star does have an Oscar nomination. That's worth, like, eight Emmy nominations.\n\n68.-67. Russell Wilson and Ciara: Impossible to separate them. Wilson is a god in Seahawk Nation, so he got more applause when they walked out together in Seattle. Ciara would be the bigger star anywhere else (and would rank much higher on this list if she'd actually been asked to sing).\n\n66. Chris Rock: It's fitting that Rock walked out with LeBlanc, because it seemed like neither of them knew exactly what they were doing there, awkwardly strutting out on Swift's catwalk during Style. Maybe they should've had Rock tell a few jokes during a costume change.\n\n65. Little Mix: Finally, we get to some music. Unfortunately, this X Factor-winning girl group is a much bigger deal in their native England than in Santa Clara, Calif., where Swift brought them out to sing Black Magic.\n\n64. Leona Lewis: Another British artist with a so-so U.S. following. Great voice, and Bleeding Love is a pretty good song, but this was still a strange pairing.\n\n63. MKTO: Hey, it's Walt from Lost! And that other guy. Classic is such a fun song, though, that this must've been fun to see live.\n\n62. Mariska Hargitay: It's so adorable that Emmy-winning actress Hargitay, 51 — after whose Law & Order: SVU character Swift named her cat, Olivia Benson — has become an honorary member of Taylor Swift's #Squad. Speaking of...\n\n61.-52. Lily Aldridge, Cara Delevingne, Lily Donaldson, Gigi Hadid, Martha Hunt, Karlie Kloss, Shawn O'Pry, Behati Prinsloo, Andreja Pejic, Candice Swanepoel: You could make a case that Swift's pretty pals should be at the bottom of this list. What, after all, do they really add to any concert? (To quote Saturday Night Live: \"I think she invites them on stage and they, like, walk around for a minute or something.\") But love them or hate them, the #Squad are part and parcel of the 1989 experience. You simply are not truly experiencing 2015 Taylor Swift unless she's surrounded by supermodels. It's the truest distillation of what this artist is all about at this moment in her life. (Shawn O'Pry, Swift's Wildest Dreams co-star, gets no bonus points for being the lone male model in her #Squad.)\n\n51. Heidi Klum: Klum gets bumped a notch above the rest of Swift's supermodel besties because she's HEIDI FREAKING KLUM.\n\n50. Haim: Here's an unfortunate theme on Swift's 1989 Tour: Wasted opportunities. The indie-rocking sisters of Haim opened several shows on this tour, which is all well and good — they're incredibly cool, they write super-catchy songs, and they seem like they're having all the fun in the world. So how does Swift thank them? Not by letting them perform a full song of their own, but by having them sing and dance backup for another special guest (No. 15 if you want to skip ahead). Lots of fun, but a wasted opportunity nonetheless.\n\n49. The Band Perry: Reports of Taylor Swift's self-imposed exile from the world of country music have been greatly exaggerated. Look at this list and you'll see a ton of country stars. The Band Perry strapped on some guitars for a performance of If I Die Young in Kentucky. It was fine.\n\n48. Echosmith/Sydney Sierota: Cool Kids is a sweet and catchy song, and 18-year-old Sierota makes an adorable kid-sis counterpart to Swift. She is, however, the only guest to sing the same song at two different tour stops — Echosmith performed on June 12 in Philadelphia, Sierota came solo in Columbus, Ohio — so it loses a few points for its lack of uniqueness.\n\n47. Andy Grammer: As you'll see, Swift had no Bad Blood when it came to inviting her fellow Song of Summer 2015 contenders on stage. How much you enjoyed her and Andy Grammer's performance of Honey, I'm Good depends mainly on how much you like Honey, I'm Good in general. So ... we're slotting in the lower middle of this list.\n\n46. Nico and Vinz: Am I Wrong was a Song of Summer candidate from 2014, not 2015. But it's still much better song than Honey, I'm Good.\n\n45. Kelsea Ballerini: See, now, this is interesting! Kelsea Ballerini, 22, is in some ways the new Taylor Swift, a likeable blond country singer-songwriter who's one of Nashville's most intriguing young artists. Swift is only three years older, but did not hesitate to bring Ballerini on stage to sing Love Me Like You Mean It in Nashville. Is she acting as a mentor, or simply keeping her future rivals close? We may never know!\n\n44. Serayah: If you're going to bring out a cast member from Empire, this is probably a safer bet than Terrence Howard. Cookie, on the other hand, would've made our Top 10.\n\n43. Tove Lo: The Swedish singer feels much newer on the scene than Swift, thanks to her breakout summer hit Talking Body, but she's actually two years older. Who knew?\n\n42. Avril Lavigne: Complicated was a massive (and inretrospect, underrated) hit, one that in many ways ushered in a modern era of youthful, spunky and addictive pop-rock. Not only was it nice to see Swift bring her out in San Diego, it was nice to see Lavigne period, following her battle with Lyme disease.\n\n41. Little Big Town: One of the biggest missed opportunities on this list. In Pittsburgh, Swift brought out one of the hottest country acts around to sing their Grammy-winning hit Pontoon. Which is fine and all. But what they SHOULD have done is sing Girl Crush, the biggest and most talked-about country song of 2015, by far.\n\n40. Ryan Tedder: OneRepublic's Counting Stars is a perfectly energetic fit for Swift's 1989 Tour. It might've been nice to have Tedder also sit in on Welcome To New York and I Know Places, two 1989 tracks he co-wrote.\n\n39. Lena Dunham: After walking out on stage with Swift and her statuesque friends, the millennial feminist hero had a bit of a self-image crisis. \"On most days, I feel really great and fine about my body, but I don't think standing next to, like, three supermodels or so is anything even the most confident woman needs to do,\" she said afterward.\n\n38. Dierks Bentley: Swift and Bentley displayed pretty great chemistry on Every Mile a Memory in Kansas City. Bentley deserves extra credit simply for not doing Drunk On a Plane.\n\n37. Ellen DeGeneres: Leave it to Ellen to make one of the most memorable entrances on Swift's 1989 Tour, strutting out in a sparkly dress-suit inspired by Swift's wardrobe, and engaging in a fun bit of wordless physical comedy.\n\n36. Julia Roberts: It was fun seeing the Oscar winner do her cool-mom dance in Santa Clara alongside No. 26 on this list. Swift TOTALLY should've had the crowd sing I Say a Little Prayer.\n\n35. Steven Tyler: I Don't Want to Miss a Thing is nowhere close to Aerosmith's best song. But bringing Tyler out to duet on this Armageddon power ballad speaks to Swift's dedication to all things '90s. For that, we salute her, even if everyone would've rather heard Walk This Way.\n\n34. John Legend: Yeah, yeah, All Of Me. Honestly, it seems like Legend will just do this song for anyone who asks. He probably lugs a piano around for that very purpose.\n\n33. Fifth Harmony: Worth It was another bona fide summer hit, which puts this American X Factor girl group way ahead of the British one at No. 65.\n\n32. Charli XCX: The British wildcard's Boom Clap is another of those stadium-sized pop jams that feels right in Taylor Swift's America. There's real potential here for some sort of good cop/bad cop joint tour.\n\n31. Jason Derulo: One of the hardest-working performers in pop joined Swift to sing Want to Want Me, one of the most irresistable songs of summer. Despite Swift's co-sign, it never rose higher than No. 5 on the Hot 100.\n\n30. Omi: Apparently Swift has every Song of Summer 2015 candidate on speed dial.\n\n29. Sam Hunt: With Taylor safely out of Nashville, Hunt is country's latest crossover sensation, so it made sense to have them duet on Take Your Time. (House Party would've been a more fun choice.)\n\n28. St. Vincent: One of the coolest women in music — and girlfriend of Swift's model pal Cara Delevingne — deserved more to do than just strum a guitar alongside Swift and fellow guest star Beck in Los Angeles. Holler back when Swift joins St. Vincent on stage to sing Digital Witness or Birth In Reverse.\n\n27. Keith Urban: Only a handful of artists have performed more than one song with Swift on this tour, and one of them is Urban, who did John Cougar, John Deere, John 3:16 and Somebody Like You in Toronto. He's an A-lister, and this was a canny move; with the poppy John Cougar, Urban seems to be reaching for some of the same pop fans Swift did on Red.\n\n26. Joan Baez: Why, Taylor, why? Why would you bring iconic folk singer Joan Baez to the stage, only to have her dance backup on Style? Why not bridge multiple generations by inviting her to perform Diamonds & Rust or Blowin' In the Wind? It's impressive that Baez even came out to begin with, but still ... oh, what could've been.\n\n25. Dan Reynolds of Imagine Dragons: Swift knows what's up. Even if you're sick of Radioactive, you can't deny it's is one of the best live rock songs in recent memory, even without the rest of Imagine Dragons backing Reynolds up on percussion.\n\n24. Nick Jonas: You think a stadium full of more than 100,000 Swifties wouldn't lose their mind when a Jonas Brother struts out to sing Jealous? Think again.\n\n23. Ellie Goulding: Taylor Swift has few peers in the pop world — Beyonce, Katy Perry, maybe Lady Gaga. A notch below them you have Demi Lovato, Selena Gomez and Ariana Grande. Just below them — but with a bit more crossover appeal, thanks to her EDM collaborations and festival appearances — is Goulding, who joined Swift to sing Love Me Like You Do. It still felt like quite a moment.\n\n22. Rachel Platten: You want to talk about moments — hearing Platten sing her uber-empowering summer anthem Fight Song in front of tens of thousands of people had to be a totally inspirational experience.\n\n21. Pitbull: Mr. Worldwide is also Mr. Florida, so you know he had to come out to play in the Sunshine State. We were hoping he'd be on the guest list in Tampa, but alas, Miami got Give Me Everything. Miami gets everything!\n\n20. Wiz Khalifa: Swift should've invited more rappers onto her 1989 Tour. It's not like Khalifa is hitting the road with Charlie Puth, so why not bring him out to rap while you sing the hook to See You Again? Problem solved with grace.\n\n19. Selena Gomez: If the pop music industry unveiled a \"25 under 25\" list, both Swift and her BFF Gomez would be on it. Teaming up for Good For You in L.A. was inevitable.\n\n18. Natalie Maines: The Dixie Chicks' Goodbye Earl must've influenced countless boy-problem songs in Swift's early catalog, so the fact that Maines joined her for this rendition in Los Angeles was a pure delight.\n\n17. Walk the Moon: If we're just talking '80s-inspired pop songs, Shut Up and Dance is better than anything on 1989. Perhaps knowing she'd been beaten, Swift invited Walk the Moon to perform it live, electrifying Gillette Stadium in Foxborough, Mass. If you went to this show, there's a good chance you left humming this song instead of Shake It Off.\n\n16. Ricky Martin: Here's another one we were hoping might show up in Tampa instead of Miami. Those lucky South Floridians got to see Swift do Livin' La Vida Loca with Martin, which perfectly suits her '90s-loving M.O. on this tour.\n\n15. Nelly: By law, if you're performing in St. Louis, you have to have Nelly come out and sing Hot In Herre. The best part, though, was seeing Swift and fellow guests Haim serve as backup singers and dancers.\n\n14. Lorde: One of the most shocking — and welcome — performances of the summer. According to Swift, Lorde flew 19 hours from Auckland, N.Z., to Washington, D.C., to sing Royals in pretty much her only North American performance of 2015. Now that's friendship.\n\n13. Uzo Aduba: In July, Swift brought the Emmy-winning Orange Is the New Black star out for a walk-on at MetLife Stadium in New Jersey. Cool, right? Well, six weeks later, Aduba re-joined Swift for an actual performance in Los Angeles — a warm and powerful acoustic duet on White Horse.\n\n12. Beck: Bringing Beck onstage — especially alongside St. Vincent — automatically ups your coolness rating by six fedoras. He won this year's Grammy for Album of the Year; Swift might win next year's. Bouncy, overlooked summer single Dreams deserved the kind of mainstream spotlight Swift gave it.\n\n11. Alison Krauss: Bold move here, bringing the revered Americana singer out to duet on When You Say Nothing At All. But this happened in Nashville, a city that respects artists who embrace musicality over pop flashiness. Swift should make moves like this more often. Somebody call Emmylou Harris!\n\n10. Mary J. Blige: When you bring Mary J. Blige on stage, you can't have her sing just one song, can you? Her recent single Doubt was great, but 2001's Family Affair was the show-stopper.\n\n9. Alanis Morissette: Has it really been 20 years since Jagged Little Pill helped kick down the door for a generation of ass-kickingly honest lady songwriters? Of course avowed '90s kid Swift wanted to sing You Oughta Know with Morissette. Who wouldn't?\n\n8. Miranda Lambert: Another of the tour's most surprising cameos came in Greensboro, where Swift brought out acclaimed country queen Lambert for a crackling rendition of Little Red Wagon. It was a glimpse of what might've been had Swift really leaned in on country music.\n\n7. Fetty Wap: A decade from now, he may prove to be a flash in the pan. But no one can take the summer of 2015 away from Fetty Wap. Trap Queen was an undeniable hit, and so it was inevitable that the Patterson, N.J. croon-rapper would cross paths with Swift's unstoppable summer tour. If this turns out to be the only time Taylor Swift sings about slinging crack, it'll have been well worth it.\n\n6. The Weeknd: Four years ago it would have been utterly laughable to picture mysterious, druggy R&B singer the Weeknd peforming alongside country chanteuse Taylor Swift. Just goes to show how catchy Can't Feel My Face truly is.\n\n5. Ed Sheeran. She's the world's biggest female pop star. He's the world's biggest male pop star. Two things keep this from ranking higher: (1) It happened at a festival, where duets like these are supposed to happen; and (2) Swift and Sheeran are old buddies and tourmates who have done this thing before. Still, how lovely must it've been to hear them sing Tenerife Sea in person?\n\n4. Lisa Kudrow: HOW. How, Taylor, did you convince Lisa Kudrow to perform her Friends mini-hit, Smelly Cat, in character as Phoebe Buffay? This is the most delightfully random moment of the 1989 World Tour, hands down. Next she ought to have Nancy Cartwright come out and do the Bartman.\n\n3. U.S. Women's National Soccer Team. Here's the ACTUAL #Squad of summer. As much as Swift's celebrity walk-ons tend to bug us, bringing out the entire USWNT less than a week after they won the World Cup in thrilling fashion was the ultimate power move.\n\n2. Justin Timberlake: You could quibble with the selection of Mirrors over, say, Rock Your Body or (hey, dream big) Bye Bye Bye. Remember when Swift freaked out at during 'N Sync's big VMAs reunion in 2013? This could've been an opportunity to let her inner 10-year-old totally fangirl out.\n\n1. Mick Jagger: One of the most famous and acclaimed rock singers of all time, singing one of the most iconic rock songs of all time, the Rolling Stones' (I Can't Get No) Satisfaction. A slam dunk No. 1, even if most of the kids in Nashville probably had no idea who he was. Maybe they should've done Moves Like Jagger instead.\n\n-- Jay Cridlin", "images": ["data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 50 50\"/%3E", "https://www.tampabay.com/resizer/FoAE6ywzmkvQfpOyfi0xvugZpow=/800x450/smart/arc-anglerfish-arc2-prod-tbt.s3.amazonaws.com/public/2YWFRWWHBUI6TBKNIBWI6S7HAY.gif"], "top_img": "https://www.tampabay.com/resizer/FoAE6ywzmkvQfpOyfi0xvugZpow=/800x450/smart/arc-anglerfish-arc2-prod-tbt.s3.amazonaws.com/public/2YWFRWWHBUI6TBKNIBWI6S7HAY.gif", "keywords": [], "authors": ["Jay Cridlin", "Entertainment Critic"], "canonical_link": "https://www.tampabay.com/10-days-of-taylor-every-guest-on-taylor-swifts-1989-tour-ranked/2251474/", "title": "10 Days of Taylor: Every guest on Taylor Swift's 1989 Tour, ranked", "meta_data": {"twitter": {"card": "summary_large_image", "title": "10 Days of Taylor: Every guest on Taylor Swift's 1989 Tour, ranked", "site": "TB_Times", "url": "https://tampabay.com/10-days-of-taylor-every-guest-on-taylor-swifts-1989-tour-ranked/2251474/", "image": "https://www.tampabay.com/resizer/FoAE6ywzmkvQfpOyfi0xvugZpow=/800x450/smart/arc-anglerfish-arc2-prod-tbt.s3.amazonaws.com/public/2YWFRWWHBUI6TBKNIBWI6S7HAY.gif"}, "og": {"image": "https://www.tampabay.com/resizer/FoAE6ywzmkvQfpOyfi0xvugZpow=/800x450/smart/arc-anglerfish-arc2-prod-tbt.s3.amazonaws.com/public/2YWFRWWHBUI6TBKNIBWI6S7HAY.gif", "type": "article", "title": "10 Days of Taylor: Every guest on Taylor Swift's 1989 Tour, ranked", "site_name": "Tampa Bay Times", "url": "https://tampabay.com/10-days-of-taylor-every-guest-on-taylor-swifts-1989-tour-ranked/2251474/"}, "pageType": "article", "title": "10 Days of Taylor: Every guest on Taylor Swift's 1989 Tour, ranked", "viewport": "width=device-width, initial-scale=1", "application-name": "Florida's favorite paper, Tampa Bay's favorite local news site", "msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "/pf/mstile-144x144.png", "msapplication-square70x70logo": "/pf/mstile-70x70.png", "msapplication-square150x150logo": "/pf/mstile-150x150.png", "msapplication-wide310x150logo": "/pf/mstile-310x150.png", "msapplication-square310x310logo": "/pf/mstile-310x310.png", "fb": {"app_id": 117591765631093, "pages": 9924394837}}, "movies": [], "publish_date": null, "source": "https://www.tampabay.com", "summary": ""}