{"url": "heavy.com/entertainment/2018/08/travis-scott-kylie-jenner-boyfriend-split/", "text": "Kylie Jenner, unlike her sisters, tries to keep her relationships and home life private, especially when it comes to her relationship with boyfriend Travis Scott and their baby, Stormi Webster. Little Stormi was born on February 1, 2018, and her parents made one of their first event debuts together at the 2017 Met Gala. So, there wasn’t a long timeline of their relationship before they got pregnant with their first child. In an interview with Vogue Australia, Jenner said that because both she and Scott are experiencing parenthood for the first time, it’s nice to learn together. Jenner explained, “We both experienced this for the first time, so I love learning together and just watching him with her. He’s so good with her and she’s really obsessed with him.”\n\nWhile Jenner likes to keep her personal life private, she does feel it’s important to address certain rumors. Over the course of her relationship with baby daddy Scott, there have been split rumors, reports that they rarely see each other, and even speculation that a bodyguard was Stormi’s real father. So, Jenner has spoken out via Vogue Australia and has confirmed that there was no break up. Jenner also said that she and Scott live together. In her Vogue Australia interview, Jenner revealed, “I’m actually scrolling through Instagram right now, and it says that me and Travis don’t live together, and so I just want to say that we never miss a night with each other, we go back and forth from my Calabasas house and the city home that we actually got together. So just if you wanted to add that in.”\n\nAfter Jenner’s Vogue Australia article came out, she personally made it clear on social media that she and Scott have not split. A Twitter user named Lisa Marie, posted a tweet online that read, “YALL. Remember how my dad is a mover, and moves all the Kardashians/Jenners?????? Well home boy spilled the tea and told me that TRAVIS SCOTT AND KYLIE SPLIT. He said they moved all of Travis’ shit out of her house. Shouts to my dad for keeping up with the Kardashian[s]. Kylie also gave my dad more tequila so it’s lit.”\n\nJenner, who is active on Twitter and Instagram, as well as other social media platforms, commented on Lisa Marie’s claim, responding online with, “Obviously fake. Shit was never moved I never gave anyone tequila.”\n\nKylie Jenner has everything that money can buy, but she still has to deal with constant rumors and negativity online. But, she tries to live peacefully, away from all the tabloid reports and haters. As for what she wants in life? She told her sister, Kendall, in her Vogue interview that she just hopes to find happiness in her relationship, friends and family.\n\nAs for Kylie Jenner’s boyfriend, Travis Scott, he is a slated performer for the 2018 MTV Video Awards, more commonly known as the VMAs. Scott is also gearing up for his Astroworld: Wish You Were Here Tour and People has reported that Jenner and baby Stormi are ready to start the tour with him.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=20567959cv=2.0&cj=1", "https://pixel.wp.com/b.gif?v=noscript", "https://1.gravatar.com/avatar/d892c01bf62335cf957945b053c2d52d?s=71&d=https%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D71&r=PG", "https://heavyeditorial.files.wordpress.com/2018/02/gettyimages-635275674_opt.jpg?quality=65&strip=all&w=780", "https://certify.alexametrics.com/atrk.gif?account=lfktn1QolK10vg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://heavyeditorial.files.wordpress.com/2018/02/gettyimages-635275674_opt.jpg?quality=65&strip=all&w=780", "keywords": [], "authors": ["Lauren Weigle"], "canonical_link": "https://heavy.com/entertainment/2018/08/travis-scott-kylie-jenner-boyfriend-split/", "title": "Travis Scott, Kylie Jenner’s Boyfriend Split Rumors: No Break Up", "meta_data": {"google-site-verification": "nfPVut3DNEWv3BaV0stQ8yOV3TeBg_TWFdQzQYaG8Qs", "robots": "noodp, noydir", "HandheldFriendly": "True", "MobileOptimized": 360, "viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "msapplication-TileColor": "#121212", "theme-color": "#121212", "description": "Kylie Jenner and her boyfriend Travis Scott have been living together with baby Stormi Webster, despite break up rumors. Jenner has addressed the split reports.", "news_keywords": "Kylie Jenner And Travis Scott Split, Kylie Jenner Travis Scott Break Up, Kylie Jenner Break Up, Travis Scott Break Up", "keywords": "kylie jenner and travis scott split, kylie jenner travis scott break up, kylie jenner break up, travis scott break up", "msvalidate.01": "D36F6DC077CF4906C4E074037A94917B", "generator": "WordPress.com", "author": "Lauren Weigle", "twitter": {"url": "https://heavy.com/entertainment/2018/08/travis-scott-kylie-jenner-boyfriend-split", "card": "summary", "site": "@heavysan", "creator": "@heavysan"}, "fb": {"admins": 1041016861, "app_id": 1103740676351644}, "article": {"publisher": "https://www.facebook.com/heavycom", "published_time": "2018-08-19T17:38:32+00:00", "modified_time": "2018-08-19T17:42:48+00:00", "author": "https://heavy.com/author/laurenweigle/", "section": "Entertainment", "tag": "Travis Scott"}, "og": {"image": {"identifier": "https://heavyeditorial.files.wordpress.com/2018/02/gettyimages-635275674_opt.jpg?quality=65&strip=all", "width": 780, "height": 439}, "site_name": "Heavy.com", "type": "article", "locale": "en_US", "url": "https://heavy.com/entertainment/2018/08/travis-scott-kylie-jenner-boyfriend-split/", "title": "Kylie Jenner & Boyfriend Travis Scott Are Living Together & Going on Tour Amid Split Rumors", "description": "Kylie Jenner and her boyfriend Travis Scott have been living together with baby Stormi Webster, despite break up rumors. Jenner has addressed the split reports."}, "application-name": "Heavy.com", "msapplication-window": "width=device-width;height=device-height", "msapplication-tooltip": "Breaking News, Sports, Entertainment, TV, Tech, Gaming & Health.", "msapplication-task": "name=Subscribe;action-uri=https://heavy.com/feed/;icon-uri=https://secure.gravatar.com/blavatar/6e68a7d5b8fce58735ab84f887ee5981?s=16", "ir-site-verification-token": 268982007}, "movies": [], "publish_date": 1534700312.0, "source": "http://heavy.com", "summary": ""}