{"url": "en.wikipedia.org/wiki/The_One_with_the_Rumor", "text": "9th episode of the eighth season of Friends\n\n\"The One with the Rumor\" is the ninth episode of the eighth season of the American television situation comedy Friends, which aired on NBC on November 22, 2001.[1] It continues the series' annual Thanksgiving-themed episode tradition, and guest-stars cast member Jennifer Aniston's then-husband Brad Pitt in the uncredited role of Will Colbert, who reveals that he and Ross (David Schwimmer) were part of an \"I hate Rachel\" club. The two of them hated Rachel Green (Aniston) and got the exchange student from Thailand to join their club. Will revealed that they spread a rumor in high school that Rachel was a hermaphrodite.\n\nThe episode was directed by Gary Halvorson and written by Shana Goldberg-Meehan.[1] It was nominated for multiple Primetime Emmy Awards, but was criticized as \"insulting\" by a national intersex education group.\n\nPlot [ edit ]\n\nMonica invites an old school friend of hers and Ross' for Thanksgiving, Will Colbert (Brad Pitt). She also tells a crestfallen Joey that she won't be cooking a turkey because of Will's, Chandler's, Rachel's and Phoebe's aversion to the poultry. Joey admonishes Monica and demands the tradition, and so Monica obliges with a monstrous bird. Throughout the episode, Joey battles the enormous turkey, eventually changing into Phoebe's maternity clothing to ease the strain on his stomach.\n\nWill arrives and is revealed to have lost an enormous amount of weight. However, he reacts very badly when learning that Rachel, who he hated in high school because of her bullying him, will be joining them for dinner. Rachel is immediately attracted to Will, unable to recognise him, but Will is openly hostile and this culminates in his proud announcement that he – and Ross – founded the \"I Hate Rachel\" club in high school and initiated a rumour that she was a hermaphrodite, which was spread throughout their entire high school. Rachel feels betrayed by Ross, until Monica reminds her that she started a rumor of her own that Ross made out with the school's 50-year-old librarian, though a horrified Ross confirms it as true. Rachel demands that Ross recant the rumour by calling everyone from school, but Monica puts them both in their place by reminding them that Rachel's rumour put Ross on the social radar, that Ross and Will's rumour had no effect whatsoever on Rachel's queen bee status, and that they're having a baby together. Will is completely dumbfounded by this revelation, but takes pleasure in the fact that Ross got Rachel pregnant but isn't going to marry her.\n\nThe episode culminates in Joey finishing off the turkey and getting the meat sweats. Despite being extremely full, Joey still had room for pie.\n\nProduction [ edit ]\n\nIt was reported by Entertainment Weekly that Pitt would don a fat suit for flashback scenes to his fat childhood,[2] though this was unfounded as Will's weight was merely referred to on screen.[3] Pitt frequently visited Aniston at the studios before and after his appearance, though he did not go onto the set for fear of distracting the audience.[4] When questioned about his appearance in the show, Pitt said it was to promote his upcoming film Spy Game, though added that he liked the series anyway.[3] The episode was taped on November 2, following four days of rehearsals.[5]\n\nReception [ edit ]\n\nAs the series finale drew close in 2004, Eric Deggans of St. Petersburg Times ranked Pitt as one of the worst guest stars in Friends: \"Stilted reactions, overly exaggerated comedy, near-palpable self-consciousness – despite his cred as a film actor, Pitt knew he was out of his depth on a sitcom stage. After five minutes' viewing, the audience did, too.\"[6] His work on set is admired by the main stars; Schwimmer recalls Pitt was \"definitely ... going against type\"[7] and Matt LeBlanc called him \"really great on the show\".[4] USA Today rates Will's line \"Look at her standing there with those yams. My two greatest enemies, Ross. Rachel Green and complex carbohydrates\" one of the best of the episode.[8]\n\nThe eponymous rumor drew criticism from the intersex community, a member of which wrote a strongly worded letter of complaint to NBC, calling the episode \"ignorant, insulting, degrading, and absolutely unprofessional\". The member urged the network to learn about intersex individuals via the Society's website and read an on-air apology before future episodes.[9]\n\nPrimetime Emmy Award nominations [ edit ]\n\nPitt was nominated for a Primetime Emmy Award for Outstanding Guest Actor in a Comedy Series for his appearance in the episode. Additionally, Nick McLean was nominated for Outstanding Cinematography for a Multi-Camera Series, while Stephen Prime was nominated for Outstanding Multi-Camera Picture Editing for a Series, for their work on the episode.[10]\n\nReferences [ edit ]", "images": ["http://en.wikipedia.org/static/apple-touch/wikipedia.png", "http://upload.wikimedia.org/wikipedia/en/thumb/9/94/Symbol_support_vote.svg/19px-Symbol_support_vote.svg.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/wikimedia-button.png", "http://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png"], "top_img": "http://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_One_with_the_Rumor", "title": "The One with the Rumor", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}