{"url": "http://blog.familytheater.org/ellie-kemper-and-stephen-colbert-talk-her-babys-catholic-baptism/", "text": "On Wednesday night, Aug. 17, Ellie Kemper, star of Netflix’s “The Unbreakable Kimmy Schmidt,” stopped by to visit a fellow Catholic on “The Late Show With Stephen Colbert,” and revealed a big milestone in the life of her one-year-old son, James.\n\nKemper and writer husband Michael Koman, who’s Jewish, were married in a Catholic ceremony — last summer, a very pregnant Kemper told Colbert that story — and like many interfaith couples, had to make a major decision when the first child came along.\n\n“We were sort of figuring out how to raise James, with what religion,” she told Colbert. “We’re going the Catholic route. He did get baptized.”\n\nKemper revealed James was baptized in May, when he was 10 months old — and she was a little concerned that he might be too big for the priest to manage. Apparently, young James did scream, but all turned out well — even when he grabbed a shard of glass at his grandparents’ house.\n\n“An hour after the baptism,” Kemper said, “I found James with a shard of glass in his hand! It was in my parents’ house …He was miraculously unhurt. I don’t know if he was testing God. I don’t know what the point was, but I mean, he turned out OK. I don’t know if it was a sign.”\n\nKemper then finished off with a bravura, more grown-up (but still clean!) rendition of the song played by her son’s favorite toy.\n\nHere’s the whole thing. Enjoy!\n\nCongrats to Ellie, Michael and James, who seems to have gotten a good start on life.\n\nImage: Courtesy CBS\n\nLearn more about Family Theater Productions’ upcoming, new and vintage productions as well as our Hollywood Outreach Programs; and, of course, you’ll find us on Facebook. Visit our YouTube and Ustream Channels for our contemporary and classic productions.", "images": ["http://blog.familytheater.org/wp-content/uploads/2014/01/Don.jpg", "http://blog.familytheater.org/wp-content/uploads/2014/03/Laura.jpg", "http://blog.familytheater.org/wp-content/uploads/2017/08/Ellie-Kemper-Stephen-Colbert.jpg", "http://blog.familytheater.org/wp-content/uploads/2013/02/Tony.jpg", "http://blog.familytheater.org/wp-content/uploads/2016/01/DSCN5197-001.jpg", "http://blog.familytheater.org/wp-content/uploads/2017/09/Adrienne-Thorne.jpeg", "http://blog.familytheater.org/wp-content/uploads/2013/01/FrDavid.jpg", "http://blog.familytheater.org/wp-content/uploads/2016/09/Korbi-Ghosh-Biggins-125.jpg", "http://blog.familytheater.org/wp-content/uploads/2018/08/Vince-Kuna.jpg"], "top_img": "http://blog.familytheater.org/wp-content/uploads/2017/08/Ellie-Kemper-Stephen-Colbert.jpg", "keywords": [], "authors": ["Kate O'Hare", "Susan Thurman"], "canonical_link": "http://blog.familytheater.org/ellie-kemper-and-stephen-colbert-talk-her-babys-catholic-baptism/", "title": "Ellie Kemper and Stephen Colbert Talk Her Baby’s Catholic Baptism", "meta_data": {"generator": "WordPress 4.7.16", "fb": {"app_id": 173514759341857}, "og": {"url": "http://blog.familytheater.org/ellie-kemper-and-stephen-colbert-talk-her-babys-catholic-baptism/", "title": "Ellie Kemper and Stephen Colbert Talk Her Baby’s Catholic Baptism", "site_name": "Faith & Family Media Blog", "description": "On Wednesday night, Aug. 17, Ellie Kemper, star of Netflix's \"The Unbreakable Kimmy Schmidt,\" stopped by to visit a fellow Catholic on \"The Late Show With Steph", "type": "article", "image": "http://66.33.221.64/wp-content/uploads/2013/01/Screen-Shot-2013-01-04-at-12.49.jpg", "locale": "en_us"}}, "movies": ["https://www.youtube.com/embed/ZEZMQQH3KiM?feature=oembed"], "publish_date": null, "source": "http://blog.familytheater.org", "summary": ""}