{"url": "https://www.cbc.ca/news/canada/british-columbia/sea-lion-drags-girl-into-water-off-steveston-docks-in-richmond-b-c-1.4126203", "text": "Port officials are lambasting the family of a young girl for \"reckless behaviour\" after she was dragged into the water by a sea lion off a dock at Steveston in Richmond, B.C.\n\nVideo not playing? Click here to watch.\n\nRobert Kiesman, chair of the Steveston Harbour Authority, said there are several signs posted at the popular tourist destination warning people not to feed the sea mammals that frequent the area.\n\n\"You wouldn't go up to a grizzly bear in the bush and hand him a ham sandwich, so you shouldn't be handing a thousand-pound wild mammal in the water slices of bread,\" Kiesman said.\n\n\"And you certainly shouldn't be letting your little girl sit on the edge of the dock with her dress hanging down after the sea lion has already snapped at her once. Just totally reckless behaviour.\"\n\nKiesman said that there are similar issues with people feeding marine mammals throughout B.C., including Prince Rupert, Comox and Victoria.\n\nRobert Kiesman, chair of the Steveston Harbour Authority, says the authority has taken several steps to prevent people from feeding marine mammals like sea lions. (Lauren McCullough/CBC)\n\nA Richmond resident captured dramatic video on Saturday showing the sea lion grabbing the young girl by the dress and dragging her into the water off the dock.\n\nThe harbour authority has posted more signs along the dock where the girl was attacked Saturday, Kiesman said, in addition to staff who regularly patrol the area throughout the day to deliver verbal warnings.\n\nAccording to Canada's Marine Mammal Regulations, \"no person shall disturb a marine mammal except when fishing.\"\n\nThe signs at the Steveston docks say the maximum penalty for \"disturbing\" a marine mammal is $100,000.\n\nNew signs going up in <a href=\"https://twitter.com/hashtag/steveston?src=hash\">#steveston</a> <a href=\"https://twitter.com/hashtag/sealions?src=hash\">#sealions</a> <a href=\"https://twitter.com/hashtag/warning?src=hash\">#warning</a> <a href=\"https://t.co/J8c4V2djrm\">pic.twitter.com/J8c4V2djrm</a> —@Meerakati\n\n\"You can only spend so much time protecting people from their reckless behaviour,\" said Kiesman. \"We've now seen an example of why it's illegal to do this and why it's dangerous and frankly stupid to do this.\"\n\nThe signs also warn that sea lion bites \"can cause very serious infections that may lead to amputation of a limb or even death.\"\n\nDanielle Hyson, a senior marine mammal trainer at the Vancouver Aquarium, says if the girl has a puncture or broken skin from the incident, her family should call the aquarium.\n\nThat's because bacteria in sea lions' mouths can cause a specific infection, which Hyson said would need specific treatment. She said the aquarium could provide advice to a doctor about treatment.\n\nMichael Fujiwara's video showing a young girl being dragged into the ocean in Richmond by a sea lion has been viewed millions of times online. (Lauren McCullough/CBC)\n\nSFU student Michael Fujiwara captured the video. He said he was on the dock when he saw the large, male sea lion approach, so he started filming it as a crowd gathered around the animal.\n\nHe said a family began feeding it bread crumbs while the young girl got close to the edge of the dock.\n\n'Pretty shaken up'\n\nFujiwara said it appeared that no one was injured in the incident, but the girl and those with her left immediately after getting her back on the dock.\n\nHe told CBC News on Saturday that the family was \"pretty shaken up\" and appeared to be in shock.\n\nAfter a girl was dragged into water in Richmond, B.C., signs get posted over the dangers of feeding wild animals 1:53\n\nFujiwara said he goes once a week to the docks and sees sea lions often, but has never witnessed anything like what he was able to capture on video.\n\nI captured a scary moment of a seal dragging a young girl into the water at the <a href=\"https://twitter.com/hashtag/Richmond?src=hash\">#Richmond</a> Steveston Wharf <a href=\"https://twitter.com/hashtag/Vancouver?src=hash\">#Vancouver</a> <a href=\"https://t.co/58mzL0v1mM\">https://t.co/58mzL0v1mM</a> —@MichaelFujiwara\n\nAndrew Trites, director of UBC's Marine Mammal Research Unit, said the animal wasn't to blame for its behaviour in the video.\n\nWatch Trites analyze what happened in Michael Fujiwara's video:\n\nUBC's Andrew Trites discusses video showing sea lion and young girl at Steveston docks in Richmond B.C. 1:18\n\nTrites said the sea lion in the video looked like it's used to having people feed it, and probably mistook the girl's dress for food.\n\nHe said he hopes the video of the encounter teaches others to not feed wild animals like sea lions. He said the animals are not inherently dangerous and are not looking to grab people.\n\nThe majority of people commenting about the story online are critical of the family's role in the incident, however some say shaming them and the girl isn't helpful.\n\nWith files from Meera Bains.", "images": ["https://www.cbc.ca/a/static/media/logo_cbc-radio-canada.svg", "https://i.cbc.ca/1.4126330.1495409889!/fileImage/httpImage/image.jpg_gen/derivatives/original_780/michael-fujiwara-steveson-dock-sea-lion-video-taker.jpg", "https://i.cbc.ca/1.4126254.1495402986!/fileImage/httpImage/image.png_gen/derivatives/16x9_620/sea-lion-grabs-girl-steveston.png", "https://i.cbc.ca/1.4126327.1495409811!/fileImage/httpImage/image.jpg_gen/derivatives/original_780/robert-kiesman-chair-of-the-steveston-harbour-authority.jpg", "https://i.cbc.ca/1.4126254.1495402986!/fileImage/httpImage/image.png_gen/derivatives/16x9_780/sea-lion-grabs-girl-steveston.png"], "top_img": "https://i.cbc.ca/1.4126254.1495402986!/fileImage/httpImage/image.png_gen/derivatives/16x9_620/sea-lion-grabs-girl-steveston.png", "keywords": [], "authors": [], "canonical_link": "https://www.cbc.ca/news/canada/british-columbia/sea-lion-drags-girl-into-water-off-steveston-docks-in-richmond-b-c-1.4126203", "title": "Family slammed for 'reckless behaviour' after sea lion drags girl into water in Richmond, B.C.", "meta_data": {"viewport": "width=device-width, initial-scale=1", "og": {"site_name": "CBC", "url": "https://www.cbc.ca/news/canada/british-columbia/sea-lion-drags-girl-into-water-off-steveston-docks-in-richmond-b-c-1.4126203", "title": "Family slammed for 'reckless behaviour' after sea lion drags girl into water in Richmond, B.C. | CBC News", "image": "https://i.cbc.ca/1.4126254.1495402986!/fileImage/httpImage/image.png_gen/derivatives/16x9_620/sea-lion-grabs-girl-steveston.png", "description": "Port officials are lambasting the family of a young girl seen dragged into the water by a sea lion for \"reckless behaviour\" leading to the attack off a dock at Steveston in Richmond, B.C.", "locale": "en_US", "type": "article"}, "fb": {"pages": "139973899373506,280550026496,343345435724957,343354062403743,284576841689,253739841396467,118434788198374"}, "vf": {"section": "2.641", "unique_id": "1.4126203"}, "google-site-verification": "pJy_QmRvDz2tr7X8eQ6Y1L3Se-8RWM_PpJX42Pr_fYo", "twitter": {"site": "@cbc", "player": {"width": 640, "height": 360}, "card": "summary_large_image"}, "description": "Port officials are lambasting the family of a young girl seen dragged into the water by a sea lion for \"reckless behaviour\" leading to the attack off a dock at Steveston in Richmond, B.C."}, "movies": [], "publish_date": null, "source": "https://www.cbc.ca", "summary": ""}