{"url": "https://en.wikipedia.org/wiki/The_Way_(Ariana_Grande_song)", "text": "2013 single by Ariana Grande\n\n\"The Way\" is a song recorded by American singer Ariana Grande, featuring rapper Mac Miller, from Grande's debut studio album Yours Truly (2013). It was written by the song's producer Harmony Samuels, alongside Amber Streeter, Al Sherrod Lambert, Jordin Sparks, Brenda Russell, and Miller. The song's backing track is based on the piano melody from Russell's 1979 song \"A Little Bit of Love\", and the song has melodic and lyrical similarities to Big Pun's 1998 song \"Still Not a Player\", which also samples \"A Little Bit of Love\".[4][5]\n\n\"The Way\" was released on March 26, 2013, by Republic Records as the lead single from Yours Truly. The song debuted at number 10 and peaked at number 9 on the US Billboard Hot 100, becoming Grande and Miller's first top ten song on the chart. This also made Grande the first top ten arrival for a lead female artist making her first Hot 100 appearance since Yael Naim, who launched with \"New Soul\" back in 2008. As of April 2018, \"The Way\" has sold 2.4 million copies in the United States and has been certified triple platinum.\n\nBackground [ edit ]\n\nOn December 12, 2011, Grande released her debut single \"Put Your Hearts Up,\" a bubblegum pop song with a vastly different style of music and target demographic than \"The Way.\"[6] Whereas the lyrics in \"The Way\" deal with the subject of a flirty, romantic relationship, some sections with sexual implications, \"Put Your Hearts Up\" was a song aimed at young audiences, with lyrics about making the world a better place. During a radio interview on KIIS-FM on March 25, 2013 about her debut single, Grande confessed that she had in fact \"hated\" both the music video for and the song itself, considering it to be \"a terrible first impression.\" She added that she had wanted to \"pretend it never happened before it already happened\" and that she had felt no enthusiasm to promote the song at the time.[7]\n\nIn subsequent interviews, Grande implied that in order to feel \"passionate\" about her music, it needed to relate to her maturing personality. In an interview with Billboard she said, \"When I do Sam & Cat, and when I act as Cat, of course I'm still going to be there for my younger fans. But I'm also growing up – I'm almost 20. I'm not going to do anything crazy, but I want to do music that I'm passionate about. I'm finally at an age where I can do the music that I grew up loving, which was urban pop, 90s music. I grew up listening to the divas, so I'm very happy to finally do urban pop. I hope that it's received well, and it has been so far.\"[8]\n\n\"The Way\" can be seen as the reboot of Grande's singing career, steering her toward an older demographic and a different musical genre than where she originally began. In January 2013, she met with producer Harmony Samuels, at which point he presented her with a demo of the song that featured the vocals of co-writer Jordin Sparks, whom the song was originally intended.[9] The beat he had created for the single, samples Brenda Russell's \"A Little Bit of Love\" either directly or indirectly, via Big Pun's \"Still Not a Player\". Grande immediately connected with the sound and asked Mac Miller to feature on the song with her, to which he responded, \"Sounds like a hit to me.\"[8] The song was recorded that same month, and caught the attention of Republic Records VP Charlie Walk when he heard it being played from Republic co-founder Monte Lipman's office. \"It was 8:00 one night, and I heard a song coming from Monte's office through my wall. He called me down and I played a video, a DIY of Ariana Grande. We heard the song and I immediately made the decision to set it up [and] put the song out.\" [10]\n\nPromotion and release [ edit ]\n\nGrande created online buzz in the weeks leading up to her single's release through social media. She first tweeted about \"The Way\" on March 5, 2013, stating that the song would be released later that month.[11] On March 13, she announced the release date.[12] She posted a teaser trailer for both the song and the music video on her YouTube page on March 16[13] and then shared a second teaser on March 21.[14]\n\nIn the later half of March, Grande went on a radio tour across the United States, focusing on some of the most popular Top 40 stations in the country. She visited both Y-100 Miami[15] and 93.3 FM[16] on March 18 for interviews. The next day she went on Elvis Duran and the Morning Show[17][18] and attended a release party thrown by Z100, where she spoke to fans about her music.[19] On March 25, she visited KIIS-FM for an interview with JoJo Wright.[20] She visited 99-7 Now on March 29.[21] \"The Way\" debuted on On Air with Ryan Seacrest on March 25, 2013.[22]\n\nCritical reception [ edit ]\n\npictured). Critics have compared Grande's vocals to that of Mariah Carey ).\n\nDigital Spy gave the song a five out of five star rating comparing the song's sound and Ariana's vocals to Mariah Carey's, continuing to say Ariana has a \"powerful vocal\" whilst the song has \"bouncy piano riff\" and \"throwback R&B beats\".[23] Sam Lansky of Idolator gave the song a positive review, calling the vocals \"sweet, soulful, and grown-up\".[24] MTV Buzzworthy's Jenna Hally Rubenstein praised the song, advising readers to \"keep one eye on Ariana\" as \"she may very well be the hottest pop newcomer in the game.\" Rubenstein also commented that the song's \"early '00s-influenced R&B vibes\" made it sound like an updated version of Jennifer Lopez's \"I'm Real\" featuring Ja Rule.[25] Nick Catucci of Rolling Stone magazine gave the song 3 and half stars, saying that Grande is \"more flirty than freaky, but her Mariah-esque vocals verge on ecstatic.\"[26]\n\nAccolades [ edit ]\n\nYear Organization Award Result Ref. 2013 Teen Choice Awards Choice Love Song Nominated [27]\n\nCommercial performance [ edit ]\n\nFollowing its release, \"The Way\" sold over 120,000 digital downloads within the first 48 hours and 219,000 in its first week.[8][28] It debuted at number 10 on the Billboard Hot 100 chart for the week ending April 5, 2013, becoming Grande and Miller's first top-ten hit. This made Grande the first top-ten arrival for a lead female artist making her first Hot 100 appearance since Yael Naim, who launched with \"New Soul\" back in 2008.[28] The song dropped to number 22 during its second week on the chart, and then to number 37. As radio stations gave it more attention, the song gradually rebounded, eventually peaking at number 9 for two weeks.[29] \"The Way\" spent 26 weeks in the Billboard Hot 100 chart, all but two in the top 40.[citation needed] The Spanglish version of \"The Way\" reached number 5 on Billboard's Latin Pop Songs chart on the week ending August 24, 2013.[1] On July 30, 2014, \"The Way\" was certified triple platinum by the Recording Industry Association of America for sales and streaming data in excess of three million units in the United States.[30] As of April 2018, the song has sold over 2.4 million copies in the United States.[31]\n\nMusic video [ edit ]\n\nThe music video for \"The Way\" was filmed on February 10 and 11, 2013. On March 16, 2013, the first teaser for the song was released via her YouTube page.[32][33][34] The second teaser was released on Ryan Seacrest's website two days later, and later on Grande's page.[35] The video was released on March 28, 2013. Directed by Jones Crow, the video consists of Grande, Miller, and a group of dancers. Grande poses for pictures taken by Miller on various cameras, while dancing around a room filled with balloons and their images are projected on the wall. At the end of the video, Miller and Grande kiss, which Grande described as \"quite a statement\" of growing up.[8] The video was Vevo-certified on October 2, 2013, having reached 100 million views.[36] As of March 2020, the music video has over 390 million views on YouTube.[37]\n\nLive performances [ edit ]\n\nGrande performed the song on several television shows such as The Ellen DeGeneres Show,[38] Late Night with Jimmy Fallon,[39] Jimmy Kimmel Live! and Today alongside Mac Miller.\n\nShe also performed the song at the 2013 MTV Video Music Awards during the pre-show along with \"Baby I\". She performed the song on subsequent concerts, including being the opening act on the last three days of Justin Bieber's Believe Tour,[40] and as a duet with Miller on One Love Manchester.[41]\n\nCopyright infringement lawsuit [ edit ]\n\nOn December 11, 2013, Minder Music filed a copyright infringement lawsuit against Grande, Sony/ATV, UMG Recording and other parties. It claimed that the line \"What we gotta do right here is go back, back into time\", which is spoken in the introduction to \"The Way\", infringes its copyright in the 1972 single \"Troglodyte\" by The Jimmy Castor Bunch, which contains the spoken lyric, \"What we're gonna do right here is go back, way back, back into time\".[42]\n\nThe suit argued that the songs' similarities include \"nearly identical lyrics; similar enunciation speed with a fast and consistent pace for 'What we gotta do right' and a slightly slower pace for 'here is go back,' and substantially similar placement\" at the beginning of both songs.[42] Minder Music sought a permanent injunction, statutory damages of $150,000 per infringement, and legal fees.[42][43] The case was settled outside of court in 2015.[44]\n\nRemix [ edit ]\n\nThe official remix features American rapper Fabolous. It was released online on July 11, 2013.[45]\n\nTrack listings [ edit ]\n\nDigital download[46]\n\n\"The Way\" (featuring Mac Miller) – 3:46 \"The Way\" (Spanglish Version featuring Mac Miller) – 3:46\n\nCD single[47]\n\n\"The Way\" (featuring Mac Miller) – 3:48 \"The Way\" – 3:10\n\nCredits [ edit ]\n\nCredits adapted from the CD single liner notes.[47]\n\nComposed by – Harmony Samuels\n\nEngineer – Carlos King, Jose Cardoza\n\nEngineer [Vocals] – Chris \"Tek\" O'Ryan\n\nFeaturing – Mac Miller\n\nMixed by – Jaycen Joshua\n\nMixed by [Assistant] – Trehy Harris\n\nProducer – Harmony Samuels\n\nProducer [Vocals] – Ariana Grande, Sauce\n\nWritten by – Al Sherrod Lambert, Amber Streeter, Brenda Russell, Harmony Samuels, Jordin Sparks, Malcolm McCormick\n\nCharts [ edit ]\n\nCertifications [ edit ]\n\nSince May 2013 RIAA certifications for digital singles include on-demand audio and/or video song streams in addition to downloads.[77]\n\nRelease history [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/e/ed/Ariana_Grande_-_The_Way.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/48/Folder_Hexagonal_Icon.svg/16px-Folder_Hexagonal_Icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Mariah_Carey_Neighborhood_Ball_in_downtown_Washington_2009_cropped.JPG/170px-Mariah_Carey_Neighborhood_Ball_in_downtown_Washington_2009_cropped.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Symbol_book_class2.svg/16px-Symbol_book_class2.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/3/37/Dagger-14-plain.png", "https://en.wikipedia.org/static/images/wikimedia-button.png", "https://en.wikipedia.org/static/images/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Mac_Miller_Governors_Ball.jpg/150px-Mac_Miller_Governors_Ball.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/e/ed/Ariana_Grande_-_The_Way.png/220px-Ariana_Grande_-_The_Way.png", "https://upload.wikimedia.org/wikipedia/commons/f/f9/Double-dagger-14-plain.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/e/ed/Ariana_Grande_-_The_Way.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Way_(Ariana_Grande_song)", "title": "The Way (Ariana Grande song)", "meta_data": {"generator": "MediaWiki 1.35.0-wmf.28", "referrer": "origin-when-cross-origin", "og": {"image": "https://upload.wikimedia.org/wikipedia/en/e/ed/Ariana_Grande_-_The_Way.png"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}